/* automatically generated by rust-bindgen 0.60.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
	storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
	#[inline]
	pub const fn new(storage: Storage) -> Self { Self { storage } }
}
impl<Storage> __BindgenBitfieldUnit<Storage> where Storage: AsRef<[u8]> + AsMut<[u8]> {
	#[inline]
	pub fn get_bit(&self, index: usize) -> bool {
		debug_assert!(index / 8 < self.storage.as_ref().len());
		let byte_index = index / 8;
		let byte = self.storage.as_ref()[byte_index];
		let bit_index = if cfg!(target_endian = "big") {
			7 - (index % 8)
		} else {
			index % 8
		};
		let mask = 1 << bit_index;
		byte & mask == mask
	}
	#[inline]
	pub fn set_bit(&mut self, index: usize, val: bool) {
		debug_assert!(index / 8 < self.storage.as_ref().len());
		let byte_index = index / 8;
		let byte = &mut self.storage.as_mut()[byte_index];
		let bit_index = if cfg!(target_endian = "big") {
			7 - (index % 8)
		} else {
			index % 8
		};
		let mask = 1 << bit_index;
		if val {
			*byte |= mask;
		} else {
			*byte &= !mask;
		}
	}
	#[inline]
	pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
		debug_assert!(bit_width <= 64);
		debug_assert!(bit_offset / 8 < self.storage.as_ref().len());
		debug_assert!((bit_offset + (bit_width as usize)) / 8 <= self.storage.as_ref().len());
		let mut val = 0;
		for i in 0..(bit_width as usize) {

pub type __int_least32_t = core::ffi::c_int;
pub type __uint_least32_t = core::ffi::c_uint;
pub type __int_least64_t = core::ffi::c_longlong;
pub type __uint_least64_t = core::ffi::c_ulonglong;
pub type __intmax_t = core::ffi::c_longlong;
pub type __uintmax_t = core::ffi::c_ulonglong;
pub type __intptr_t = core::ffi::c_int;
pub type __uintptr_t = core::ffi::c_uint;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = core::ffi::c_schar;
pub type uint_fast8_t = core::ffi::c_uchar;
pub type int_fast16_t = core::ffi::c_short;
pub type uint_fast16_t = core::ffi::c_ushort;
pub type int_fast32_t = core::ffi::c_int;
pub type uint_fast32_t = core::ffi::c_uint;
pub type int_fast64_t = core::ffi::c_longlong;
pub type uint_fast64_t = core::ffi::c_ulonglong;
#[repr(C)]
pub struct Bt {
	_unused: [u8; 0],
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Clone, Hash, PartialEq, Eq)]
pub enum BtStatus {
	BtStatusUnavailable = 0,
	BtStatusOff = 1,
	BtStatusAdvertising = 2,
	BtStatusConnected = 3,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Clone, Hash, PartialEq, Eq)]
pub enum BtProfile {
	BtProfileSerial = 0,
	BtProfileHidKeyboard = 1,
}
pub type BtStatusChangedCallback = ::core::option::Option<unsafe extern "C" fn(status: BtStatus, context: *mut core::ffi::c_void)>;
extern "C" {
	#[doc = " Change BLE Profile"]
	#[doc = " @note Call of this function leads to 2nd core restart"]
	#[doc = ""]
	#[doc = " @param bt        Bt instance"]
	#[doc = " @param profile   BtProfile"]
	#[doc = ""]
	#[doc = " @return          true on success"]
	pub fn bt_set_profile(bt: *mut Bt, profile: BtProfile) -> bool;
}
extern "C" {
	#[doc = " Disconnect from Central"]
	#[doc = ""]
	#[doc = " @param bt        Bt instance"]
	pub fn bt_disconnect(bt: *mut Bt);
}
extern "C" {
	#[doc = " Set callback for Bluetooth status change notification"]
	#[doc = ""]
	#[doc = " @param bt        Bt instance"]
	#[doc = " @param callback  BtStatusChangedCallback instance"]
	#[doc = " @param context   pointer to context"]
	pub fn bt_set_status_changed_callback(bt: *mut Bt, callback: BtStatusChangedCallback, context: *mut core::ffi::c_void);
}
extern "C" {
	#[doc = " Forget bonded devices"]
	#[doc = " @note Leads to wipe ble key storage and deleting bt.keys"]
	#[doc = ""]
	#[doc = " @param bt        Bt instance"]
	pub fn bt_forget_bonded_devices(bt: *mut Bt);
}
pub type wchar_t = core::ffi::c_uint;
#[repr(C)]
pub struct max_align_t {
	pub __clang_max_align_nonce1: core::ffi::c_longlong,
	pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
	assert_eq!(
	           ::core::mem::size_of::<max_align_t>(),
	           16usize,
	           concat!("Size of: ", stringify!(max_align_t))
	);
	assert_eq!(
	           ::core::mem::align_of::<max_align_t>(),
	           8usize,
	           concat!("Alignment of ", stringify!(max_align_t))
	);
	fn test_field___clang_max_align_nonce1() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<max_align_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(max_align_t),
			"::",
			stringify!(__clang_max_align_nonce1)
		)
		);
	}
	test_field___clang_max_align_nonce1();
	fn test_field___clang_max_align_nonce2() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<max_align_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize
		           },
		           8usize,
		           concat!(
			"Offset of field: ",
			stringify!(max_align_t),
			"::",
			stringify!(__clang_max_align_nonce2)
		)
		);
	}
	test_field___clang_max_align_nonce2();
}
pub type wint_t = core::ffi::c_int;
pub type __blkcnt_t = core::ffi::c_long;
pub type __blksize_t = core::ffi::c_long;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint32_t;
pub type _off_t = core::ffi::c_long;
pub type __pid_t = core::ffi::c_int;
pub type __dev_t = core::ffi::c_short;
pub type __uid_t = core::ffi::c_ushort;
pub type __gid_t = core::ffi::c_ushort;
pub type __id_t = __uint32_t;
pub type __ino_t = core::ffi::c_ushort;
pub type __mode_t = __uint32_t;
pub type _off64_t = core::ffi::c_longlong;
pub type __off_t = _off_t;
pub type __loff_t = _off64_t;
pub type __key_t = core::ffi::c_long;
pub type _fpos_t = core::ffi::c_long;
pub type __size_t = core::ffi::c_uint;
pub type _ssize_t = core::ffi::c_int;
pub type __ssize_t = _ssize_t;
#[repr(C)]
pub struct _mbstate_t {
	pub __count: core::ffi::c_int,
	pub __value: _mbstate_t__bindgen_ty_1,
}
#[repr(C)]
pub struct _mbstate_t__bindgen_ty_1 {
	pub __wch: __BindgenUnionField<wint_t>,
	pub __wchb: __BindgenUnionField<[core::ffi::c_uchar; 4usize]>,
	pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout__mbstate_t__bindgen_ty_1() {
	assert_eq!(
	           ::core::mem::size_of::<_mbstate_t__bindgen_ty_1>(),
	           4usize,
	           concat!("Size of: ", stringify!(_mbstate_t__bindgen_ty_1))
	);
	assert_eq!(
	           ::core::mem::align_of::<_mbstate_t__bindgen_ty_1>(),
	           4usize,
	           concat!("Alignment of ", stringify!(_mbstate_t__bindgen_ty_1))
	);
	fn test_field___wch() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_mbstate_t__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(_mbstate_t__bindgen_ty_1),
			"::",
			stringify!(__wch)
		)
		);
	}
	test_field___wch();
	fn test_field___wchb() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_mbstate_t__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(_mbstate_t__bindgen_ty_1),
			"::",
			stringify!(__wchb)
		)
		);
	}
	test_field___wchb();
}
#[test]
fn bindgen_test_layout__mbstate_t() {
	assert_eq!(
	           ::core::mem::size_of::<_mbstate_t>(),
	           8usize,
	           concat!("Size of: ", stringify!(_mbstate_t))
	);
	assert_eq!(
	           ::core::mem::align_of::<_mbstate_t>(),
	           4usize,
	           concat!("Alignment of ", stringify!(_mbstate_t))
	);
	fn test_field___count() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_mbstate_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__count) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(_mbstate_t), "::", stringify!(__count))
		);
	}
	test_field___count();
	fn test_field___value() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_mbstate_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__value) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(_mbstate_t), "::", stringify!(__value))
		);
	}
	test_field___value();
}
pub type _iconv_t = *mut core::ffi::c_void;
pub type __clock_t = core::ffi::c_ulong;
pub type __time_t = __int_least64_t;
pub type __clockid_t = core::ffi::c_ulong;
pub type __timer_t = core::ffi::c_ulong;
pub type __sa_family_t = __uint8_t;
pub type __socklen_t = __uint32_t;
pub type __nl_item = core::ffi::c_int;
pub type __nlink_t = core::ffi::c_ushort;
pub type __suseconds_t = core::ffi::c_long;
pub type __useconds_t = core::ffi::c_ulong;
pub type __va_list = u32;
pub type __ULong = core::ffi::c_ulong;
#[repr(C)]
pub struct __lock {
	_unused: [u8; 0],
}
pub type _LOCK_T = *mut __lock;
extern "C" {
	pub fn __retarget_lock_init(lock: *mut _LOCK_T);
}
extern "C" {
	pub fn __retarget_lock_init_recursive(lock: *mut _LOCK_T);
}
extern "C" {
	pub fn __retarget_lock_close(lock: _LOCK_T);
}
extern "C" {
	pub fn __retarget_lock_close_recursive(lock: _LOCK_T);
}
extern "C" {
	pub fn __retarget_lock_acquire(lock: _LOCK_T);
}
extern "C" {
	pub fn __retarget_lock_acquire_recursive(lock: _LOCK_T);
}
extern "C" {
	pub fn __retarget_lock_try_acquire(lock: _LOCK_T) -> core::ffi::c_int;
}
extern "C" {
	pub fn __retarget_lock_try_acquire_recursive(lock: _LOCK_T) -> core::ffi::c_int;
}
extern "C" {
	pub fn __retarget_lock_release(lock: _LOCK_T);
}
extern "C" {
	pub fn __retarget_lock_release_recursive(lock: _LOCK_T);
}
pub type _flock_t = _LOCK_T;
#[repr(C)]
pub struct __locale_t {
	_unused: [u8; 0],
}
#[repr(C)]
pub struct _Bigint {
	pub _next: *mut _Bigint,
	pub _k: core::ffi::c_int,
	pub _maxwds: core::ffi::c_int,
	pub _sign: core::ffi::c_int,
	pub _wds: core::ffi::c_int,
	pub _x: [__ULong; 1usize],
}
#[test]
fn bindgen_test_layout__Bigint() {
	assert_eq!(
	           ::core::mem::size_of::<_Bigint>(),
	           24usize,
	           concat!("Size of: ", stringify!(_Bigint))
	);
	assert_eq!(
	           ::core::mem::align_of::<_Bigint>(),
	           4usize,
	           concat!("Alignment of ", stringify!(_Bigint))
	);
	fn test_field__next() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_Bigint>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._next) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(_Bigint), "::", stringify!(_next))
		);
	}
	test_field__next();
	fn test_field__k() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_Bigint>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._k) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(_Bigint), "::", stringify!(_k))
		);
	}
	test_field__k();
	fn test_field__maxwds() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_Bigint>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._maxwds) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(_Bigint), "::", stringify!(_maxwds))
		);
	}
	test_field__maxwds();
	fn test_field__sign() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_Bigint>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._sign) as usize - ptr as usize
		           },
		           12usize,
		           concat!("Offset of field: ", stringify!(_Bigint), "::", stringify!(_sign))
		);
	}
	test_field__sign();
	fn test_field__wds() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_Bigint>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._wds) as usize - ptr as usize
		           },
		           16usize,
		           concat!("Offset of field: ", stringify!(_Bigint), "::", stringify!(_wds))
		);
	}
	test_field__wds();
	fn test_field__x() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_Bigint>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._x) as usize - ptr as usize
		           },
		           20usize,
		           concat!("Offset of field: ", stringify!(_Bigint), "::", stringify!(_x))
		);
	}
	test_field__x();
}
#[repr(C)]
pub struct __tm {
	pub __tm_sec: core::ffi::c_int,
	pub __tm_min: core::ffi::c_int,
	pub __tm_hour: core::ffi::c_int,
	pub __tm_mday: core::ffi::c_int,
	pub __tm_mon: core::ffi::c_int,
	pub __tm_year: core::ffi::c_int,
	pub __tm_wday: core::ffi::c_int,
	pub __tm_yday: core::ffi::c_int,
	pub __tm_isdst: core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___tm() {
	assert_eq!(
	           ::core::mem::size_of::<__tm>(),
	           36usize,
	           concat!("Size of: ", stringify!(__tm))
	);
	assert_eq!(
	           ::core::mem::align_of::<__tm>(),
	           4usize,
	           concat!("Alignment of ", stringify!(__tm))
	);
	fn test_field___tm_sec() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__tm>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__tm_sec) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(__tm), "::", stringify!(__tm_sec))
		);
	}
	test_field___tm_sec();
	fn test_field___tm_min() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__tm>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__tm_min) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(__tm), "::", stringify!(__tm_min))
		);
	}
	test_field___tm_min();
	fn test_field___tm_hour() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__tm>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__tm_hour) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(__tm), "::", stringify!(__tm_hour))
		);
	}
	test_field___tm_hour();
	fn test_field___tm_mday() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__tm>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__tm_mday) as usize - ptr as usize
		           },
		           12usize,
		           concat!("Offset of field: ", stringify!(__tm), "::", stringify!(__tm_mday))
		);
	}
	test_field___tm_mday();
	fn test_field___tm_mon() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__tm>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__tm_mon) as usize - ptr as usize
		           },
		           16usize,
		           concat!("Offset of field: ", stringify!(__tm), "::", stringify!(__tm_mon))
		);
	}
	test_field___tm_mon();
	fn test_field___tm_year() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__tm>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__tm_year) as usize - ptr as usize
		           },
		           20usize,
		           concat!("Offset of field: ", stringify!(__tm), "::", stringify!(__tm_year))
		);
	}
	test_field___tm_year();
	fn test_field___tm_wday() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__tm>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__tm_wday) as usize - ptr as usize
		           },
		           24usize,
		           concat!("Offset of field: ", stringify!(__tm), "::", stringify!(__tm_wday))
		);
	}
	test_field___tm_wday();
	fn test_field___tm_yday() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__tm>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__tm_yday) as usize - ptr as usize
		           },
		           28usize,
		           concat!("Offset of field: ", stringify!(__tm), "::", stringify!(__tm_yday))
		);
	}
	test_field___tm_yday();
	fn test_field___tm_isdst() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__tm>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__tm_isdst) as usize - ptr as usize
		           },
		           32usize,
		           concat!("Offset of field: ", stringify!(__tm), "::", stringify!(__tm_isdst))
		);
	}
	test_field___tm_isdst();
}
#[repr(C)]
pub struct _on_exit_args {
	pub _fnargs: [*mut core::ffi::c_void; 32usize],
	pub _dso_handle: [*mut core::ffi::c_void; 32usize],
	pub _fntypes: __ULong,
	pub _is_cxa: __ULong,
}
#[test]
fn bindgen_test_layout__on_exit_args() {
	assert_eq!(
	           ::core::mem::size_of::<_on_exit_args>(),
	           264usize,
	           concat!("Size of: ", stringify!(_on_exit_args))
	);
	assert_eq!(
	           ::core::mem::align_of::<_on_exit_args>(),
	           4usize,
	           concat!("Alignment of ", stringify!(_on_exit_args))
	);
	fn test_field__fnargs() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_on_exit_args>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._fnargs) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(_on_exit_args), "::", stringify!(_fnargs))
		);
	}
	test_field__fnargs();
	fn test_field__dso_handle() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_on_exit_args>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._dso_handle) as usize - ptr as usize
		           },
		           128usize,
		           concat!("Offset of field: ", stringify!(_on_exit_args), "::", stringify!(_dso_handle))
		);
	}
	test_field__dso_handle();
	fn test_field__fntypes() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_on_exit_args>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._fntypes) as usize - ptr as usize
		           },
		           256usize,
		           concat!("Offset of field: ", stringify!(_on_exit_args), "::", stringify!(_fntypes))
		);
	}
	test_field__fntypes();
	fn test_field__is_cxa() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_on_exit_args>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._is_cxa) as usize - ptr as usize
		           },
		           260usize,
		           concat!("Offset of field: ", stringify!(_on_exit_args), "::", stringify!(_is_cxa))
		);
	}
	test_field__is_cxa();
}
#[repr(C)]
pub struct _atexit {
	pub _next: *mut _atexit,
	pub _ind: core::ffi::c_int,
	pub _fns: [::core::option::Option<unsafe extern "C" fn()>; 32usize],
	pub _on_exit_args: _on_exit_args,
}
#[test]
fn bindgen_test_layout__atexit() {
	assert_eq!(
	           ::core::mem::size_of::<_atexit>(),
	           400usize,
	           concat!("Size of: ", stringify!(_atexit))
	);
	assert_eq!(
	           ::core::mem::align_of::<_atexit>(),
	           4usize,
	           concat!("Alignment of ", stringify!(_atexit))
	);
	fn test_field__next() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_atexit>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._next) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(_atexit), "::", stringify!(_next))
		);
	}
	test_field__next();
	fn test_field__ind() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_atexit>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._ind) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(_atexit), "::", stringify!(_ind))
		);
	}
	test_field__ind();
	fn test_field__fns() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_atexit>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._fns) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(_atexit), "::", stringify!(_fns))
		);
	}
	test_field__fns();
	fn test_field__on_exit_args() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_atexit>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._on_exit_args) as usize - ptr as usize
		           },
		           136usize,
		           concat!("Offset of field: ", stringify!(_atexit), "::", stringify!(_on_exit_args))
		);
	}
	test_field__on_exit_args();
}
#[repr(C)]
pub struct __sbuf {
	pub _base: *mut core::ffi::c_uchar,
	pub _size: core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___sbuf() {
	assert_eq!(
	           ::core::mem::size_of::<__sbuf>(),
	           8usize,
	           concat!("Size of: ", stringify!(__sbuf))
	);
	assert_eq!(
	           ::core::mem::align_of::<__sbuf>(),
	           4usize,
	           concat!("Alignment of ", stringify!(__sbuf))
	);
	fn test_field__base() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sbuf>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._base) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(__sbuf), "::", stringify!(_base))
		);
	}
	test_field__base();
	fn test_field__size() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sbuf>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._size) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(__sbuf), "::", stringify!(_size))
		);
	}
	test_field__size();
}
#[repr(C)]
pub struct __sFILE {
	pub _p: *mut core::ffi::c_uchar,
	pub _r: core::ffi::c_int,
	pub _w: core::ffi::c_int,
	pub _flags: core::ffi::c_short,
	pub _file: core::ffi::c_short,
	pub _bf: __sbuf,
	pub _lbfsize: core::ffi::c_int,
	pub _cookie: *mut core::ffi::c_void,
	pub _read: ::core::option::Option<unsafe extern "C" fn(arg1: *mut _reent,
	                                                       arg2: *mut core::ffi::c_void,
	                                                       arg3: *mut core::ffi::c_char,
	                                                       arg4: core::ffi::c_int)
	                                                       -> core::ffi::c_int>,
	pub _write: ::core::option::Option<unsafe extern "C" fn(arg1: *mut _reent,
	                                                        arg2: *mut core::ffi::c_void,
	                                                        arg3: *const core::ffi::c_char,
	                                                        arg4: core::ffi::c_int)
	                                                        -> core::ffi::c_int>,
	pub _seek: ::core::option::Option<unsafe extern "C" fn(arg1: *mut _reent,
	                                                       arg2: *mut core::ffi::c_void,
	                                                       arg3: _fpos_t,
	                                                       arg4: core::ffi::c_int)
	                                                       -> _fpos_t>,
	pub _close: ::core::option::Option<unsafe extern "C" fn(arg1: *mut _reent, arg2: *mut core::ffi::c_void) -> core::ffi::c_int>,
	pub _ub: __sbuf,
	pub _up: *mut core::ffi::c_uchar,
	pub _ur: core::ffi::c_int,
	pub _ubuf: [core::ffi::c_uchar; 3usize],
	pub _nbuf: [core::ffi::c_uchar; 1usize],
	pub _lb: __sbuf,
	pub _blksize: core::ffi::c_int,
	pub _offset: _off_t,
	pub _data: *mut _reent,
	pub _lock: _flock_t,
	pub _mbstate: _mbstate_t,
	pub _flags2: core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___sFILE() {
	assert_eq!(
	           ::core::mem::size_of::<__sFILE>(),
	           104usize,
	           concat!("Size of: ", stringify!(__sFILE))
	);
	assert_eq!(
	           ::core::mem::align_of::<__sFILE>(),
	           4usize,
	           concat!("Alignment of ", stringify!(__sFILE))
	);
	fn test_field__p() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._p) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_p))
		);
	}
	test_field__p();
	fn test_field__r() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._r) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_r))
		);
	}
	test_field__r();
	fn test_field__w() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._w) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_w))
		);
	}
	test_field__w();
	fn test_field__flags() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize
		           },
		           12usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_flags))
		);
	}
	test_field__flags();
	fn test_field__file() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._file) as usize - ptr as usize
		           },
		           14usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_file))
		);
	}
	test_field__file();
	fn test_field__bf() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._bf) as usize - ptr as usize
		           },
		           16usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_bf))
		);
	}
	test_field__bf();
	fn test_field__lbfsize() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._lbfsize) as usize - ptr as usize
		           },
		           24usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_lbfsize))
		);
	}
	test_field__lbfsize();
	fn test_field__cookie() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._cookie) as usize - ptr as usize
		           },
		           28usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_cookie))
		);
	}
	test_field__cookie();
	fn test_field__read() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._read) as usize - ptr as usize
		           },
		           32usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_read))
		);
	}
	test_field__read();
	fn test_field__write() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._write) as usize - ptr as usize
		           },
		           36usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_write))
		);
	}
	test_field__write();
	fn test_field__seek() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._seek) as usize - ptr as usize
		           },
		           40usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_seek))
		);
	}
	test_field__seek();
	fn test_field__close() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._close) as usize - ptr as usize
		           },
		           44usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_close))
		);
	}
	test_field__close();
	fn test_field__ub() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._ub) as usize - ptr as usize
		           },
		           48usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_ub))
		);
	}
	test_field__ub();
	fn test_field__up() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._up) as usize - ptr as usize
		           },
		           56usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_up))
		);
	}
	test_field__up();
	fn test_field__ur() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._ur) as usize - ptr as usize
		           },
		           60usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_ur))
		);
	}
	test_field__ur();
	fn test_field__ubuf() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._ubuf) as usize - ptr as usize
		           },
		           64usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_ubuf))
		);
	}
	test_field__ubuf();
	fn test_field__nbuf() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._nbuf) as usize - ptr as usize
		           },
		           67usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_nbuf))
		);
	}
	test_field__nbuf();
	fn test_field__lb() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._lb) as usize - ptr as usize
		           },
		           68usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_lb))
		);
	}
	test_field__lb();
	fn test_field__blksize() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._blksize) as usize - ptr as usize
		           },
		           76usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_blksize))
		);
	}
	test_field__blksize();
	fn test_field__offset() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize
		           },
		           80usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_offset))
		);
	}
	test_field__offset();
	fn test_field__data() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._data) as usize - ptr as usize
		           },
		           84usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_data))
		);
	}
	test_field__data();
	fn test_field__lock() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize
		           },
		           88usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_lock))
		);
	}
	test_field__lock();
	fn test_field__mbstate() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._mbstate) as usize - ptr as usize
		           },
		           92usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_mbstate))
		);
	}
	test_field__mbstate();
	fn test_field__flags2() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<__sFILE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize
		           },
		           100usize,
		           concat!("Offset of field: ", stringify!(__sFILE), "::", stringify!(_flags2))
		);
	}
	test_field__flags2();
}
pub type __FILE = __sFILE;
#[repr(C)]
pub struct _glue {
	pub _next: *mut _glue,
	pub _niobs: core::ffi::c_int,
	pub _iobs: *mut __FILE,
}
#[test]
fn bindgen_test_layout__glue() {
	assert_eq!(
	           ::core::mem::size_of::<_glue>(),
	           12usize,
	           concat!("Size of: ", stringify!(_glue))
	);
	assert_eq!(
	           ::core::mem::align_of::<_glue>(),
	           4usize,
	           concat!("Alignment of ", stringify!(_glue))
	);
	fn test_field__next() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_glue>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._next) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(_glue), "::", stringify!(_next))
		);
	}
	test_field__next();
	fn test_field__niobs() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_glue>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._niobs) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(_glue), "::", stringify!(_niobs))
		);
	}
	test_field__niobs();
	fn test_field__iobs() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_glue>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._iobs) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(_glue), "::", stringify!(_iobs))
		);
	}
	test_field__iobs();
}
#[repr(C)]
pub struct _rand48 {
	pub _seed: [core::ffi::c_ushort; 3usize],
	pub _mult: [core::ffi::c_ushort; 3usize],
	pub _add: core::ffi::c_ushort,
}
#[test]
fn bindgen_test_layout__rand48() {
	assert_eq!(
	           ::core::mem::size_of::<_rand48>(),
	           14usize,
	           concat!("Size of: ", stringify!(_rand48))
	);
	assert_eq!(
	           ::core::mem::align_of::<_rand48>(),
	           2usize,
	           concat!("Alignment of ", stringify!(_rand48))
	);
	fn test_field__seed() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_rand48>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._seed) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(_rand48), "::", stringify!(_seed))
		);
	}
	test_field__seed();
	fn test_field__mult() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_rand48>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._mult) as usize - ptr as usize
		           },
		           6usize,
		           concat!("Offset of field: ", stringify!(_rand48), "::", stringify!(_mult))
		);
	}
	test_field__mult();
	fn test_field__add() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_rand48>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._add) as usize - ptr as usize
		           },
		           12usize,
		           concat!("Offset of field: ", stringify!(_rand48), "::", stringify!(_add))
		);
	}
	test_field__add();
}
#[repr(C)]
pub struct _reent {
	pub _errno: core::ffi::c_int,
	pub _stdin: *mut __FILE,
	pub _stdout: *mut __FILE,
	pub _stderr: *mut __FILE,
	pub _inc: core::ffi::c_int,
	pub _emergency: [core::ffi::c_char; 25usize],
	pub _unspecified_locale_info: core::ffi::c_int,
	pub _locale: *mut __locale_t,
	pub __sdidinit: core::ffi::c_int,
	pub __cleanup: ::core::option::Option<unsafe extern "C" fn(arg1: *mut _reent)>,
	pub _result: *mut _Bigint,
	pub _result_k: core::ffi::c_int,
	pub _p5s: *mut _Bigint,
	pub _freelist: *mut *mut _Bigint,
	pub _cvtlen: core::ffi::c_int,
	pub _cvtbuf: *mut core::ffi::c_char,
	pub _new: _reent__bindgen_ty_1,
	pub _atexit: *mut _atexit,
	pub _atexit0: _atexit,
	pub _sig_func: *mut ::core::option::Option<unsafe extern "C" fn(arg1: core::ffi::c_int)>,
	pub __sglue: _glue,
	pub __sf: [__FILE; 3usize],
}
#[repr(C)]
pub struct _reent__bindgen_ty_1 {
	pub _reent: __BindgenUnionField<_reent__bindgen_ty_1__bindgen_ty_1>,
	pub _unused: __BindgenUnionField<_reent__bindgen_ty_1__bindgen_ty_2>,
	pub bindgen_union_field: [u64; 30usize],
}
#[repr(C)]
pub struct _reent__bindgen_ty_1__bindgen_ty_1 {
	pub _unused_rand: core::ffi::c_uint,
	pub _strtok_last: *mut core::ffi::c_char,
	pub _asctime_buf: [core::ffi::c_char; 26usize],
	pub _localtime_buf: __tm,
	pub _gamma_signgam: core::ffi::c_int,
	pub _rand_next: core::ffi::c_ulonglong,
	pub _r48: _rand48,
	pub _mblen_state: _mbstate_t,
	pub _mbtowc_state: _mbstate_t,
	pub _wctomb_state: _mbstate_t,
	pub _l64a_buf: [core::ffi::c_char; 8usize],
	pub _signal_buf: [core::ffi::c_char; 24usize],
	pub _getdate_err: core::ffi::c_int,
	pub _mbrlen_state: _mbstate_t,
	pub _mbrtowc_state: _mbstate_t,
	pub _mbsrtowcs_state: _mbstate_t,
	pub _wcrtomb_state: _mbstate_t,
	pub _wcsrtombs_state: _mbstate_t,
	pub _h_errno: core::ffi::c_int,
}
#[test]
fn bindgen_test_layout__reent__bindgen_ty_1__bindgen_ty_1() {
	assert_eq!(
	           ::core::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_1>(),
	           208usize,
	           concat!("Size of: ", stringify!(_reent__bindgen_ty_1__bindgen_ty_1))
	);
	assert_eq!(
	           ::core::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_1>(),
	           8usize,
	           concat!("Alignment of ", stringify!(_reent__bindgen_ty_1__bindgen_ty_1))
	);
	fn test_field__unused_rand() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._unused_rand) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_unused_rand)
		)
		);
	}
	test_field__unused_rand();
	fn test_field__strtok_last() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._strtok_last) as usize - ptr as usize
		           },
		           4usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_strtok_last)
		)
		);
	}
	test_field__strtok_last();
	fn test_field__asctime_buf() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._asctime_buf) as usize - ptr as usize
		           },
		           8usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_asctime_buf)
		)
		);
	}
	test_field__asctime_buf();
	fn test_field__localtime_buf() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._localtime_buf) as usize - ptr as usize
		           },
		           36usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_localtime_buf)
		)
		);
	}
	test_field__localtime_buf();
	fn test_field__gamma_signgam() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._gamma_signgam) as usize - ptr as usize
		           },
		           72usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_gamma_signgam)
		)
		);
	}
	test_field__gamma_signgam();
	fn test_field__rand_next() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._rand_next) as usize - ptr as usize
		           },
		           80usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_rand_next)
		)
		);
	}
	test_field__rand_next();
	fn test_field__r48() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._r48) as usize - ptr as usize
		           },
		           88usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_r48)
		)
		);
	}
	test_field__r48();
	fn test_field__mblen_state() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._mblen_state) as usize - ptr as usize
		           },
		           104usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_mblen_state)
		)
		);
	}
	test_field__mblen_state();
	fn test_field__mbtowc_state() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._mbtowc_state) as usize - ptr as usize
		           },
		           112usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_mbtowc_state)
		)
		);
	}
	test_field__mbtowc_state();
	fn test_field__wctomb_state() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._wctomb_state) as usize - ptr as usize
		           },
		           120usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_wctomb_state)
		)
		);
	}
	test_field__wctomb_state();
	fn test_field__l64a_buf() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._l64a_buf) as usize - ptr as usize
		           },
		           128usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_l64a_buf)
		)
		);
	}
	test_field__l64a_buf();
	fn test_field__signal_buf() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._signal_buf) as usize - ptr as usize
		           },
		           136usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_signal_buf)
		)
		);
	}
	test_field__signal_buf();
	fn test_field__getdate_err() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._getdate_err) as usize - ptr as usize
		           },
		           160usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_getdate_err)
		)
		);
	}
	test_field__getdate_err();
	fn test_field__mbrlen_state() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._mbrlen_state) as usize - ptr as usize
		           },
		           164usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_mbrlen_state)
		)
		);
	}
	test_field__mbrlen_state();
	fn test_field__mbrtowc_state() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._mbrtowc_state) as usize - ptr as usize
		           },
		           172usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_mbrtowc_state)
		)
		);
	}
	test_field__mbrtowc_state();
	fn test_field__mbsrtowcs_state() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._mbsrtowcs_state) as usize - ptr as usize
		           },
		           180usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_mbsrtowcs_state)
		)
		);
	}
	test_field__mbsrtowcs_state();
	fn test_field__wcrtomb_state() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._wcrtomb_state) as usize - ptr as usize
		           },
		           188usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_wcrtomb_state)
		)
		);
	}
	test_field__wcrtomb_state();
	fn test_field__wcsrtombs_state() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._wcsrtombs_state) as usize - ptr as usize
		           },
		           196usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_wcsrtombs_state)
		)
		);
	}
	test_field__wcsrtombs_state();
	fn test_field__h_errno() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._h_errno) as usize - ptr as usize
		           },
		           204usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(_h_errno)
		)
		);
	}
	test_field__h_errno();
}
#[repr(C)]
pub struct _reent__bindgen_ty_1__bindgen_ty_2 {
	pub _nextf: [*mut core::ffi::c_uchar; 30usize],
	pub _nmalloc: [core::ffi::c_uint; 30usize],
}
#[test]
fn bindgen_test_layout__reent__bindgen_ty_1__bindgen_ty_2() {
	assert_eq!(
	           ::core::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_2>(),
	           240usize,
	           concat!("Size of: ", stringify!(_reent__bindgen_ty_1__bindgen_ty_2))
	);
	assert_eq!(
	           ::core::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_2>(),
	           4usize,
	           concat!("Alignment of ", stringify!(_reent__bindgen_ty_1__bindgen_ty_2))
	);
	fn test_field__nextf() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_2>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._nextf) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_2),
			"::",
			stringify!(_nextf)
		)
		);
	}
	test_field__nextf();
	fn test_field__nmalloc() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1__bindgen_ty_2>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._nmalloc) as usize - ptr as usize
		           },
		           120usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1__bindgen_ty_2),
			"::",
			stringify!(_nmalloc)
		)
		);
	}
	test_field__nmalloc();
}
#[test]
fn bindgen_test_layout__reent__bindgen_ty_1() {
	assert_eq!(
	           ::core::mem::size_of::<_reent__bindgen_ty_1>(),
	           240usize,
	           concat!("Size of: ", stringify!(_reent__bindgen_ty_1))
	);
	assert_eq!(
	           ::core::mem::align_of::<_reent__bindgen_ty_1>(),
	           8usize,
	           concat!("Alignment of ", stringify!(_reent__bindgen_ty_1))
	);
	fn test_field__reent() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._reent) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1),
			"::",
			stringify!(_reent)
		)
		);
	}
	test_field__reent();
	fn test_field__unused() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._unused) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent__bindgen_ty_1),
			"::",
			stringify!(_unused)
		)
		);
	}
	test_field__unused();
}
#[test]
fn bindgen_test_layout__reent() {
	assert_eq!(
	           ::core::mem::size_of::<_reent>(),
	           1064usize,
	           concat!("Size of: ", stringify!(_reent))
	);
	assert_eq!(
	           ::core::mem::align_of::<_reent>(),
	           8usize,
	           concat!("Alignment of ", stringify!(_reent))
	);
	fn test_field__errno() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._errno) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_errno))
		);
	}
	test_field__errno();
	fn test_field__stdin() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._stdin) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_stdin))
		);
	}
	test_field__stdin();
	fn test_field__stdout() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._stdout) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_stdout))
		);
	}
	test_field__stdout();
	fn test_field__stderr() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._stderr) as usize - ptr as usize
		           },
		           12usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_stderr))
		);
	}
	test_field__stderr();
	fn test_field__inc() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._inc) as usize - ptr as usize
		           },
		           16usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_inc))
		);
	}
	test_field__inc();
	fn test_field__emergency() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._emergency) as usize - ptr as usize
		           },
		           20usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_emergency))
		);
	}
	test_field__emergency();
	fn test_field__unspecified_locale_info() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._unspecified_locale_info) as usize - ptr as usize
		           },
		           48usize,
		           concat!(
			"Offset of field: ",
			stringify!(_reent),
			"::",
			stringify!(_unspecified_locale_info)
		)
		);
	}
	test_field__unspecified_locale_info();
	fn test_field__locale() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._locale) as usize - ptr as usize
		           },
		           52usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_locale))
		);
	}
	test_field__locale();
	fn test_field___sdidinit() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__sdidinit) as usize - ptr as usize
		           },
		           56usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(__sdidinit))
		);
	}
	test_field___sdidinit();
	fn test_field___cleanup() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__cleanup) as usize - ptr as usize
		           },
		           60usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(__cleanup))
		);
	}
	test_field___cleanup();
	fn test_field__result() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._result) as usize - ptr as usize
		           },
		           64usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_result))
		);
	}
	test_field__result();
	fn test_field__result_k() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._result_k) as usize - ptr as usize
		           },
		           68usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_result_k))
		);
	}
	test_field__result_k();
	fn test_field__p5s() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._p5s) as usize - ptr as usize
		           },
		           72usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_p5s))
		);
	}
	test_field__p5s();
	fn test_field__freelist() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._freelist) as usize - ptr as usize
		           },
		           76usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_freelist))
		);
	}
	test_field__freelist();
	fn test_field__cvtlen() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._cvtlen) as usize - ptr as usize
		           },
		           80usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_cvtlen))
		);
	}
	test_field__cvtlen();
	fn test_field__cvtbuf() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._cvtbuf) as usize - ptr as usize
		           },
		           84usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_cvtbuf))
		);
	}
	test_field__cvtbuf();
	fn test_field__new() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._new) as usize - ptr as usize
		           },
		           88usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_new))
		);
	}
	test_field__new();
	fn test_field__atexit() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._atexit) as usize - ptr as usize
		           },
		           328usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_atexit))
		);
	}
	test_field__atexit();
	fn test_field__atexit0() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._atexit0) as usize - ptr as usize
		           },
		           332usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_atexit0))
		);
	}
	test_field__atexit0();
	fn test_field__sig_func() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr)._sig_func) as usize - ptr as usize
		           },
		           732usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(_sig_func))
		);
	}
	test_field__sig_func();
	fn test_field___sglue() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__sglue) as usize - ptr as usize
		           },
		           736usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(__sglue))
		);
	}
	test_field___sglue();
	fn test_field___sf() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<_reent>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__sf) as usize - ptr as usize
		           },
		           748usize,
		           concat!("Offset of field: ", stringify!(_reent), "::", stringify!(__sf))
		);
	}
	test_field___sf();
}
extern "C" {
	pub static mut _impure_ptr: *mut _reent;
}
extern "C" {
	pub static _global_impure_ptr: *mut _reent;
}
extern "C" {
	pub fn _reclaim_reent(arg1: *mut _reent);
}
pub type locale_t = *mut __locale_t;
extern "C" {
	pub fn bcmp(arg1: *const core::ffi::c_void, arg2: *const core::ffi::c_void, arg3: core::ffi::c_uint) -> core::ffi::c_int;
}
extern "C" {
	pub fn bcopy(arg1: *const core::ffi::c_void, arg2: *mut core::ffi::c_void, arg3: usize);
}
extern "C" {
	pub fn bzero(arg1: *mut core::ffi::c_void, arg2: core::ffi::c_uint);
}
extern "C" {
	pub fn explicit_bzero(arg1: *mut core::ffi::c_void, arg2: usize);
}
extern "C" {
	pub fn ffs(arg1: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn ffsl(arg1: core::ffi::c_long) -> core::ffi::c_int;
}
extern "C" {
	pub fn ffsll(arg1: core::ffi::c_longlong) -> core::ffi::c_int;
}
extern "C" {
	pub fn fls(arg1: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn flsl(arg1: core::ffi::c_long) -> core::ffi::c_int;
}
extern "C" {
	pub fn flsll(arg1: core::ffi::c_longlong) -> core::ffi::c_int;
}
extern "C" {
	pub fn index(arg1: *const core::ffi::c_char, arg2: core::ffi::c_int) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn rindex(arg1: *const core::ffi::c_char, arg2: core::ffi::c_int) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strcasecmp(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn strncasecmp(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: core::ffi::c_uint) -> core::ffi::c_int;
}
extern "C" {
	pub fn strcasecmp_l(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn strncasecmp_l(arg1: *const core::ffi::c_char,
	                     arg2: *const core::ffi::c_char,
	                     arg3: usize,
	                     arg4: locale_t)
	                     -> core::ffi::c_int;
}
extern "C" {
	pub fn memchr(arg1: *const core::ffi::c_void, arg2: core::ffi::c_int, arg3: core::ffi::c_uint) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn memcmp(arg1: *const core::ffi::c_void, arg2: *const core::ffi::c_void, arg3: core::ffi::c_uint) -> core::ffi::c_int;
}
extern "C" {
	pub fn memcpy(arg1: *mut core::ffi::c_void, arg2: *const core::ffi::c_void, arg3: core::ffi::c_uint) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn memmove(arg1: *mut core::ffi::c_void, arg2: *const core::ffi::c_void, arg3: core::ffi::c_uint) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn memset(arg1: *mut core::ffi::c_void, arg2: core::ffi::c_int, arg3: core::ffi::c_uint) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn strcat(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strchr(arg1: *const core::ffi::c_char, arg2: core::ffi::c_int) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strcmp(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn strcoll(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn strcpy(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strcspn(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char) -> core::ffi::c_uint;
}
extern "C" {
	pub fn strerror(arg1: core::ffi::c_int) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strlen(arg1: *const core::ffi::c_char) -> core::ffi::c_uint;
}
extern "C" {
	pub fn strncat(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: core::ffi::c_uint) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strncmp(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: core::ffi::c_uint) -> core::ffi::c_int;
}
extern "C" {
	pub fn strncpy(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: core::ffi::c_uint) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strpbrk(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strrchr(arg1: *const core::ffi::c_char, arg2: core::ffi::c_int) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strspn(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char) -> core::ffi::c_uint;
}
extern "C" {
	pub fn strstr(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strtok(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strxfrm(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: core::ffi::c_uint) -> core::ffi::c_uint;
}
extern "C" {
	pub fn strcoll_l(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn strerror_l(arg1: core::ffi::c_int, arg2: locale_t) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strxfrm_l(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: usize, arg4: locale_t) -> usize;
}
extern "C" {
	pub fn strtok_r(arg1: *mut core::ffi::c_char,
	                arg2: *const core::ffi::c_char,
	                arg3: *mut *mut core::ffi::c_char)
	                -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn timingsafe_bcmp(arg1: *const core::ffi::c_void, arg2: *const core::ffi::c_void, arg3: usize) -> core::ffi::c_int;
}
extern "C" {
	pub fn timingsafe_memcmp(arg1: *const core::ffi::c_void, arg2: *const core::ffi::c_void, arg3: usize) -> core::ffi::c_int;
}
extern "C" {
	pub fn memccpy(arg1: *mut core::ffi::c_void,
	               arg2: *const core::ffi::c_void,
	               arg3: core::ffi::c_int,
	               arg4: core::ffi::c_uint)
	               -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn stpcpy(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn stpncpy(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: core::ffi::c_uint) -> *mut core::ffi::c_char;
}
extern "C" {
	#[must_use]
	pub fn strdup(arg1: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _strdup_r(arg1: *mut _reent, arg2: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	#[must_use]
	pub fn strndup(arg1: *const core::ffi::c_char, arg2: core::ffi::c_uint) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _strndup_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: usize) -> *mut core::ffi::c_char;
}
extern "C" {
	#[link_name = "\u{1}__xpg_strerror_r"]
	pub fn strerror_r(arg1: core::ffi::c_int, arg2: *mut core::ffi::c_char, arg3: usize) -> core::ffi::c_int;
}
extern "C" {
	pub fn _strerror_r(arg1: *mut _reent,
	                   arg2: core::ffi::c_int,
	                   arg3: core::ffi::c_int,
	                   arg4: *mut core::ffi::c_int)
	                   -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strlcat(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: core::ffi::c_uint) -> core::ffi::c_uint;
}
extern "C" {
	pub fn strlcpy(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: core::ffi::c_uint) -> core::ffi::c_uint;
}
extern "C" {
	pub fn strnlen(arg1: *const core::ffi::c_char, arg2: usize) -> usize;
}
extern "C" {
	pub fn strsep(arg1: *mut *mut core::ffi::c_char, arg2: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strnstr(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: usize) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strlwr(arg1: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strupr(arg1: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn strsignal(__signo: core::ffi::c_int) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn isalnum(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn isalpha(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn iscntrl(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn isdigit(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn isgraph(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn islower(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn isprint(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn ispunct(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn isspace(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn isupper(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn isxdigit(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn tolower(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn toupper(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn isblank(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn isascii(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn toascii(__c: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn isalnum_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn isalpha_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn isblank_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn iscntrl_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn isdigit_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn isgraph_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn islower_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn isprint_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn ispunct_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn isspace_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn isupper_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn isxdigit_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn tolower_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn toupper_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn isascii_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn toascii_l(__c: core::ffi::c_int, __l: locale_t) -> core::ffi::c_int;
}
extern "C" {
	pub static mut _ctype_: [core::ffi::c_char; 0usize];
}
#[repr(C)]
pub struct div_t {
	pub quot: core::ffi::c_int,
	pub rem: core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
	assert_eq!(
	           ::core::mem::size_of::<div_t>(),
	           8usize,
	           concat!("Size of: ", stringify!(div_t))
	);
	assert_eq!(
	           ::core::mem::align_of::<div_t>(),
	           4usize,
	           concat!("Alignment of ", stringify!(div_t))
	);
	fn test_field_quot() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<div_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(div_t), "::", stringify!(quot))
		);
	}
	test_field_quot();
	fn test_field_rem() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<div_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(div_t), "::", stringify!(rem))
		);
	}
	test_field_rem();
}
#[repr(C)]
pub struct ldiv_t {
	pub quot: core::ffi::c_long,
	pub rem: core::ffi::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
	assert_eq!(
	           ::core::mem::size_of::<ldiv_t>(),
	           8usize,
	           concat!("Size of: ", stringify!(ldiv_t))
	);
	assert_eq!(
	           ::core::mem::align_of::<ldiv_t>(),
	           4usize,
	           concat!("Alignment of ", stringify!(ldiv_t))
	);
	fn test_field_quot() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<ldiv_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(ldiv_t), "::", stringify!(quot))
		);
	}
	test_field_quot();
	fn test_field_rem() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<ldiv_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(ldiv_t), "::", stringify!(rem))
		);
	}
	test_field_rem();
}
#[repr(C)]
pub struct lldiv_t {
	pub quot: core::ffi::c_longlong,
	pub rem: core::ffi::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
	assert_eq!(
	           ::core::mem::size_of::<lldiv_t>(),
	           16usize,
	           concat!("Size of: ", stringify!(lldiv_t))
	);
	assert_eq!(
	           ::core::mem::align_of::<lldiv_t>(),
	           8usize,
	           concat!("Alignment of ", stringify!(lldiv_t))
	);
	fn test_field_quot() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<lldiv_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(lldiv_t), "::", stringify!(quot))
		);
	}
	test_field_quot();
	fn test_field_rem() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<lldiv_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(lldiv_t), "::", stringify!(rem))
		);
	}
	test_field_rem();
}
pub type __compar_fn_t =
	::core::option::Option<unsafe extern "C" fn(arg1: *const core::ffi::c_void, arg2: *const core::ffi::c_void) -> core::ffi::c_int>;
extern "C" {
	pub fn __locale_mb_cur_max() -> core::ffi::c_int;
}
extern "C" {
	pub fn abort();
}
extern "C" {
	pub fn abs(arg1: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn arc4random() -> __uint32_t;
}
extern "C" {
	pub fn arc4random_uniform(arg1: __uint32_t) -> __uint32_t;
}
extern "C" {
	pub fn arc4random_buf(arg1: *mut core::ffi::c_void, arg2: usize);
}
extern "C" {
	pub fn atexit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> core::ffi::c_int;
}
extern "C" {
	pub fn atof(__nptr: *const core::ffi::c_char) -> core::ffi::c_double;
}
extern "C" {
	pub fn atoff(__nptr: *const core::ffi::c_char) -> core::ffi::c_float;
}
extern "C" {
	pub fn atoi(__nptr: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn _atoi_r(arg1: *mut _reent, __nptr: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn atol(__nptr: *const core::ffi::c_char) -> core::ffi::c_long;
}
extern "C" {
	pub fn _atol_r(arg1: *mut _reent, __nptr: *const core::ffi::c_char) -> core::ffi::c_long;
}
extern "C" {
	pub fn bsearch(__key: *const core::ffi::c_void,
	               __base: *const core::ffi::c_void,
	               __nmemb: usize,
	               __size: usize,
	               _compar: __compar_fn_t)
	               -> *mut core::ffi::c_void;
}
extern "C" {
	#[must_use]
	pub fn calloc(arg1: core::ffi::c_uint, arg2: core::ffi::c_uint) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn div(__numer: core::ffi::c_int, __denom: core::ffi::c_int) -> div_t;
}
extern "C" {
	pub fn exit(__status: core::ffi::c_int);
}
extern "C" {
	pub fn free(arg1: *mut core::ffi::c_void);
}
extern "C" {
	pub fn getenv(__string: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _getenv_r(arg1: *mut _reent, __string: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _findenv(arg1: *const core::ffi::c_char, arg2: *mut core::ffi::c_int) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _findenv_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: *mut core::ffi::c_int) -> *mut core::ffi::c_char;
}
extern "C" {
	pub static mut suboptarg: *mut core::ffi::c_char;
}
extern "C" {
	pub fn getsubopt(arg1: *mut *mut core::ffi::c_char,
	                 arg2: *const *mut core::ffi::c_char,
	                 arg3: *mut *mut core::ffi::c_char)
	                 -> core::ffi::c_int;
}
extern "C" {
	pub fn labs(arg1: core::ffi::c_long) -> core::ffi::c_long;
}
extern "C" {
	pub fn ldiv(__numer: core::ffi::c_long, __denom: core::ffi::c_long) -> ldiv_t;
}
extern "C" {
	#[must_use]
	pub fn malloc(arg1: core::ffi::c_uint) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn mblen(arg1: *const core::ffi::c_char, arg2: usize) -> core::ffi::c_int;
}
extern "C" {
	pub fn _mblen_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: usize, arg4: *mut _mbstate_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn mbtowc(arg1: *mut wchar_t, arg2: *const core::ffi::c_char, arg3: usize) -> core::ffi::c_int;
}
extern "C" {
	pub fn _mbtowc_r(arg1: *mut _reent,
	                 arg2: *mut wchar_t,
	                 arg3: *const core::ffi::c_char,
	                 arg4: usize,
	                 arg5: *mut _mbstate_t)
	                 -> core::ffi::c_int;
}
extern "C" {
	pub fn wctomb(arg1: *mut core::ffi::c_char, arg2: wchar_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn _wctomb_r(arg1: *mut _reent, arg2: *mut core::ffi::c_char, arg3: wchar_t, arg4: *mut _mbstate_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn mbstowcs(arg1: *mut wchar_t, arg2: *const core::ffi::c_char, arg3: usize) -> usize;
}
extern "C" {
	pub fn _mbstowcs_r(arg1: *mut _reent,
	                   arg2: *mut wchar_t,
	                   arg3: *const core::ffi::c_char,
	                   arg4: usize,
	                   arg5: *mut _mbstate_t)
	                   -> usize;
}
extern "C" {
	pub fn wcstombs(arg1: *mut core::ffi::c_char, arg2: *const wchar_t, arg3: usize) -> usize;
}
extern "C" {
	pub fn _wcstombs_r(arg1: *mut _reent,
	                   arg2: *mut core::ffi::c_char,
	                   arg3: *const wchar_t,
	                   arg4: usize,
	                   arg5: *mut _mbstate_t)
	                   -> usize;
}
extern "C" {
	pub fn mkdtemp(arg1: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn mkstemp(arg1: *mut core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn mkstemps(arg1: *mut core::ffi::c_char, arg2: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn mktemp(arg1: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _mkdtemp_r(arg1: *mut _reent, arg2: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _mkostemp_r(arg1: *mut _reent, arg2: *mut core::ffi::c_char, arg3: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn _mkostemps_r(arg1: *mut _reent,
	                    arg2: *mut core::ffi::c_char,
	                    arg3: core::ffi::c_int,
	                    arg4: core::ffi::c_int)
	                    -> core::ffi::c_int;
}
extern "C" {
	pub fn _mkstemp_r(arg1: *mut _reent, arg2: *mut core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn _mkstemps_r(arg1: *mut _reent, arg2: *mut core::ffi::c_char, arg3: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn _mktemp_r(arg1: *mut _reent, arg2: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn qsort(__base: *mut core::ffi::c_void, __nmemb: usize, __size: usize, _compar: __compar_fn_t);
}
extern "C" {
	pub fn rand() -> core::ffi::c_int;
}
extern "C" {
	#[must_use]
	pub fn realloc(arg1: *mut core::ffi::c_void, arg2: core::ffi::c_uint) -> *mut core::ffi::c_void;
}
extern "C" {
	#[must_use]
	pub fn reallocarray(arg1: *mut core::ffi::c_void, arg2: usize, arg3: usize) -> *mut core::ffi::c_void;
}
extern "C" {
	#[must_use]
	pub fn reallocf(arg1: *mut core::ffi::c_void, arg2: usize) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn realpath(path: *const core::ffi::c_char, resolved_path: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn rpmatch(response: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn srand(__seed: core::ffi::c_uint);
}
extern "C" {
	pub fn strtod(__n: *const core::ffi::c_char, __end_PTR: *mut *mut core::ffi::c_char) -> core::ffi::c_double;
}
extern "C" {
	pub fn _strtod_r(arg1: *mut _reent, __n: *const core::ffi::c_char, __end_PTR: *mut *mut core::ffi::c_char) -> core::ffi::c_double;
}
extern "C" {
	pub fn strtof(__n: *const core::ffi::c_char, __end_PTR: *mut *mut core::ffi::c_char) -> core::ffi::c_float;
}
extern "C" {
	pub fn strtol(__n: *const core::ffi::c_char,
	              __end_PTR: *mut *mut core::ffi::c_char,
	              __base: core::ffi::c_int)
	              -> core::ffi::c_long;
}
extern "C" {
	pub fn _strtol_r(arg1: *mut _reent,
	                 __n: *const core::ffi::c_char,
	                 __end_PTR: *mut *mut core::ffi::c_char,
	                 __base: core::ffi::c_int)
	                 -> core::ffi::c_long;
}
extern "C" {
	pub fn strtoul(__n: *const core::ffi::c_char,
	               __end_PTR: *mut *mut core::ffi::c_char,
	               __base: core::ffi::c_int)
	               -> core::ffi::c_ulong;
}
extern "C" {
	pub fn _strtoul_r(arg1: *mut _reent,
	                  __n: *const core::ffi::c_char,
	                  __end_PTR: *mut *mut core::ffi::c_char,
	                  __base: core::ffi::c_int)
	                  -> core::ffi::c_ulong;
}
extern "C" {
	pub fn system(__string: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn a64l(__input: *const core::ffi::c_char) -> core::ffi::c_long;
}
extern "C" {
	pub fn l64a(__input: core::ffi::c_long) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _l64a_r(arg1: *mut _reent, __input: core::ffi::c_long) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn on_exit(__func: ::core::option::Option<unsafe extern "C" fn(arg1: core::ffi::c_int, arg2: *mut core::ffi::c_void)>,
	               __arg: *mut core::ffi::c_void)
	               -> core::ffi::c_int;
}
extern "C" {
	pub fn _Exit(__status: core::ffi::c_int);
}
extern "C" {
	pub fn putenv(__string: *mut core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn _putenv_r(arg1: *mut _reent, __string: *mut core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn _reallocf_r(arg1: *mut _reent, arg2: *mut core::ffi::c_void, arg3: usize) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn setenv(__string: *const core::ffi::c_char,
	              __value: *const core::ffi::c_char,
	              __overwrite: core::ffi::c_int)
	              -> core::ffi::c_int;
}
extern "C" {
	pub fn _setenv_r(arg1: *mut _reent,
	                 __string: *const core::ffi::c_char,
	                 __value: *const core::ffi::c_char,
	                 __overwrite: core::ffi::c_int)
	                 -> core::ffi::c_int;
}
extern "C" {
	pub fn __itoa(arg1: core::ffi::c_int, arg2: *mut core::ffi::c_char, arg3: core::ffi::c_int) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn __utoa(arg1: core::ffi::c_uint, arg2: *mut core::ffi::c_char, arg3: core::ffi::c_int) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn itoa(arg1: core::ffi::c_int, arg2: *mut core::ffi::c_char, arg3: core::ffi::c_int) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn utoa(arg1: core::ffi::c_uint, arg2: *mut core::ffi::c_char, arg3: core::ffi::c_int) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn rand_r(__seed: *mut core::ffi::c_uint) -> core::ffi::c_int;
}
extern "C" {
	pub fn drand48() -> core::ffi::c_double;
}
extern "C" {
	pub fn _drand48_r(arg1: *mut _reent) -> core::ffi::c_double;
}
extern "C" {
	pub fn erand48(arg1: *mut [core::ffi::c_ushort; 3usize]) -> core::ffi::c_double;
}
extern "C" {
	pub fn _erand48_r(arg1: *mut _reent, arg2: *mut [core::ffi::c_ushort; 3usize]) -> core::ffi::c_double;
}
extern "C" {
	pub fn jrand48(arg1: *mut [core::ffi::c_ushort; 3usize]) -> core::ffi::c_long;
}
extern "C" {
	pub fn _jrand48_r(arg1: *mut _reent, arg2: *mut [core::ffi::c_ushort; 3usize]) -> core::ffi::c_long;
}
extern "C" {
	pub fn lcong48(arg1: *mut [core::ffi::c_ushort; 7usize]);
}
extern "C" {
	pub fn _lcong48_r(arg1: *mut _reent, arg2: *mut [core::ffi::c_ushort; 7usize]);
}
extern "C" {
	pub fn lrand48() -> core::ffi::c_long;
}
extern "C" {
	pub fn _lrand48_r(arg1: *mut _reent) -> core::ffi::c_long;
}
extern "C" {
	pub fn mrand48() -> core::ffi::c_long;
}
extern "C" {
	pub fn _mrand48_r(arg1: *mut _reent) -> core::ffi::c_long;
}
extern "C" {
	pub fn nrand48(arg1: *mut [core::ffi::c_ushort; 3usize]) -> core::ffi::c_long;
}
extern "C" {
	pub fn _nrand48_r(arg1: *mut _reent, arg2: *mut [core::ffi::c_ushort; 3usize]) -> core::ffi::c_long;
}
extern "C" {
	pub fn seed48(arg1: *mut [core::ffi::c_ushort; 3usize]) -> *mut core::ffi::c_ushort;
}
extern "C" {
	pub fn _seed48_r(arg1: *mut _reent, arg2: *mut [core::ffi::c_ushort; 3usize]) -> *mut core::ffi::c_ushort;
}
extern "C" {
	pub fn srand48(arg1: core::ffi::c_long);
}
extern "C" {
	pub fn _srand48_r(arg1: *mut _reent, arg2: core::ffi::c_long);
}
extern "C" {
	pub fn initstate(arg1: core::ffi::c_uint, arg2: *mut core::ffi::c_char, arg3: usize) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn random() -> core::ffi::c_long;
}
extern "C" {
	pub fn setstate(arg1: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn srandom(arg1: core::ffi::c_uint);
}
extern "C" {
	pub fn atoll(__nptr: *const core::ffi::c_char) -> core::ffi::c_longlong;
}
extern "C" {
	pub fn _atoll_r(arg1: *mut _reent, __nptr: *const core::ffi::c_char) -> core::ffi::c_longlong;
}
extern "C" {
	pub fn llabs(arg1: core::ffi::c_longlong) -> core::ffi::c_longlong;
}
extern "C" {
	pub fn lldiv(__numer: core::ffi::c_longlong, __denom: core::ffi::c_longlong) -> lldiv_t;
}
extern "C" {
	pub fn strtoll(__n: *const core::ffi::c_char,
	               __end_PTR: *mut *mut core::ffi::c_char,
	               __base: core::ffi::c_int)
	               -> core::ffi::c_longlong;
}
extern "C" {
	pub fn _strtoll_r(arg1: *mut _reent,
	                  __n: *const core::ffi::c_char,
	                  __end_PTR: *mut *mut core::ffi::c_char,
	                  __base: core::ffi::c_int)
	                  -> core::ffi::c_longlong;
}
extern "C" {
	pub fn strtoull(__n: *const core::ffi::c_char,
	                __end_PTR: *mut *mut core::ffi::c_char,
	                __base: core::ffi::c_int)
	                -> core::ffi::c_ulonglong;
}
extern "C" {
	pub fn _strtoull_r(arg1: *mut _reent,
	                   __n: *const core::ffi::c_char,
	                   __end_PTR: *mut *mut core::ffi::c_char,
	                   __base: core::ffi::c_int)
	                   -> core::ffi::c_ulonglong;
}
extern "C" {
	pub fn cfree(arg1: *mut core::ffi::c_void);
}
extern "C" {
	pub fn unsetenv(__string: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn _unsetenv_r(arg1: *mut _reent, __string: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	#[must_use]
	pub fn posix_memalign(arg1: *mut *mut core::ffi::c_void, arg2: usize, arg3: usize) -> core::ffi::c_int;
}
extern "C" {
	pub fn _dtoa_r(arg1: *mut _reent,
	               arg2: core::ffi::c_double,
	               arg3: core::ffi::c_int,
	               arg4: core::ffi::c_int,
	               arg5: *mut core::ffi::c_int,
	               arg6: *mut core::ffi::c_int,
	               arg7: *mut *mut core::ffi::c_char)
	               -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _malloc_r(arg1: *mut _reent, arg2: usize) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn _calloc_r(arg1: *mut _reent, arg2: usize, arg3: usize) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn _free_r(arg1: *mut _reent, arg2: *mut core::ffi::c_void);
}
extern "C" {
	pub fn _realloc_r(arg1: *mut _reent, arg2: *mut core::ffi::c_void, arg3: usize) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn _mstats_r(arg1: *mut _reent, arg2: *mut core::ffi::c_char);
}
extern "C" {
	pub fn _system_r(arg1: *mut _reent, arg2: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn __eprintf(arg1: *const core::ffi::c_char,
	                 arg2: *const core::ffi::c_char,
	                 arg3: core::ffi::c_uint,
	                 arg4: *const core::ffi::c_char);
}
extern "C" {
	#[link_name = "\u{1}__bsd_qsort_r"]
	pub fn qsort_r(__base: *mut core::ffi::c_void,
	               __nmemb: usize,
	               __size: usize,
	               __thunk: *mut core::ffi::c_void,
	               _compar: ::core::option::Option<unsafe extern "C" fn(arg1: *mut core::ffi::c_void,
	                                                           arg2: *const core::ffi::c_void,
	                                                           arg3: *const core::ffi::c_void)
	                                                           -> core::ffi::c_int>);
}
extern "C" {
	pub fn _strtold_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: *mut *mut core::ffi::c_char) -> f64;
}
extern "C" {
	pub fn strtold(arg1: *const core::ffi::c_char, arg2: *mut *mut core::ffi::c_char) -> f64;
}
extern "C" {
	#[must_use]
	pub fn aligned_alloc(arg1: core::ffi::c_uint, arg2: core::ffi::c_uint) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn at_quick_exit(arg1: ::core::option::Option<unsafe extern "C" fn()>) -> core::ffi::c_int;
}
extern "C" {
	pub fn quick_exit(arg1: core::ffi::c_int);
}
extern "C" {
	pub fn __assert(arg1: *const core::ffi::c_char, arg2: core::ffi::c_int, arg3: *const core::ffi::c_char);
}
extern "C" {
	pub fn __assert_func(arg1: *const core::ffi::c_char,
	                     arg2: core::ffi::c_int,
	                     arg3: *const core::ffi::c_char,
	                     arg4: *const core::ffi::c_char);
}
pub type va_list = u32;
pub type __gnuc_va_list = u32;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = __intptr_t;
pub type __sigset_t = core::ffi::c_ulong;
pub type suseconds_t = __suseconds_t;
pub type time_t = __int_least64_t;
#[repr(C)]
pub struct timeval {
	pub tv_sec: time_t,
	pub tv_usec: suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
	assert_eq!(
	           ::core::mem::size_of::<timeval>(),
	           16usize,
	           concat!("Size of: ", stringify!(timeval))
	);
	assert_eq!(
	           ::core::mem::align_of::<timeval>(),
	           8usize,
	           concat!("Alignment of ", stringify!(timeval))
	);
	fn test_field_tv_sec() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<timeval>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(timeval), "::", stringify!(tv_sec))
		);
	}
	test_field_tv_sec();
	fn test_field_tv_usec() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<timeval>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(timeval), "::", stringify!(tv_usec))
		);
	}
	test_field_tv_usec();
}
#[repr(C)]
pub struct timespec {
	pub tv_sec: time_t,
	pub tv_nsec: core::ffi::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
	assert_eq!(
	           ::core::mem::size_of::<timespec>(),
	           16usize,
	           concat!("Size of: ", stringify!(timespec))
	);
	assert_eq!(
	           ::core::mem::align_of::<timespec>(),
	           8usize,
	           concat!("Alignment of ", stringify!(timespec))
	);
	fn test_field_tv_sec() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<timespec>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(timespec), "::", stringify!(tv_sec))
		);
	}
	test_field_tv_sec();
	fn test_field_tv_nsec() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<timespec>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(timespec), "::", stringify!(tv_nsec))
		);
	}
	test_field_tv_nsec();
}
#[repr(C)]
pub struct itimerspec {
	pub it_interval: timespec,
	pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
	assert_eq!(
	           ::core::mem::size_of::<itimerspec>(),
	           32usize,
	           concat!("Size of: ", stringify!(itimerspec))
	);
	assert_eq!(
	           ::core::mem::align_of::<itimerspec>(),
	           8usize,
	           concat!("Alignment of ", stringify!(itimerspec))
	);
	fn test_field_it_interval() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<itimerspec>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(itimerspec), "::", stringify!(it_interval))
		);
	}
	test_field_it_interval();
	fn test_field_it_value() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<itimerspec>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize
		           },
		           16usize,
		           concat!("Offset of field: ", stringify!(itimerspec), "::", stringify!(it_value))
		);
	}
	test_field_it_value();
}
pub type sigset_t = __sigset_t;
pub type __fd_mask = core::ffi::c_ulong;
pub type fd_mask = __fd_mask;
#[repr(C)]
pub struct fd_set {
	pub __fds_bits: [__fd_mask; 2usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
	assert_eq!(
	           ::core::mem::size_of::<fd_set>(),
	           8usize,
	           concat!("Size of: ", stringify!(fd_set))
	);
	assert_eq!(
	           ::core::mem::align_of::<fd_set>(),
	           4usize,
	           concat!("Alignment of ", stringify!(fd_set))
	);
	fn test_field___fds_bits() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<fd_set>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(fd_set), "::", stringify!(__fds_bits))
		);
	}
	test_field___fds_bits();
}
extern "C" {
	pub fn select(__n: core::ffi::c_int,
	              __readfds: *mut fd_set,
	              __writefds: *mut fd_set,
	              __exceptfds: *mut fd_set,
	              __timeout: *mut timeval)
	              -> core::ffi::c_int;
}
extern "C" {
	pub fn pselect(__n: core::ffi::c_int,
	               __readfds: *mut fd_set,
	               __writefds: *mut fd_set,
	               __exceptfds: *mut fd_set,
	               __timeout: *const timespec,
	               __set: *const sigset_t)
	               -> core::ffi::c_int;
}
pub type in_addr_t = __uint32_t;
pub type in_port_t = __uint16_t;
pub type u_register_t = __uintptr_t;
pub type u_char = core::ffi::c_uchar;
pub type u_short = core::ffi::c_ushort;
pub type u_int = core::ffi::c_uint;
pub type u_long = core::ffi::c_ulong;
pub type ushort = core::ffi::c_ushort;
pub type uint = core::ffi::c_uint;
pub type ulong = core::ffi::c_ulong;
pub type blkcnt_t = __blkcnt_t;
pub type blksize_t = __blksize_t;
pub type clock_t = core::ffi::c_ulong;
pub type daddr_t = core::ffi::c_long;
pub type caddr_t = *mut core::ffi::c_char;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type id_t = __id_t;
pub type ino_t = __ino_t;
pub type off_t = __off_t;
pub type dev_t = __dev_t;
pub type uid_t = __uid_t;
pub type gid_t = __gid_t;
pub type pid_t = __pid_t;
pub type key_t = __key_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type useconds_t = __useconds_t;
pub type sbintime_t = __int64_t;
#[repr(C)]
pub struct sched_param {
	pub sched_priority: core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_sched_param() {
	assert_eq!(
	           ::core::mem::size_of::<sched_param>(),
	           4usize,
	           concat!("Size of: ", stringify!(sched_param))
	);
	assert_eq!(
	           ::core::mem::align_of::<sched_param>(),
	           4usize,
	           concat!("Alignment of ", stringify!(sched_param))
	);
	fn test_field_sched_priority() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<sched_param>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).sched_priority) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(sched_param), "::", stringify!(sched_priority))
		);
	}
	test_field_sched_priority();
}
pub type pthread_t = __uint32_t;
#[repr(C)]
pub struct pthread_attr_t {
	pub is_initialized: core::ffi::c_int,
	pub stackaddr: *mut core::ffi::c_void,
	pub stacksize: core::ffi::c_int,
	pub contentionscope: core::ffi::c_int,
	pub inheritsched: core::ffi::c_int,
	pub schedpolicy: core::ffi::c_int,
	pub schedparam: sched_param,
	pub detachstate: core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
	assert_eq!(
	           ::core::mem::size_of::<pthread_attr_t>(),
	           32usize,
	           concat!("Size of: ", stringify!(pthread_attr_t))
	);
	assert_eq!(
	           ::core::mem::align_of::<pthread_attr_t>(),
	           4usize,
	           concat!("Alignment of ", stringify!(pthread_attr_t))
	);
	fn test_field_is_initialized() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_attr_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(pthread_attr_t),
			"::",
			stringify!(is_initialized)
		)
		);
	}
	test_field_is_initialized();
	fn test_field_stackaddr() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_attr_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).stackaddr) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(pthread_attr_t), "::", stringify!(stackaddr))
		);
	}
	test_field_stackaddr();
	fn test_field_stacksize() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_attr_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).stacksize) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(pthread_attr_t), "::", stringify!(stacksize))
		);
	}
	test_field_stacksize();
	fn test_field_contentionscope() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_attr_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).contentionscope) as usize - ptr as usize
		           },
		           12usize,
		           concat!(
			"Offset of field: ",
			stringify!(pthread_attr_t),
			"::",
			stringify!(contentionscope)
		)
		);
	}
	test_field_contentionscope();
	fn test_field_inheritsched() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_attr_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).inheritsched) as usize - ptr as usize
		           },
		           16usize,
		           concat!(
			"Offset of field: ",
			stringify!(pthread_attr_t),
			"::",
			stringify!(inheritsched)
		)
		);
	}
	test_field_inheritsched();
	fn test_field_schedpolicy() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_attr_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).schedpolicy) as usize - ptr as usize
		           },
		           20usize,
		           concat!("Offset of field: ", stringify!(pthread_attr_t), "::", stringify!(schedpolicy))
		);
	}
	test_field_schedpolicy();
	fn test_field_schedparam() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_attr_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).schedparam) as usize - ptr as usize
		           },
		           24usize,
		           concat!("Offset of field: ", stringify!(pthread_attr_t), "::", stringify!(schedparam))
		);
	}
	test_field_schedparam();
	fn test_field_detachstate() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_attr_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).detachstate) as usize - ptr as usize
		           },
		           28usize,
		           concat!("Offset of field: ", stringify!(pthread_attr_t), "::", stringify!(detachstate))
		);
	}
	test_field_detachstate();
}
pub type pthread_mutex_t = __uint32_t;
#[repr(C)]
pub struct pthread_mutexattr_t {
	pub is_initialized: core::ffi::c_int,
	pub recursive: core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
	assert_eq!(
	           ::core::mem::size_of::<pthread_mutexattr_t>(),
	           8usize,
	           concat!("Size of: ", stringify!(pthread_mutexattr_t))
	);
	assert_eq!(
	           ::core::mem::align_of::<pthread_mutexattr_t>(),
	           4usize,
	           concat!("Alignment of ", stringify!(pthread_mutexattr_t))
	);
	fn test_field_is_initialized() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_mutexattr_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(pthread_mutexattr_t),
			"::",
			stringify!(is_initialized)
		)
		);
	}
	test_field_is_initialized();
	fn test_field_recursive() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_mutexattr_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).recursive) as usize - ptr as usize
		           },
		           4usize,
		           concat!(
			"Offset of field: ",
			stringify!(pthread_mutexattr_t),
			"::",
			stringify!(recursive)
		)
		);
	}
	test_field_recursive();
}
pub type pthread_cond_t = __uint32_t;
#[repr(C)]
pub struct pthread_condattr_t {
	pub is_initialized: core::ffi::c_int,
	pub clock: clock_t,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
	assert_eq!(
	           ::core::mem::size_of::<pthread_condattr_t>(),
	           8usize,
	           concat!("Size of: ", stringify!(pthread_condattr_t))
	);
	assert_eq!(
	           ::core::mem::align_of::<pthread_condattr_t>(),
	           4usize,
	           concat!("Alignment of ", stringify!(pthread_condattr_t))
	);
	fn test_field_is_initialized() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_condattr_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(pthread_condattr_t),
			"::",
			stringify!(is_initialized)
		)
		);
	}
	test_field_is_initialized();
	fn test_field_clock() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_condattr_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).clock) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(pthread_condattr_t), "::", stringify!(clock))
		);
	}
	test_field_clock();
}
pub type pthread_key_t = __uint32_t;
#[repr(C)]
pub struct pthread_once_t {
	pub is_initialized: core::ffi::c_int,
	pub init_executed: core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_pthread_once_t() {
	assert_eq!(
	           ::core::mem::size_of::<pthread_once_t>(),
	           8usize,
	           concat!("Size of: ", stringify!(pthread_once_t))
	);
	assert_eq!(
	           ::core::mem::align_of::<pthread_once_t>(),
	           4usize,
	           concat!("Alignment of ", stringify!(pthread_once_t))
	);
	fn test_field_is_initialized() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_once_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(pthread_once_t),
			"::",
			stringify!(is_initialized)
		)
		);
	}
	test_field_is_initialized();
	fn test_field_init_executed() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<pthread_once_t>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).init_executed) as usize - ptr as usize
		           },
		           4usize,
		           concat!(
			"Offset of field: ",
			stringify!(pthread_once_t),
			"::",
			stringify!(init_executed)
		)
		);
	}
	test_field_init_executed();
}
pub type FILE = __FILE;
pub type fpos_t = _fpos_t;
extern "C" {
	pub fn ctermid(arg1: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn tmpfile() -> *mut FILE;
}
extern "C" {
	pub fn tmpnam(arg1: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	#[must_use]
	pub fn tempnam(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn fclose(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn fflush(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn freopen(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: *mut FILE) -> *mut FILE;
}
extern "C" {
	pub fn setbuf(arg1: *mut FILE, arg2: *mut core::ffi::c_char);
}
extern "C" {
	pub fn setvbuf(arg1: *mut FILE, arg2: *mut core::ffi::c_char, arg3: core::ffi::c_int, arg4: usize) -> core::ffi::c_int;
}
extern "C" {
	pub fn fprintf(arg1: *mut FILE, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn fscanf(arg1: *mut FILE, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn printf(arg1: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn scanf(arg1: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn sscanf(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn vfprintf(arg1: *mut FILE, arg2: *const core::ffi::c_char, arg3: u32) -> core::ffi::c_int;
}
extern "C" {
	pub fn vprintf(arg1: *const core::ffi::c_char, arg2: u32) -> core::ffi::c_int;
}
extern "C" {
	pub fn vsprintf(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: u32) -> core::ffi::c_int;
}
extern "C" {
	pub fn fgetc(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn fgets(arg1: *mut core::ffi::c_char, arg2: core::ffi::c_int, arg3: *mut FILE) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn fputc(arg1: core::ffi::c_int, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn fputs(arg1: *const core::ffi::c_char, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn getc(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn getchar() -> core::ffi::c_int;
}
extern "C" {
	pub fn gets(arg1: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn putc(arg1: core::ffi::c_int, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn putchar(arg1: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn puts(arg1: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn ungetc(arg1: core::ffi::c_int, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn fread(arg1: *mut core::ffi::c_void, _size: core::ffi::c_uint, _n: core::ffi::c_uint, arg2: *mut FILE) -> core::ffi::c_uint;
}
extern "C" {
	pub fn fwrite(arg1: *const core::ffi::c_void,
	              _size: core::ffi::c_uint,
	              _n: core::ffi::c_uint,
	              arg2: *mut FILE)
	              -> core::ffi::c_uint;
}
extern "C" {
	pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn fseek(arg1: *mut FILE, arg2: core::ffi::c_long, arg3: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn ftell(arg1: *mut FILE) -> core::ffi::c_long;
}
extern "C" {
	pub fn rewind(arg1: *mut FILE);
}
extern "C" {
	pub fn clearerr(arg1: *mut FILE);
}
extern "C" {
	pub fn feof(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn ferror(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn perror(arg1: *const core::ffi::c_char);
}
extern "C" {
	pub fn fopen(_name: *const core::ffi::c_char, _type: *const core::ffi::c_char) -> *mut FILE;
}
extern "C" {
	pub fn sprintf(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn remove(arg1: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn rename(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn fseeko(arg1: *mut FILE, arg2: off_t, arg3: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn ftello(arg1: *mut FILE) -> off_t;
}
extern "C" {
	pub fn snprintf(arg1: *mut core::ffi::c_char, arg2: core::ffi::c_uint, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn vsnprintf(arg1: *mut core::ffi::c_char,
	                 arg2: core::ffi::c_uint,
	                 arg3: *const core::ffi::c_char,
	                 arg4: u32)
	                 -> core::ffi::c_int;
}
extern "C" {
	pub fn vfscanf(arg1: *mut FILE, arg2: *const core::ffi::c_char, arg3: u32) -> core::ffi::c_int;
}
extern "C" {
	pub fn vscanf(arg1: *const core::ffi::c_char, arg2: u32) -> core::ffi::c_int;
}
extern "C" {
	pub fn vsscanf(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: u32) -> core::ffi::c_int;
}
extern "C" {
	pub fn asiprintf(arg1: *mut *mut core::ffi::c_char, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn asniprintf(arg1: *mut core::ffi::c_char, arg2: *mut usize, arg3: *const core::ffi::c_char, ...) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn asnprintf(arg1: *mut core::ffi::c_char, arg2: *mut usize, arg3: *const core::ffi::c_char, ...) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn diprintf(arg1: core::ffi::c_int, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn fiprintf(arg1: *mut FILE, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn fiscanf(arg1: *mut FILE, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn iprintf(arg1: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn iscanf(arg1: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn siprintf(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn siscanf(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn sniprintf(arg1: *mut core::ffi::c_char, arg2: usize, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn vasiprintf(arg1: *mut *mut core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn vasniprintf(arg1: *mut core::ffi::c_char,
	                   arg2: *mut usize,
	                   arg3: *const core::ffi::c_char,
	                   arg4: __gnuc_va_list)
	                   -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn vasnprintf(arg1: *mut core::ffi::c_char,
	                  arg2: *mut usize,
	                  arg3: *const core::ffi::c_char,
	                  arg4: __gnuc_va_list)
	                  -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn vdiprintf(arg1: core::ffi::c_int, arg2: *const core::ffi::c_char, arg3: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn vfiprintf(arg1: *mut FILE, arg2: *const core::ffi::c_char, arg3: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn vfiscanf(arg1: *mut FILE, arg2: *const core::ffi::c_char, arg3: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn viprintf(arg1: *const core::ffi::c_char, arg2: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn viscanf(arg1: *const core::ffi::c_char, arg2: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn vsiprintf(arg1: *mut core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn vsiscanf(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char, arg3: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn vsniprintf(arg1: *mut core::ffi::c_char,
	                  arg2: usize,
	                  arg3: *const core::ffi::c_char,
	                  arg4: __gnuc_va_list)
	                  -> core::ffi::c_int;
}
extern "C" {
	pub fn fdopen(arg1: core::ffi::c_int, arg2: *const core::ffi::c_char) -> *mut FILE;
}
extern "C" {
	pub fn fileno(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn pclose(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn popen(arg1: *const core::ffi::c_char, arg2: *const core::ffi::c_char) -> *mut FILE;
}
extern "C" {
	pub fn setbuffer(arg1: *mut FILE, arg2: *mut core::ffi::c_char, arg3: core::ffi::c_int);
}
extern "C" {
	pub fn setlinebuf(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn getw(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn putw(arg1: core::ffi::c_int, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn getc_unlocked(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn getchar_unlocked() -> core::ffi::c_int;
}
extern "C" {
	pub fn flockfile(arg1: *mut FILE);
}
extern "C" {
	pub fn ftrylockfile(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn funlockfile(arg1: *mut FILE);
}
extern "C" {
	pub fn putc_unlocked(arg1: core::ffi::c_int, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn putchar_unlocked(arg1: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn dprintf(arg1: core::ffi::c_int, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn fmemopen(arg1: *mut core::ffi::c_void, arg2: usize, arg3: *const core::ffi::c_char) -> *mut FILE;
}
extern "C" {
	pub fn open_memstream(arg1: *mut *mut core::ffi::c_char, arg2: *mut usize) -> *mut FILE;
}
extern "C" {
	pub fn vdprintf(arg1: core::ffi::c_int, arg2: *const core::ffi::c_char, arg3: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn renameat(arg1: core::ffi::c_int,
	                arg2: *const core::ffi::c_char,
	                arg3: core::ffi::c_int,
	                arg4: *const core::ffi::c_char)
	                -> core::ffi::c_int;
}
extern "C" {
	pub fn _asiprintf_r(arg1: *mut _reent, arg2: *mut *mut core::ffi::c_char, arg3: *const core::ffi::c_char, ...)
	                    -> core::ffi::c_int;
}
extern "C" {
	pub fn _asniprintf_r(arg1: *mut _reent,
	                     arg2: *mut core::ffi::c_char,
	                     arg3: *mut usize,
	                     arg4: *const core::ffi::c_char,
	                     ...)
	                     -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _asnprintf_r(arg1: *mut _reent,
	                    arg2: *mut core::ffi::c_char,
	                    arg3: *mut usize,
	                    arg4: *const core::ffi::c_char,
	                    ...)
	                    -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _asprintf_r(arg1: *mut _reent, arg2: *mut *mut core::ffi::c_char, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _diprintf_r(arg1: *mut _reent, arg2: core::ffi::c_int, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _dprintf_r(arg1: *mut _reent, arg2: core::ffi::c_int, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fclose_r(arg1: *mut _reent, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fcloseall_r(arg1: *mut _reent) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fdopen_r(arg1: *mut _reent, arg2: core::ffi::c_int, arg3: *const core::ffi::c_char) -> *mut FILE;
}
extern "C" {
	pub fn _fflush_r(arg1: *mut _reent, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fgetc_r(arg1: *mut _reent, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fgetc_unlocked_r(arg1: *mut _reent, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fgets_r(arg1: *mut _reent,
	                arg2: *mut core::ffi::c_char,
	                arg3: core::ffi::c_int,
	                arg4: *mut FILE)
	                -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _fgets_unlocked_r(arg1: *mut _reent,
	                         arg2: *mut core::ffi::c_char,
	                         arg3: core::ffi::c_int,
	                         arg4: *mut FILE)
	                         -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _fgetpos_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *mut fpos_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fsetpos_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *const fpos_t) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fiprintf_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fiscanf_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fmemopen_r(arg1: *mut _reent, arg2: *mut core::ffi::c_void, arg3: usize, arg4: *const core::ffi::c_char) -> *mut FILE;
}
extern "C" {
	pub fn _fopen_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: *const core::ffi::c_char) -> *mut FILE;
}
extern "C" {
	pub fn _freopen_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: *const core::ffi::c_char, arg4: *mut FILE)
	                  -> *mut FILE;
}
extern "C" {
	pub fn _fprintf_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fpurge_r(arg1: *mut _reent, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fputc_r(arg1: *mut _reent, arg2: core::ffi::c_int, arg3: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fputc_unlocked_r(arg1: *mut _reent, arg2: core::ffi::c_int, arg3: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fputs_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fputs_unlocked_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fread_r(arg1: *mut _reent, arg2: *mut core::ffi::c_void, _size: usize, _n: usize, arg3: *mut FILE) -> usize;
}
extern "C" {
	pub fn _fread_unlocked_r(arg1: *mut _reent, arg2: *mut core::ffi::c_void, _size: usize, _n: usize, arg3: *mut FILE) -> usize;
}
extern "C" {
	pub fn _fscanf_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fseek_r(arg1: *mut _reent, arg2: *mut FILE, arg3: core::ffi::c_long, arg4: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn _fseeko_r(arg1: *mut _reent, arg2: *mut FILE, arg3: _off_t, arg4: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn _ftell_r(arg1: *mut _reent, arg2: *mut FILE) -> core::ffi::c_long;
}
extern "C" {
	pub fn _ftello_r(arg1: *mut _reent, arg2: *mut FILE) -> _off_t;
}
extern "C" {
	pub fn _rewind_r(arg1: *mut _reent, arg2: *mut FILE);
}
extern "C" {
	pub fn _fwrite_r(arg1: *mut _reent, arg2: *const core::ffi::c_void, _size: usize, _n: usize, arg3: *mut FILE) -> usize;
}
extern "C" {
	pub fn _fwrite_unlocked_r(arg1: *mut _reent, arg2: *const core::ffi::c_void, _size: usize, _n: usize, arg3: *mut FILE) -> usize;
}
extern "C" {
	pub fn _getc_r(arg1: *mut _reent, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _getc_unlocked_r(arg1: *mut _reent, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _getchar_r(arg1: *mut _reent) -> core::ffi::c_int;
}
extern "C" {
	pub fn _getchar_unlocked_r(arg1: *mut _reent) -> core::ffi::c_int;
}
extern "C" {
	pub fn _gets_r(arg1: *mut _reent, arg2: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _iprintf_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _iscanf_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _open_memstream_r(arg1: *mut _reent, arg2: *mut *mut core::ffi::c_char, arg3: *mut usize) -> *mut FILE;
}
extern "C" {
	pub fn _perror_r(arg1: *mut _reent, arg2: *const core::ffi::c_char);
}
extern "C" {
	pub fn _printf_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _putc_r(arg1: *mut _reent, arg2: core::ffi::c_int, arg3: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _putc_unlocked_r(arg1: *mut _reent, arg2: core::ffi::c_int, arg3: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _putchar_unlocked_r(arg1: *mut _reent, arg2: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn _putchar_r(arg1: *mut _reent, arg2: core::ffi::c_int) -> core::ffi::c_int;
}
extern "C" {
	pub fn _puts_r(arg1: *mut _reent, arg2: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn _remove_r(arg1: *mut _reent, arg2: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn _rename_r(arg1: *mut _reent, _old: *const core::ffi::c_char, _new: *const core::ffi::c_char) -> core::ffi::c_int;
}
extern "C" {
	pub fn _scanf_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _siprintf_r(arg1: *mut _reent, arg2: *mut core::ffi::c_char, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _siscanf_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _sniprintf_r(arg1: *mut _reent,
	                    arg2: *mut core::ffi::c_char,
	                    arg3: usize,
	                    arg4: *const core::ffi::c_char,
	                    ...)
	                    -> core::ffi::c_int;
}
extern "C" {
	pub fn _snprintf_r(arg1: *mut _reent,
	                   arg2: *mut core::ffi::c_char,
	                   arg3: usize,
	                   arg4: *const core::ffi::c_char,
	                   ...)
	                   -> core::ffi::c_int;
}
extern "C" {
	pub fn _sprintf_r(arg1: *mut _reent, arg2: *mut core::ffi::c_char, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _sscanf_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: *const core::ffi::c_char, ...) -> core::ffi::c_int;
}
extern "C" {
	pub fn _tempnam_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _tmpfile_r(arg1: *mut _reent) -> *mut FILE;
}
extern "C" {
	pub fn _tmpnam_r(arg1: *mut _reent, arg2: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _ungetc_r(arg1: *mut _reent, arg2: core::ffi::c_int, arg3: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn _vasiprintf_r(arg1: *mut _reent,
	                     arg2: *mut *mut core::ffi::c_char,
	                     arg3: *const core::ffi::c_char,
	                     arg4: __gnuc_va_list)
	                     -> core::ffi::c_int;
}
extern "C" {
	pub fn _vasniprintf_r(arg1: *mut _reent,
	                      arg2: *mut core::ffi::c_char,
	                      arg3: *mut usize,
	                      arg4: *const core::ffi::c_char,
	                      arg5: __gnuc_va_list)
	                      -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _vasnprintf_r(arg1: *mut _reent,
	                     arg2: *mut core::ffi::c_char,
	                     arg3: *mut usize,
	                     arg4: *const core::ffi::c_char,
	                     arg5: __gnuc_va_list)
	                     -> *mut core::ffi::c_char;
}
extern "C" {
	pub fn _vasprintf_r(arg1: *mut _reent,
	                    arg2: *mut *mut core::ffi::c_char,
	                    arg3: *const core::ffi::c_char,
	                    arg4: __gnuc_va_list)
	                    -> core::ffi::c_int;
}
extern "C" {
	pub fn _vdiprintf_r(arg1: *mut _reent,
	                    arg2: core::ffi::c_int,
	                    arg3: *const core::ffi::c_char,
	                    arg4: __gnuc_va_list)
	                    -> core::ffi::c_int;
}
extern "C" {
	pub fn _vdprintf_r(arg1: *mut _reent,
	                   arg2: core::ffi::c_int,
	                   arg3: *const core::ffi::c_char,
	                   arg4: __gnuc_va_list)
	                   -> core::ffi::c_int;
}
extern "C" {
	pub fn _vfiprintf_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *const core::ffi::c_char, arg4: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn _vfiscanf_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *const core::ffi::c_char, arg4: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn _vfprintf_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *const core::ffi::c_char, arg4: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn _vfscanf_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *const core::ffi::c_char, arg4: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn _viprintf_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn _viscanf_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn _vprintf_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn _vscanf_r(arg1: *mut _reent, arg2: *const core::ffi::c_char, arg3: __gnuc_va_list) -> core::ffi::c_int;
}
extern "C" {
	pub fn _vsiprintf_r(arg1: *mut _reent,
	                    arg2: *mut core::ffi::c_char,
	                    arg3: *const core::ffi::c_char,
	                    arg4: __gnuc_va_list)
	                    -> core::ffi::c_int;
}
extern "C" {
	pub fn _vsiscanf_r(arg1: *mut _reent,
	                   arg2: *const core::ffi::c_char,
	                   arg3: *const core::ffi::c_char,
	                   arg4: __gnuc_va_list)
	                   -> core::ffi::c_int;
}
extern "C" {
	pub fn _vsniprintf_r(arg1: *mut _reent,
	                     arg2: *mut core::ffi::c_char,
	                     arg3: usize,
	                     arg4: *const core::ffi::c_char,
	                     arg5: __gnuc_va_list)
	                     -> core::ffi::c_int;
}
extern "C" {
	pub fn _vsnprintf_r(arg1: *mut _reent,
	                    arg2: *mut core::ffi::c_char,
	                    arg3: usize,
	                    arg4: *const core::ffi::c_char,
	                    arg5: __gnuc_va_list)
	                    -> core::ffi::c_int;
}
extern "C" {
	pub fn _vsprintf_r(arg1: *mut _reent,
	                   arg2: *mut core::ffi::c_char,
	                   arg3: *const core::ffi::c_char,
	                   arg4: __gnuc_va_list)
	                   -> core::ffi::c_int;
}
extern "C" {
	pub fn _vsscanf_r(arg1: *mut _reent,
	                  arg2: *const core::ffi::c_char,
	                  arg3: *const core::ffi::c_char,
	                  arg4: __gnuc_va_list)
	                  -> core::ffi::c_int;
}
extern "C" {
	pub fn fpurge(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn __getdelim(arg1: *mut *mut core::ffi::c_char, arg2: *mut usize, arg3: core::ffi::c_int, arg4: *mut FILE) -> isize;
}
extern "C" {
	pub fn __getline(arg1: *mut *mut core::ffi::c_char, arg2: *mut usize, arg3: *mut FILE) -> isize;
}
extern "C" {
	pub fn clearerr_unlocked(arg1: *mut FILE);
}
extern "C" {
	pub fn feof_unlocked(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn ferror_unlocked(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn fileno_unlocked(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn fflush_unlocked(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn fgetc_unlocked(arg1: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn fputc_unlocked(arg1: core::ffi::c_int, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn fread_unlocked(arg1: *mut core::ffi::c_void, _size: usize, _n: usize, arg2: *mut FILE) -> usize;
}
extern "C" {
	pub fn fwrite_unlocked(arg1: *const core::ffi::c_void, _size: usize, _n: usize, arg2: *mut FILE) -> usize;
}
extern "C" {
	pub fn __srget_r(arg1: *mut _reent, arg2: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn __swbuf_r(arg1: *mut _reent, arg2: core::ffi::c_int, arg3: *mut FILE) -> core::ffi::c_int;
}
extern "C" {
	pub fn funopen(__cookie: *const core::ffi::c_void,
	               __readfn: ::core::option::Option<unsafe extern "C" fn(__cookie: *mut core::ffi::c_void,
	                                                           __buf: *mut core::ffi::c_char,
	                                                           __n: core::ffi::c_int)
	                                                           -> core::ffi::c_int>,
	               __writefn: ::core::option::Option<unsafe extern "C" fn(__cookie: *mut core::ffi::c_void,
	                                                           __buf: *const core::ffi::c_char,
	                                                           __n: core::ffi::c_int)
	                                                           -> core::ffi::c_int>,
	               __seekfn: ::core::option::Option<unsafe extern "C" fn(__cookie: *mut core::ffi::c_void,
	                                                           __off: fpos_t,
	                                                           __whence: core::ffi::c_int)
	                                                           -> fpos_t>,
	               __closefn: ::core::option::Option<unsafe extern "C" fn(__cookie: *mut core::ffi::c_void) -> core::ffi::c_int>)
	               -> *mut FILE;
}
extern "C" {
	pub fn _funopen_r(arg1: *mut _reent,
	                  __cookie: *const core::ffi::c_void,
	                  __readfn: ::core::option::Option<unsafe extern "C" fn(__cookie: *mut core::ffi::c_void,
	                                                              __buf: *mut core::ffi::c_char,
	                                                              __n: core::ffi::c_int)
	                                                              -> core::ffi::c_int>,
	                  __writefn: ::core::option::Option<unsafe extern "C" fn(__cookie: *mut core::ffi::c_void,
	                                                              __buf: *const core::ffi::c_char,
	                                                              __n: core::ffi::c_int)
	                                                              -> core::ffi::c_int>,
	                  __seekfn: ::core::option::Option<unsafe extern "C" fn(__cookie: *mut core::ffi::c_void,
	                                                              __off: fpos_t,
	                                                              __whence: core::ffi::c_int)
	                                                              -> fpos_t>,
	                  __closefn: ::core::option::Option<unsafe extern "C" fn(__cookie: *mut core::ffi::c_void) -> core::ffi::c_int>)
	                  -> *mut FILE;
}
#[repr(C)]
pub struct m_core_backoff_s {
	pub count: core::ffi::c_uint,
	pub seed: core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_m_core_backoff_s() {
	assert_eq!(
	           ::core::mem::size_of::<m_core_backoff_s>(),
	           8usize,
	           concat!("Size of: ", stringify!(m_core_backoff_s))
	);
	assert_eq!(
	           ::core::mem::align_of::<m_core_backoff_s>(),
	           4usize,
	           concat!("Alignment of ", stringify!(m_core_backoff_s))
	);
	fn test_field_count() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_core_backoff_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).count) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_core_backoff_s), "::", stringify!(count))
		);
	}
	test_field_count();
	fn test_field_seed() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_core_backoff_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).seed) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(m_core_backoff_s), "::", stringify!(seed))
		);
	}
	test_field_seed();
}
pub type m_core_backoff_ct = [m_core_backoff_s; 1usize];
#[repr(u32)]
#[non_exhaustive]
#[derive(Clone, Hash, PartialEq, Eq)]
pub enum m_serial_return_code_e {
	M_SERIAL_OK_DONE = 0,
	M_SERIAL_OK_CONTINUE = 1,
	M_SERIAL_FAIL = 2,
}
pub use self::m_serial_return_code_e as m_serial_return_code_t;
#[repr(C)]
pub struct m_serial_ll_u {
	pub b: __BindgenUnionField<bool>,
	pub c: __BindgenUnionField<core::ffi::c_char>,
	pub i: __BindgenUnionField<core::ffi::c_int>,
	pub l: __BindgenUnionField<core::ffi::c_long>,
	pub ll: __BindgenUnionField<core::ffi::c_longlong>,
	pub f: __BindgenUnionField<core::ffi::c_float>,
	pub d: __BindgenUnionField<core::ffi::c_double>,
	pub e: __BindgenUnionField<f64>,
	pub s: __BindgenUnionField<usize>,
	pub u: __BindgenUnionField<usize>,
	pub p: __BindgenUnionField<*mut core::ffi::c_void>,
	pub cstr: __BindgenUnionField<*const core::ffi::c_char>,
	pub r: __BindgenUnionField<m_serial_return_code_t>,
	pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_m_serial_ll_u() {
	assert_eq!(
	           ::core::mem::size_of::<m_serial_ll_u>(),
	           8usize,
	           concat!("Size of: ", stringify!(m_serial_ll_u))
	);
	assert_eq!(
	           ::core::mem::align_of::<m_serial_ll_u>(),
	           8usize,
	           concat!("Alignment of ", stringify!(m_serial_ll_u))
	);
	fn test_field_b() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).b) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(b))
		);
	}
	test_field_b();
	fn test_field_c() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).c) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(c))
		);
	}
	test_field_c();
	fn test_field_i() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).i) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(i))
		);
	}
	test_field_i();
	fn test_field_l() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).l) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(l))
		);
	}
	test_field_l();
	fn test_field_ll() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ll) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(ll))
		);
	}
	test_field_ll();
	fn test_field_f() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).f) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(f))
		);
	}
	test_field_f();
	fn test_field_d() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).d) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(d))
		);
	}
	test_field_d();
	fn test_field_e() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).e) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(e))
		);
	}
	test_field_e();
	fn test_field_s() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).s) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(s))
		);
	}
	test_field_s();
	fn test_field_u() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).u) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(u))
		);
	}
	test_field_u();
	fn test_field_p() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).p) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(p))
		);
	}
	test_field_p();
	fn test_field_cstr() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).cstr) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(cstr))
		);
	}
	test_field_cstr();
	fn test_field_r() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_ll_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).r) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_ll_u), "::", stringify!(r))
		);
	}
	test_field_r();
}
pub type m_serial_ll_ct = m_serial_ll_u;
#[repr(C)]
pub struct m_serial_local_s {
	pub data: [m_serial_ll_ct; 4usize],
}
#[test]
fn bindgen_test_layout_m_serial_local_s() {
	assert_eq!(
	           ::core::mem::size_of::<m_serial_local_s>(),
	           32usize,
	           concat!("Size of: ", stringify!(m_serial_local_s))
	);
	assert_eq!(
	           ::core::mem::align_of::<m_serial_local_s>(),
	           8usize,
	           concat!("Alignment of ", stringify!(m_serial_local_s))
	);
	fn test_field_data() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_local_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(m_serial_local_s), "::", stringify!(data))
		);
	}
	test_field_data();
}
pub type m_serial_local_t = [m_serial_local_s; 1usize];
#[repr(C)]
pub struct m_serial_read_s {
	pub m_interface: *const m_serial_read_interface_s,
	pub tmp: m_serial_ll_ct,
	pub data: [m_serial_ll_ct; 4usize],
}
#[test]
fn bindgen_test_layout_m_serial_read_s() {
	assert_eq!(
	           ::core::mem::size_of::<m_serial_read_s>(),
	           48usize,
	           concat!("Size of: ", stringify!(m_serial_read_s))
	);
	assert_eq!(
	           ::core::mem::align_of::<m_serial_read_s>(),
	           8usize,
	           concat!("Alignment of ", stringify!(m_serial_read_s))
	);
	fn test_field_m_interface() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).m_interface) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_s),
			"::",
			stringify!(m_interface)
		)
		);
	}
	test_field_m_interface();
	fn test_field_tmp() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).tmp) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(m_serial_read_s), "::", stringify!(tmp))
		);
	}
	test_field_tmp();
	fn test_field_data() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize
		           },
		           16usize,
		           concat!("Offset of field: ", stringify!(m_serial_read_s), "::", stringify!(data))
		);
	}
	test_field_data();
}
pub type m_serial_read_t = [m_serial_read_s; 1usize];
#[repr(C)]
pub struct m_serial_read_interface_s {
	pub read_boolean:
		::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_read_t, arg2: *mut bool) -> m_serial_return_code_t>,
	pub read_integer: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_read_t,
	                                                              arg2: *mut core::ffi::c_longlong,
	                                                              size_of_type: usize)
	                                                              -> m_serial_return_code_t>,
	pub read_float: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_read_t,
	                                                            arg2: *mut f64,
	                                                            size_of_type: usize)
	                                                            -> m_serial_return_code_t>,
	pub read_string:
		::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_read_t, arg2: *mut string_s) -> m_serial_return_code_t>,
	pub read_array_start: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                  arg2: *mut m_serial_read_t,
	                                                                  arg3: *mut usize)
	                                                                  -> m_serial_return_code_t>,
	pub read_array_next:
		::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t, arg2: *mut m_serial_read_t) -> m_serial_return_code_t>,
	pub read_map_start: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                arg2: *mut m_serial_read_t,
	                                                                arg3: *mut usize)
	                                                                -> m_serial_return_code_t>,
	pub read_map_value:
		::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t, arg2: *mut m_serial_read_t) -> m_serial_return_code_t>,
	pub read_map_next:
		::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t, arg2: *mut m_serial_read_t) -> m_serial_return_code_t>,
	pub read_tuple_start:
		::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t, arg2: *mut m_serial_read_t) -> m_serial_return_code_t>,
	pub read_tuple_id: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                               arg2: *mut m_serial_read_t,
	                                                               field_name: *const [*const core::ffi::c_char; 0usize],
	                                                               max: core::ffi::c_int,
	                                                               arg3: *mut core::ffi::c_int)
	                                                               -> m_serial_return_code_t>,
	pub read_variant_start: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                    arg2: *mut m_serial_read_t,
	                                                                    field_name: *const [*const core::ffi::c_char; 0usize],
	                                                                    max: core::ffi::c_int,
	                                                                    arg3: *mut core::ffi::c_int)
	                                                                    -> m_serial_return_code_t>,
	pub read_variant_end:
		::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t, arg2: *mut m_serial_read_t) -> m_serial_return_code_t>,
}
#[test]
fn bindgen_test_layout_m_serial_read_interface_s() {
	assert_eq!(
	           ::core::mem::size_of::<m_serial_read_interface_s>(),
	           52usize,
	           concat!("Size of: ", stringify!(m_serial_read_interface_s))
	);
	assert_eq!(
	           ::core::mem::align_of::<m_serial_read_interface_s>(),
	           4usize,
	           concat!("Alignment of ", stringify!(m_serial_read_interface_s))
	);
	fn test_field_read_boolean() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_boolean) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_boolean)
		)
		);
	}
	test_field_read_boolean();
	fn test_field_read_integer() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_integer) as usize - ptr as usize
		           },
		           4usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_integer)
		)
		);
	}
	test_field_read_integer();
	fn test_field_read_float() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_float) as usize - ptr as usize
		           },
		           8usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_float)
		)
		);
	}
	test_field_read_float();
	fn test_field_read_string() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_string) as usize - ptr as usize
		           },
		           12usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_string)
		)
		);
	}
	test_field_read_string();
	fn test_field_read_array_start() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_array_start) as usize - ptr as usize
		           },
		           16usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_array_start)
		)
		);
	}
	test_field_read_array_start();
	fn test_field_read_array_next() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_array_next) as usize - ptr as usize
		           },
		           20usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_array_next)
		)
		);
	}
	test_field_read_array_next();
	fn test_field_read_map_start() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_map_start) as usize - ptr as usize
		           },
		           24usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_map_start)
		)
		);
	}
	test_field_read_map_start();
	fn test_field_read_map_value() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_map_value) as usize - ptr as usize
		           },
		           28usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_map_value)
		)
		);
	}
	test_field_read_map_value();
	fn test_field_read_map_next() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_map_next) as usize - ptr as usize
		           },
		           32usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_map_next)
		)
		);
	}
	test_field_read_map_next();
	fn test_field_read_tuple_start() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_tuple_start) as usize - ptr as usize
		           },
		           36usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_tuple_start)
		)
		);
	}
	test_field_read_tuple_start();
	fn test_field_read_tuple_id() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_tuple_id) as usize - ptr as usize
		           },
		           40usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_tuple_id)
		)
		);
	}
	test_field_read_tuple_id();
	fn test_field_read_variant_start() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_variant_start) as usize - ptr as usize
		           },
		           44usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_variant_start)
		)
		);
	}
	test_field_read_variant_start();
	fn test_field_read_variant_end() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_read_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).read_variant_end) as usize - ptr as usize
		           },
		           48usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_read_interface_s),
			"::",
			stringify!(read_variant_end)
		)
		);
	}
	test_field_read_variant_end();
}
pub type m_serial_read_interface_t = m_serial_read_interface_s;
#[repr(C)]
pub struct m_serial_write_s {
	pub m_interface: *const m_serial_write_interface_s,
	pub tmp: m_serial_ll_ct,
	pub data: [m_serial_ll_ct; 4usize],
}
#[test]
fn bindgen_test_layout_m_serial_write_s() {
	assert_eq!(
	           ::core::mem::size_of::<m_serial_write_s>(),
	           48usize,
	           concat!("Size of: ", stringify!(m_serial_write_s))
	);
	assert_eq!(
	           ::core::mem::align_of::<m_serial_write_s>(),
	           8usize,
	           concat!("Alignment of ", stringify!(m_serial_write_s))
	);
	fn test_field_m_interface() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).m_interface) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_s),
			"::",
			stringify!(m_interface)
		)
		);
	}
	test_field_m_interface();
	fn test_field_tmp() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).tmp) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(m_serial_write_s), "::", stringify!(tmp))
		);
	}
	test_field_tmp();
	fn test_field_data() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize
		           },
		           16usize,
		           concat!("Offset of field: ", stringify!(m_serial_write_s), "::", stringify!(data))
		);
	}
	test_field_data();
}
pub type m_serial_write_t = [m_serial_write_s; 1usize];
#[repr(C)]
pub struct m_serial_write_interface_s {
	pub write_boolean: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_write_t, data: bool) -> m_serial_return_code_t>,
	pub write_integer: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_write_t,
	                                                               data: core::ffi::c_longlong,
	                                                               size_of_type: usize)
	                                                               -> m_serial_return_code_t>,
	pub write_float: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_write_t,
	                                                             data: f64,
	                                                             size_of_type: usize)
	                                                             -> m_serial_return_code_t>,
	pub write_string: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_write_t,
	                                                              data: *const [core::ffi::c_char; 0usize],
	                                                              len: usize)
	                                                              -> m_serial_return_code_t>,
	pub write_array_start: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                   arg2: *mut m_serial_write_t,
	                                                                   number_of_elements: usize)
	                                                                   -> m_serial_return_code_t>,
	pub write_array_next: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                  arg2: *mut m_serial_write_t)
	                                                                  -> m_serial_return_code_t>,
	pub write_array_end: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                 arg2: *mut m_serial_write_t)
	                                                                 -> m_serial_return_code_t>,
	pub write_map_start: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                 arg2: *mut m_serial_write_t,
	                                                                 number_of_elements: usize)
	                                                                 -> m_serial_return_code_t>,
	pub write_map_value: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                 arg2: *mut m_serial_write_t)
	                                                                 -> m_serial_return_code_t>,
	pub write_map_next: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                arg2: *mut m_serial_write_t)
	                                                                -> m_serial_return_code_t>,
	pub write_map_end: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                               arg2: *mut m_serial_write_t)
	                                                               -> m_serial_return_code_t>,
	pub write_tuple_start: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                   arg2: *mut m_serial_write_t)
	                                                                   -> m_serial_return_code_t>,
	pub write_tuple_id: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                arg2: *mut m_serial_write_t,
	                                                                field_name: *const [*const core::ffi::c_char; 0usize],
	                                                                max: core::ffi::c_int,
	                                                                index: core::ffi::c_int)
	                                                                -> m_serial_return_code_t>,
	pub write_tuple_end: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                 arg2: *mut m_serial_write_t)
	                                                                 -> m_serial_return_code_t>,
	pub write_variant_start: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                     arg2: *mut m_serial_write_t,
	                                                                     field_name: *const [*const core::ffi::c_char; 0usize],
	                                                                     max: core::ffi::c_int,
	                                                                     index: core::ffi::c_int)
	                                                                     -> m_serial_return_code_t>,
	pub write_variant_end: ::core::option::Option<unsafe extern "C" fn(arg1: *mut m_serial_local_t,
	                                                                   arg2: *mut m_serial_write_t)
	                                                                   -> m_serial_return_code_t>,
}
#[test]
fn bindgen_test_layout_m_serial_write_interface_s() {
	assert_eq!(
	           ::core::mem::size_of::<m_serial_write_interface_s>(),
	           64usize,
	           concat!("Size of: ", stringify!(m_serial_write_interface_s))
	);
	assert_eq!(
	           ::core::mem::align_of::<m_serial_write_interface_s>(),
	           4usize,
	           concat!("Alignment of ", stringify!(m_serial_write_interface_s))
	);
	fn test_field_write_boolean() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_boolean) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_boolean)
		)
		);
	}
	test_field_write_boolean();
	fn test_field_write_integer() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_integer) as usize - ptr as usize
		           },
		           4usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_integer)
		)
		);
	}
	test_field_write_integer();
	fn test_field_write_float() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_float) as usize - ptr as usize
		           },
		           8usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_float)
		)
		);
	}
	test_field_write_float();
	fn test_field_write_string() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_string) as usize - ptr as usize
		           },
		           12usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_string)
		)
		);
	}
	test_field_write_string();
	fn test_field_write_array_start() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_array_start) as usize - ptr as usize
		           },
		           16usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_array_start)
		)
		);
	}
	test_field_write_array_start();
	fn test_field_write_array_next() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_array_next) as usize - ptr as usize
		           },
		           20usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_array_next)
		)
		);
	}
	test_field_write_array_next();
	fn test_field_write_array_end() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_array_end) as usize - ptr as usize
		           },
		           24usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_array_end)
		)
		);
	}
	test_field_write_array_end();
	fn test_field_write_map_start() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_map_start) as usize - ptr as usize
		           },
		           28usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_map_start)
		)
		);
	}
	test_field_write_map_start();
	fn test_field_write_map_value() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_map_value) as usize - ptr as usize
		           },
		           32usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_map_value)
		)
		);
	}
	test_field_write_map_value();
	fn test_field_write_map_next() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_map_next) as usize - ptr as usize
		           },
		           36usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_map_next)
		)
		);
	}
	test_field_write_map_next();
	fn test_field_write_map_end() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_map_end) as usize - ptr as usize
		           },
		           40usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_map_end)
		)
		);
	}
	test_field_write_map_end();
	fn test_field_write_tuple_start() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_tuple_start) as usize - ptr as usize
		           },
		           44usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_tuple_start)
		)
		);
	}
	test_field_write_tuple_start();
	fn test_field_write_tuple_id() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_tuple_id) as usize - ptr as usize
		           },
		           48usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_tuple_id)
		)
		);
	}
	test_field_write_tuple_id();
	fn test_field_write_tuple_end() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_tuple_end) as usize - ptr as usize
		           },
		           52usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_tuple_end)
		)
		);
	}
	test_field_write_tuple_end();
	fn test_field_write_variant_start() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_variant_start) as usize - ptr as usize
		           },
		           56usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_variant_start)
		)
		);
	}
	test_field_write_variant_start();
	fn test_field_write_variant_end() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<m_serial_write_interface_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).write_variant_end) as usize - ptr as usize
		           },
		           60usize,
		           concat!(
			"Offset of field: ",
			stringify!(m_serial_write_interface_s),
			"::",
			stringify!(write_variant_end)
		)
		);
	}
	test_field_write_variant_end();
}
pub type m_serial_write_interface_t = m_serial_write_interface_s;
#[repr(C)]
pub struct string_heap_s {
	pub size: usize,
	pub alloc: usize,
}
#[test]
fn bindgen_test_layout_string_heap_s() {
	assert_eq!(
	           ::core::mem::size_of::<string_heap_s>(),
	           8usize,
	           concat!("Size of: ", stringify!(string_heap_s))
	);
	assert_eq!(
	           ::core::mem::align_of::<string_heap_s>(),
	           4usize,
	           concat!("Alignment of ", stringify!(string_heap_s))
	);
	fn test_field_size() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<string_heap_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).size) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(string_heap_s), "::", stringify!(size))
		);
	}
	test_field_size();
	fn test_field_alloc() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<string_heap_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).alloc) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(string_heap_s), "::", stringify!(alloc))
		);
	}
	test_field_alloc();
}
pub type string_heap_ct = string_heap_s;
#[repr(C)]
pub struct string_stack_s {
	pub buffer: [core::ffi::c_char; 8usize],
}
#[test]
fn bindgen_test_layout_string_stack_s() {
	assert_eq!(
	           ::core::mem::size_of::<string_stack_s>(),
	           8usize,
	           concat!("Size of: ", stringify!(string_stack_s))
	);
	assert_eq!(
	           ::core::mem::align_of::<string_stack_s>(),
	           1usize,
	           concat!("Alignment of ", stringify!(string_stack_s))
	);
	fn test_field_buffer() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<string_stack_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(string_stack_s), "::", stringify!(buffer))
		);
	}
	test_field_buffer();
}
pub type string_stack_ct = string_stack_s;
#[repr(C)]
pub struct string_union_u {
	pub heap: __BindgenUnionField<string_heap_ct>,
	pub stack: __BindgenUnionField<string_stack_ct>,
	pub bindgen_union_field: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_string_union_u() {
	assert_eq!(
	           ::core::mem::size_of::<string_union_u>(),
	           8usize,
	           concat!("Size of: ", stringify!(string_union_u))
	);
	assert_eq!(
	           ::core::mem::align_of::<string_union_u>(),
	           4usize,
	           concat!("Alignment of ", stringify!(string_union_u))
	);
	fn test_field_heap() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<string_union_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).heap) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(string_union_u), "::", stringify!(heap))
		);
	}
	test_field_heap();
	fn test_field_stack() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<string_union_u>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).stack) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(string_union_u), "::", stringify!(stack))
		);
	}
	test_field_stack();
}
pub type string_union_ct = string_union_u;
#[repr(C)]
pub struct string_s {
	pub u: string_union_ct,
	pub ptr: *mut core::ffi::c_char,
}
#[test]
fn bindgen_test_layout_string_s() {
	assert_eq!(
	           ::core::mem::size_of::<string_s>(),
	           12usize,
	           concat!("Size of: ", stringify!(string_s))
	);
	assert_eq!(
	           ::core::mem::align_of::<string_s>(),
	           4usize,
	           concat!("Alignment of ", stringify!(string_s))
	);
	fn test_field_u() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<string_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).u) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(string_s), "::", stringify!(u))
		);
	}
	test_field_u();
	fn test_field_ptr() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<string_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(string_s), "::", stringify!(ptr))
		);
	}
	test_field_ptr();
}
pub type string_t = [string_s; 1usize];
pub type string_ptr = *mut string_s;
pub type string_srcptr = *const string_s;
#[repr(u32)]
#[non_exhaustive]
#[derive(Clone, Hash, PartialEq, Eq)]
pub enum string_fgets_e {
	STRING_READ_LINE = 0,
	STRING_READ_PURE_LINE = 1,
	STRING_READ_FILE = 2,
}
pub use self::string_fgets_e as string_fgets_t;
#[repr(u32)]
#[non_exhaustive]
#[derive(Clone, Hash, PartialEq, Eq)]
pub enum m_str1ng_utf8_state_e {
	M_STRING_UTF8_STARTING = 0,
	M_STRING_UTF8_DECODING_1 = 8,
	M_STRING_UTF8_DECODING_2 = 16,
	M_STRING_UTF8_DOCODING_3 = 24,
	M_STRING_UTF8_ERROR = 32,
}
pub type string_unicode_t = core::ffi::c_uint;
#[repr(C)]
pub struct string_it_s {
	pub u: string_unicode_t,
	pub ptr: *const core::ffi::c_char,
	pub next_ptr: *const core::ffi::c_char,
}
#[test]
fn bindgen_test_layout_string_it_s() {
	assert_eq!(
	           ::core::mem::size_of::<string_it_s>(),
	           12usize,
	           concat!("Size of: ", stringify!(string_it_s))
	);
	assert_eq!(
	           ::core::mem::align_of::<string_it_s>(),
	           4usize,
	           concat!("Alignment of ", stringify!(string_it_s))
	);
	fn test_field_u() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<string_it_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).u) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(string_it_s), "::", stringify!(u))
		);
	}
	test_field_u();
	fn test_field_ptr() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<string_it_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(string_it_s), "::", stringify!(ptr))
		);
	}
	test_field_ptr();
	fn test_field_next_ptr() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<string_it_s>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).next_ptr) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(string_it_s), "::", stringify!(next_ptr))
		);
	}
	test_field_next_ptr();
}
pub type string_it_t = [string_it_s; 1usize];
#[repr(u32)]
#[non_exhaustive]
#[derive(Clone, Hash, PartialEq, Eq)]
pub enum CliSymbols {
	CliSymbolAsciiSOH = 1,
	CliSymbolAsciiETX = 3,
	CliSymbolAsciiEOT = 4,
	CliSymbolAsciiBell = 7,
	CliSymbolAsciiBackspace = 8,
	CliSymbolAsciiTab = 9,
	CliSymbolAsciiLF = 10,
	CliSymbolAsciiCR = 13,
	CliSymbolAsciiEsc = 27,
	CliSymbolAsciiUS = 31,
	CliSymbolAsciiSpace = 32,
	CliSymbolAsciiDel = 127,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Clone, Hash, PartialEq, Eq)]
pub enum CliCommandFlag {
	#[doc = "< Default, loader lock is used"]
	CliCommandFlagDefault = 0,
	CliCommandFlagParallelSafe = 1,
	#[doc = "< Safe to run with insomnia mode on"]
	CliCommandFlagInsomniaSafe = 2,
}
#[repr(C)]
pub struct Cli {
	_unused: [u8; 0],
}
#[doc = " Cli callback function pointer. Implement this interface and use"]
#[doc = " add_cli_command"]
#[doc = " @param      args     string with what was passed after command"]
#[doc = " @param      context  pointer to whatever you gave us on cli_add_command"]
pub type CliCallback =
	::core::option::Option<unsafe extern "C" fn(cli: *mut Cli, args: *mut string_t, context: *mut core::ffi::c_void)>;
extern "C" {
	#[doc = " Add cli command Registers you command callback"]
	#[doc = ""]
	#[doc = " @param      cli       pointer to cli instance"]
	#[doc = " @param      name      command name"]
	#[doc = " @param      flags     CliCommandFlag"]
	#[doc = " @param      callback  callback function"]
	#[doc = " @param      context   pointer to whatever we need to pass to callback"]
	pub fn cli_add_command(cli: *mut Cli,
	                       name: *const core::ffi::c_char,
	                       flags: CliCommandFlag,
	                       callback: CliCallback,
	                       context: *mut core::ffi::c_void);
}
extern "C" {
	#[doc = " Print unified cmd usage tip"]
	#[doc = ""]
	#[doc = " @param      cmd    cmd name"]
	#[doc = " @param      usage  usage tip"]
	#[doc = " @param      arg    arg passed by user"]
	pub fn cli_print_usage(cmd: *const core::ffi::c_char, usage: *const core::ffi::c_char, arg: *const core::ffi::c_char);
}
extern "C" {
	#[doc = " Delete cli command"]
	#[doc = ""]
	#[doc = " @param      cli   pointer to cli instance"]
	#[doc = " @param      name  command name"]
	pub fn cli_delete_command(cli: *mut Cli, name: *const core::ffi::c_char);
}
extern "C" {
	#[doc = " Read from terminal"]
	#[doc = ""]
	#[doc = " @param      cli     Cli instance"]
	#[doc = " @param      buffer  pointer to buffer"]
	#[doc = " @param      size    size of buffer in bytes"]
	#[doc = ""]
	#[doc = " @return     bytes read"]
	pub fn cli_read(cli: *mut Cli, buffer: *mut u8, size: usize) -> usize;
}
extern "C" {
	#[doc = " Non-blocking read from terminal"]
	#[doc = ""]
	#[doc = " @param      cli     Cli instance"]
	#[doc = " @param      buffer  pointer to buffer"]
	#[doc = " @param      size    size of buffer in bytes"]
	#[doc = " @param      timeout timeout value in ms"]
	#[doc = ""]
	#[doc = " @return     bytes read"]
	pub fn cli_read_timeout(cli: *mut Cli, buffer: *mut u8, size: usize, timeout: u32) -> usize;
}
extern "C" {
	#[doc = " Non-blocking check for interrupt command received"]
	#[doc = ""]
	#[doc = " @param      cli   Cli instance"]
	#[doc = ""]
	#[doc = " @return     true if received"]
	pub fn cli_cmd_interrupt_received(cli: *mut Cli) -> bool;
}
extern "C" {
	#[doc = " Write to terminal Do it only from inside of cli call."]
	#[doc = ""]
	#[doc = " @param      cli     Cli instance"]
	#[doc = " @param      buffer  pointer to buffer"]
	#[doc = " @param      size    size of buffer in bytes"]
	pub fn cli_write(cli: *mut Cli, buffer: *const u8, size: usize);
}
extern "C" {
	#[doc = " Read character"]
	#[doc = ""]
	#[doc = " @param      cli   Cli instance"]
	#[doc = ""]
	#[doc = " @return     char"]
	pub fn cli_getc(cli: *mut Cli) -> core::ffi::c_char;
}
extern "C" {
	#[doc = " New line Send new ine sequence"]
	pub fn cli_nl();
}
extern "C" {
	pub fn cli_session_open(cli: *mut Cli, session: *mut core::ffi::c_void);
}
extern "C" {
	pub fn cli_session_close(cli: *mut Cli);
}
extern "C" {
	pub fn cli_is_connected(cli: *mut Cli) -> bool;
}
#[repr(C)]
pub struct CliSession {
	_unused: [u8; 0],
}
extern "C" {
	pub static mut cli_vcp: CliSession;
}
extern "C" {
	#[doc = " Crash system"]
	pub fn furi_crash(message: *const core::ffi::c_char);
}
extern "C" {
	#[doc = " Halt system"]
	pub fn furi_halt(message: *const core::ffi::c_char);
}
extern "C" {
	#[doc = "< System Clock Frequency"]
	pub static mut SystemCoreClock: u32;
}
extern "C" {
	pub fn furi_thread_catch();
}
pub type TaskFunction_t = ::core::option::Option<unsafe extern "C" fn(arg1: *mut core::ffi::c_void)>;
pub type StackType_t = u32;
pub type BaseType_t = core::ffi::c_long;
pub type UBaseType_t = core::ffi::c_ulong;
pub type TickType_t = u32;
extern "C" {
	pub fn vPortEnterCritical();
}
extern "C" {
	pub fn vPortExitCritical();
}
extern "C" {
	pub fn vPortSuppressTicksAndSleep(xExpectedIdleTime: TickType_t);
}
extern "C" {
	pub fn pxPortInitialiseStack(pxTopOfStack: *mut StackType_t,
	                             pxCode: TaskFunction_t,
	                             pvParameters: *mut core::ffi::c_void)
	                             -> *mut StackType_t;
}
#[repr(C)]
pub struct HeapRegion {
	pub pucStartAddress: *mut u8,
	pub xSizeInBytes: usize,
}
#[test]
fn bindgen_test_layout_HeapRegion() {
	assert_eq!(
	           ::core::mem::size_of::<HeapRegion>(),
	           8usize,
	           concat!("Size of: ", stringify!(HeapRegion))
	);
	assert_eq!(
	           ::core::mem::align_of::<HeapRegion>(),
	           4usize,
	           concat!("Alignment of ", stringify!(HeapRegion))
	);
	fn test_field_pucStartAddress() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<HeapRegion>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pucStartAddress) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(HeapRegion), "::", stringify!(pucStartAddress))
		);
	}
	test_field_pucStartAddress();
	fn test_field_xSizeInBytes() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<HeapRegion>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xSizeInBytes) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(HeapRegion), "::", stringify!(xSizeInBytes))
		);
	}
	test_field_xSizeInBytes();
}
pub type HeapRegion_t = HeapRegion;
#[repr(C)]
pub struct xHeapStats {
	pub xAvailableHeapSpaceInBytes: usize,
	pub xSizeOfLargestFreeBlockInBytes: usize,
	pub xSizeOfSmallestFreeBlockInBytes: usize,
	pub xNumberOfFreeBlocks: usize,
	pub xMinimumEverFreeBytesRemaining: usize,
	pub xNumberOfSuccessfulAllocations: usize,
	pub xNumberOfSuccessfulFrees: usize,
}
#[test]
fn bindgen_test_layout_xHeapStats() {
	assert_eq!(
	           ::core::mem::size_of::<xHeapStats>(),
	           28usize,
	           concat!("Size of: ", stringify!(xHeapStats))
	);
	assert_eq!(
	           ::core::mem::align_of::<xHeapStats>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xHeapStats))
	);
	fn test_field_xAvailableHeapSpaceInBytes() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xHeapStats>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xAvailableHeapSpaceInBytes) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(xHeapStats),
			"::",
			stringify!(xAvailableHeapSpaceInBytes)
		)
		);
	}
	test_field_xAvailableHeapSpaceInBytes();
	fn test_field_xSizeOfLargestFreeBlockInBytes() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xHeapStats>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xSizeOfLargestFreeBlockInBytes) as usize - ptr as usize
		           },
		           4usize,
		           concat!(
			"Offset of field: ",
			stringify!(xHeapStats),
			"::",
			stringify!(xSizeOfLargestFreeBlockInBytes)
		)
		);
	}
	test_field_xSizeOfLargestFreeBlockInBytes();
	fn test_field_xSizeOfSmallestFreeBlockInBytes() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xHeapStats>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xSizeOfSmallestFreeBlockInBytes) as usize - ptr as usize
		           },
		           8usize,
		           concat!(
			"Offset of field: ",
			stringify!(xHeapStats),
			"::",
			stringify!(xSizeOfSmallestFreeBlockInBytes)
		)
		);
	}
	test_field_xSizeOfSmallestFreeBlockInBytes();
	fn test_field_xNumberOfFreeBlocks() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xHeapStats>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xNumberOfFreeBlocks) as usize - ptr as usize
		           },
		           12usize,
		           concat!(
			"Offset of field: ",
			stringify!(xHeapStats),
			"::",
			stringify!(xNumberOfFreeBlocks)
		)
		);
	}
	test_field_xNumberOfFreeBlocks();
	fn test_field_xMinimumEverFreeBytesRemaining() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xHeapStats>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xMinimumEverFreeBytesRemaining) as usize - ptr as usize
		           },
		           16usize,
		           concat!(
			"Offset of field: ",
			stringify!(xHeapStats),
			"::",
			stringify!(xMinimumEverFreeBytesRemaining)
		)
		);
	}
	test_field_xMinimumEverFreeBytesRemaining();
	fn test_field_xNumberOfSuccessfulAllocations() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xHeapStats>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xNumberOfSuccessfulAllocations) as usize - ptr as usize
		           },
		           20usize,
		           concat!(
			"Offset of field: ",
			stringify!(xHeapStats),
			"::",
			stringify!(xNumberOfSuccessfulAllocations)
		)
		);
	}
	test_field_xNumberOfSuccessfulAllocations();
	fn test_field_xNumberOfSuccessfulFrees() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xHeapStats>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xNumberOfSuccessfulFrees) as usize - ptr as usize
		           },
		           24usize,
		           concat!(
			"Offset of field: ",
			stringify!(xHeapStats),
			"::",
			stringify!(xNumberOfSuccessfulFrees)
		)
		);
	}
	test_field_xNumberOfSuccessfulFrees();
}
pub type HeapStats_t = xHeapStats;
extern "C" {
	pub fn vPortDefineHeapRegions(pxHeapRegions: *const HeapRegion_t);
}
extern "C" {
	pub fn vPortGetHeapStats(pxHeapStats: *mut HeapStats_t);
}
extern "C" {
	pub fn pvPortMalloc(xSize: usize) -> *mut core::ffi::c_void;
}
extern "C" {
	pub fn vPortFree(pv: *mut core::ffi::c_void);
}
extern "C" {
	pub fn vPortInitialiseBlocks();
}
extern "C" {
	pub fn xPortGetFreeHeapSize() -> usize;
}
extern "C" {
	pub fn xPortGetMinimumEverFreeHeapSize() -> usize;
}
extern "C" {
	pub fn xPortStartScheduler() -> BaseType_t;
}
extern "C" {
	pub fn vPortEndScheduler();
}
#[repr(C)]
pub struct xSTATIC_LIST_ITEM {
	pub xDummy2: TickType_t,
	pub pvDummy3: [*mut core::ffi::c_void; 4usize],
}
#[test]
fn bindgen_test_layout_xSTATIC_LIST_ITEM() {
	assert_eq!(
	           ::core::mem::size_of::<xSTATIC_LIST_ITEM>(),
	           20usize,
	           concat!("Size of: ", stringify!(xSTATIC_LIST_ITEM))
	);
	assert_eq!(
	           ::core::mem::align_of::<xSTATIC_LIST_ITEM>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xSTATIC_LIST_ITEM))
	);
	fn test_field_xDummy2() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_LIST_ITEM>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xDummy2) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_LIST_ITEM), "::", stringify!(xDummy2))
		);
	}
	test_field_xDummy2();
	fn test_field_pvDummy3() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_LIST_ITEM>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvDummy3) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_LIST_ITEM), "::", stringify!(pvDummy3))
		);
	}
	test_field_pvDummy3();
}
pub type StaticListItem_t = xSTATIC_LIST_ITEM;
#[repr(C)]
pub struct xSTATIC_MINI_LIST_ITEM {
	pub xDummy2: TickType_t,
	pub pvDummy3: [*mut core::ffi::c_void; 2usize],
}
#[test]
fn bindgen_test_layout_xSTATIC_MINI_LIST_ITEM() {
	assert_eq!(
	           ::core::mem::size_of::<xSTATIC_MINI_LIST_ITEM>(),
	           12usize,
	           concat!("Size of: ", stringify!(xSTATIC_MINI_LIST_ITEM))
	);
	assert_eq!(
	           ::core::mem::align_of::<xSTATIC_MINI_LIST_ITEM>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xSTATIC_MINI_LIST_ITEM))
	);
	fn test_field_xDummy2() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_MINI_LIST_ITEM>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xDummy2) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(xSTATIC_MINI_LIST_ITEM),
			"::",
			stringify!(xDummy2)
		)
		);
	}
	test_field_xDummy2();
	fn test_field_pvDummy3() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_MINI_LIST_ITEM>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvDummy3) as usize - ptr as usize
		           },
		           4usize,
		           concat!(
			"Offset of field: ",
			stringify!(xSTATIC_MINI_LIST_ITEM),
			"::",
			stringify!(pvDummy3)
		)
		);
	}
	test_field_pvDummy3();
}
pub type StaticMiniListItem_t = xSTATIC_MINI_LIST_ITEM;
#[repr(C)]
pub struct xSTATIC_LIST {
	pub uxDummy2: UBaseType_t,
	pub pvDummy3: *mut core::ffi::c_void,
	pub xDummy4: StaticMiniListItem_t,
}
#[test]
fn bindgen_test_layout_xSTATIC_LIST() {
	assert_eq!(
	           ::core::mem::size_of::<xSTATIC_LIST>(),
	           20usize,
	           concat!("Size of: ", stringify!(xSTATIC_LIST))
	);
	assert_eq!(
	           ::core::mem::align_of::<xSTATIC_LIST>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xSTATIC_LIST))
	);
	fn test_field_uxDummy2() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_LIST>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxDummy2) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_LIST), "::", stringify!(uxDummy2))
		);
	}
	test_field_uxDummy2();
	fn test_field_pvDummy3() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_LIST>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvDummy3) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_LIST), "::", stringify!(pvDummy3))
		);
	}
	test_field_pvDummy3();
	fn test_field_xDummy4() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_LIST>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xDummy4) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_LIST), "::", stringify!(xDummy4))
		);
	}
	test_field_xDummy4();
}
pub type StaticList_t = xSTATIC_LIST;
#[repr(C)]
pub struct xSTATIC_TCB {
	pub pxDummy1: *mut core::ffi::c_void,
	pub xDummy3: [StaticListItem_t; 2usize],
	pub uxDummy5: UBaseType_t,
	pub pxDummy6: *mut core::ffi::c_void,
	pub ucDummy7: [u8; 16usize],
	pub pxDummy8: *mut core::ffi::c_void,
	pub uxDummy10: [UBaseType_t; 2usize],
	pub uxDummy12: [UBaseType_t; 2usize],
	pub pvDummy15: [*mut core::ffi::c_void; 1usize],
	pub ulDummy18: [u32; 2usize],
	pub ucDummy19: [u8; 2usize],
	pub uxDummy20: u8,
}
#[test]
fn bindgen_test_layout_xSTATIC_TCB() {
	assert_eq!(
	           ::core::mem::size_of::<xSTATIC_TCB>(),
	           104usize,
	           concat!("Size of: ", stringify!(xSTATIC_TCB))
	);
	assert_eq!(
	           ::core::mem::align_of::<xSTATIC_TCB>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xSTATIC_TCB))
	);
	fn test_field_pxDummy1() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TCB>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pxDummy1) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TCB), "::", stringify!(pxDummy1))
		);
	}
	test_field_pxDummy1();
	fn test_field_xDummy3() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TCB>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xDummy3) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TCB), "::", stringify!(xDummy3))
		);
	}
	test_field_xDummy3();
	fn test_field_uxDummy5() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TCB>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxDummy5) as usize - ptr as usize
		           },
		           44usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TCB), "::", stringify!(uxDummy5))
		);
	}
	test_field_uxDummy5();
	fn test_field_pxDummy6() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TCB>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pxDummy6) as usize - ptr as usize
		           },
		           48usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TCB), "::", stringify!(pxDummy6))
		);
	}
	test_field_pxDummy6();
	fn test_field_ucDummy7() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TCB>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ucDummy7) as usize - ptr as usize
		           },
		           52usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TCB), "::", stringify!(ucDummy7))
		);
	}
	test_field_ucDummy7();
	fn test_field_pxDummy8() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TCB>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pxDummy8) as usize - ptr as usize
		           },
		           68usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TCB), "::", stringify!(pxDummy8))
		);
	}
	test_field_pxDummy8();
	fn test_field_uxDummy10() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TCB>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxDummy10) as usize - ptr as usize
		           },
		           72usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TCB), "::", stringify!(uxDummy10))
		);
	}
	test_field_uxDummy10();
	fn test_field_uxDummy12() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TCB>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxDummy12) as usize - ptr as usize
		           },
		           80usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TCB), "::", stringify!(uxDummy12))
		);
	}
	test_field_uxDummy12();
	fn test_field_pvDummy15() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TCB>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvDummy15) as usize - ptr as usize
		           },
		           88usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TCB), "::", stringify!(pvDummy15))
		);
	}
	test_field_pvDummy15();
	fn test_field_ulDummy18() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TCB>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ulDummy18) as usize - ptr as usize
		           },
		           92usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TCB), "::", stringify!(ulDummy18))
		);
	}
	test_field_ulDummy18();
	fn test_field_ucDummy19() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TCB>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ucDummy19) as usize - ptr as usize
		           },
		           100usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TCB), "::", stringify!(ucDummy19))
		);
	}
	test_field_ucDummy19();
	fn test_field_uxDummy20() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TCB>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxDummy20) as usize - ptr as usize
		           },
		           102usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TCB), "::", stringify!(uxDummy20))
		);
	}
	test_field_uxDummy20();
}
pub type StaticTask_t = xSTATIC_TCB;
#[repr(C)]
pub struct xSTATIC_QUEUE {
	pub pvDummy1: [*mut core::ffi::c_void; 3usize],
	pub u: xSTATIC_QUEUE__bindgen_ty_1,
	pub xDummy3: [StaticList_t; 2usize],
	pub uxDummy4: [UBaseType_t; 3usize],
	pub ucDummy5: [u8; 2usize],
	pub ucDummy6: u8,
	pub uxDummy8: UBaseType_t,
	pub ucDummy9: u8,
}
#[repr(C)]
pub struct xSTATIC_QUEUE__bindgen_ty_1 {
	pub pvDummy2: __BindgenUnionField<*mut core::ffi::c_void>,
	pub uxDummy2: __BindgenUnionField<UBaseType_t>,
	pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_xSTATIC_QUEUE__bindgen_ty_1() {
	assert_eq!(
	           ::core::mem::size_of::<xSTATIC_QUEUE__bindgen_ty_1>(),
	           4usize,
	           concat!("Size of: ", stringify!(xSTATIC_QUEUE__bindgen_ty_1))
	);
	assert_eq!(
	           ::core::mem::align_of::<xSTATIC_QUEUE__bindgen_ty_1>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xSTATIC_QUEUE__bindgen_ty_1))
	);
	fn test_field_pvDummy2() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_QUEUE__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvDummy2) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(xSTATIC_QUEUE__bindgen_ty_1),
			"::",
			stringify!(pvDummy2)
		)
		);
	}
	test_field_pvDummy2();
	fn test_field_uxDummy2() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_QUEUE__bindgen_ty_1>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxDummy2) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(xSTATIC_QUEUE__bindgen_ty_1),
			"::",
			stringify!(uxDummy2)
		)
		);
	}
	test_field_uxDummy2();
}
#[test]
fn bindgen_test_layout_xSTATIC_QUEUE() {
	assert_eq!(
	           ::core::mem::size_of::<xSTATIC_QUEUE>(),
	           80usize,
	           concat!("Size of: ", stringify!(xSTATIC_QUEUE))
	);
	assert_eq!(
	           ::core::mem::align_of::<xSTATIC_QUEUE>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xSTATIC_QUEUE))
	);
	fn test_field_pvDummy1() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_QUEUE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvDummy1) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_QUEUE), "::", stringify!(pvDummy1))
		);
	}
	test_field_pvDummy1();
	fn test_field_u() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_QUEUE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).u) as usize - ptr as usize
		           },
		           12usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_QUEUE), "::", stringify!(u))
		);
	}
	test_field_u();
	fn test_field_xDummy3() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_QUEUE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xDummy3) as usize - ptr as usize
		           },
		           16usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_QUEUE), "::", stringify!(xDummy3))
		);
	}
	test_field_xDummy3();
	fn test_field_uxDummy4() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_QUEUE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxDummy4) as usize - ptr as usize
		           },
		           56usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_QUEUE), "::", stringify!(uxDummy4))
		);
	}
	test_field_uxDummy4();
	fn test_field_ucDummy5() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_QUEUE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ucDummy5) as usize - ptr as usize
		           },
		           68usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_QUEUE), "::", stringify!(ucDummy5))
		);
	}
	test_field_ucDummy5();
	fn test_field_ucDummy6() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_QUEUE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ucDummy6) as usize - ptr as usize
		           },
		           70usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_QUEUE), "::", stringify!(ucDummy6))
		);
	}
	test_field_ucDummy6();
	fn test_field_uxDummy8() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_QUEUE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxDummy8) as usize - ptr as usize
		           },
		           72usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_QUEUE), "::", stringify!(uxDummy8))
		);
	}
	test_field_uxDummy8();
	fn test_field_ucDummy9() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_QUEUE>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ucDummy9) as usize - ptr as usize
		           },
		           76usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_QUEUE), "::", stringify!(ucDummy9))
		);
	}
	test_field_ucDummy9();
}
pub type StaticQueue_t = xSTATIC_QUEUE;
pub type StaticSemaphore_t = StaticQueue_t;
#[repr(C)]
pub struct xSTATIC_EVENT_GROUP {
	pub xDummy1: TickType_t,
	pub xDummy2: StaticList_t,
	pub uxDummy3: UBaseType_t,
	pub ucDummy4: u8,
}
#[test]
fn bindgen_test_layout_xSTATIC_EVENT_GROUP() {
	assert_eq!(
	           ::core::mem::size_of::<xSTATIC_EVENT_GROUP>(),
	           32usize,
	           concat!("Size of: ", stringify!(xSTATIC_EVENT_GROUP))
	);
	assert_eq!(
	           ::core::mem::align_of::<xSTATIC_EVENT_GROUP>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xSTATIC_EVENT_GROUP))
	);
	fn test_field_xDummy1() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_EVENT_GROUP>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xDummy1) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(xSTATIC_EVENT_GROUP),
			"::",
			stringify!(xDummy1)
		)
		);
	}
	test_field_xDummy1();
	fn test_field_xDummy2() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_EVENT_GROUP>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xDummy2) as usize - ptr as usize
		           },
		           4usize,
		           concat!(
			"Offset of field: ",
			stringify!(xSTATIC_EVENT_GROUP),
			"::",
			stringify!(xDummy2)
		)
		);
	}
	test_field_xDummy2();
	fn test_field_uxDummy3() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_EVENT_GROUP>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxDummy3) as usize - ptr as usize
		           },
		           24usize,
		           concat!(
			"Offset of field: ",
			stringify!(xSTATIC_EVENT_GROUP),
			"::",
			stringify!(uxDummy3)
		)
		);
	}
	test_field_uxDummy3();
	fn test_field_ucDummy4() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_EVENT_GROUP>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ucDummy4) as usize - ptr as usize
		           },
		           28usize,
		           concat!(
			"Offset of field: ",
			stringify!(xSTATIC_EVENT_GROUP),
			"::",
			stringify!(ucDummy4)
		)
		);
	}
	test_field_ucDummy4();
}
pub type StaticEventGroup_t = xSTATIC_EVENT_GROUP;
#[repr(C)]
pub struct xSTATIC_TIMER {
	pub pvDummy1: *mut core::ffi::c_void,
	pub xDummy2: StaticListItem_t,
	pub xDummy3: TickType_t,
	pub pvDummy5: *mut core::ffi::c_void,
	pub pvDummy6: TaskFunction_t,
	pub uxDummy7: UBaseType_t,
	pub ucDummy8: u8,
}
#[test]
fn bindgen_test_layout_xSTATIC_TIMER() {
	assert_eq!(
	           ::core::mem::size_of::<xSTATIC_TIMER>(),
	           44usize,
	           concat!("Size of: ", stringify!(xSTATIC_TIMER))
	);
	assert_eq!(
	           ::core::mem::align_of::<xSTATIC_TIMER>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xSTATIC_TIMER))
	);
	fn test_field_pvDummy1() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TIMER>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvDummy1) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TIMER), "::", stringify!(pvDummy1))
		);
	}
	test_field_pvDummy1();
	fn test_field_xDummy2() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TIMER>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xDummy2) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TIMER), "::", stringify!(xDummy2))
		);
	}
	test_field_xDummy2();
	fn test_field_xDummy3() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TIMER>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xDummy3) as usize - ptr as usize
		           },
		           24usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TIMER), "::", stringify!(xDummy3))
		);
	}
	test_field_xDummy3();
	fn test_field_pvDummy5() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TIMER>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvDummy5) as usize - ptr as usize
		           },
		           28usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TIMER), "::", stringify!(pvDummy5))
		);
	}
	test_field_pvDummy5();
	fn test_field_pvDummy6() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TIMER>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvDummy6) as usize - ptr as usize
		           },
		           32usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TIMER), "::", stringify!(pvDummy6))
		);
	}
	test_field_pvDummy6();
	fn test_field_uxDummy7() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TIMER>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxDummy7) as usize - ptr as usize
		           },
		           36usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TIMER), "::", stringify!(uxDummy7))
		);
	}
	test_field_uxDummy7();
	fn test_field_ucDummy8() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_TIMER>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ucDummy8) as usize - ptr as usize
		           },
		           40usize,
		           concat!("Offset of field: ", stringify!(xSTATIC_TIMER), "::", stringify!(ucDummy8))
		);
	}
	test_field_ucDummy8();
}
pub type StaticTimer_t = xSTATIC_TIMER;
#[repr(C)]
pub struct xSTATIC_STREAM_BUFFER {
	pub uxDummy1: [usize; 4usize],
	pub pvDummy2: [*mut core::ffi::c_void; 3usize],
	pub ucDummy3: u8,
	pub uxDummy4: UBaseType_t,
}
#[test]
fn bindgen_test_layout_xSTATIC_STREAM_BUFFER() {
	assert_eq!(
	           ::core::mem::size_of::<xSTATIC_STREAM_BUFFER>(),
	           36usize,
	           concat!("Size of: ", stringify!(xSTATIC_STREAM_BUFFER))
	);
	assert_eq!(
	           ::core::mem::align_of::<xSTATIC_STREAM_BUFFER>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xSTATIC_STREAM_BUFFER))
	);
	fn test_field_uxDummy1() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_STREAM_BUFFER>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxDummy1) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(xSTATIC_STREAM_BUFFER),
			"::",
			stringify!(uxDummy1)
		)
		);
	}
	test_field_uxDummy1();
	fn test_field_pvDummy2() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_STREAM_BUFFER>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvDummy2) as usize - ptr as usize
		           },
		           16usize,
		           concat!(
			"Offset of field: ",
			stringify!(xSTATIC_STREAM_BUFFER),
			"::",
			stringify!(pvDummy2)
		)
		);
	}
	test_field_pvDummy2();
	fn test_field_ucDummy3() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_STREAM_BUFFER>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ucDummy3) as usize - ptr as usize
		           },
		           28usize,
		           concat!(
			"Offset of field: ",
			stringify!(xSTATIC_STREAM_BUFFER),
			"::",
			stringify!(ucDummy3)
		)
		);
	}
	test_field_ucDummy3();
	fn test_field_uxDummy4() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xSTATIC_STREAM_BUFFER>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxDummy4) as usize - ptr as usize
		           },
		           32usize,
		           concat!(
			"Offset of field: ",
			stringify!(xSTATIC_STREAM_BUFFER),
			"::",
			stringify!(uxDummy4)
		)
		);
	}
	test_field_uxDummy4();
}
pub type StaticStreamBuffer_t = xSTATIC_STREAM_BUFFER;
pub type StaticMessageBuffer_t = StaticStreamBuffer_t;
#[repr(C)]
pub struct xLIST_ITEM {
	pub xItemValue: TickType_t,
	pub pxNext: *mut xLIST_ITEM,
	pub pxPrevious: *mut xLIST_ITEM,
	pub pvOwner: *mut core::ffi::c_void,
	pub pxContainer: *mut xLIST,
}
#[test]
fn bindgen_test_layout_xLIST_ITEM() {
	assert_eq!(
	           ::core::mem::size_of::<xLIST_ITEM>(),
	           20usize,
	           concat!("Size of: ", stringify!(xLIST_ITEM))
	);
	assert_eq!(
	           ::core::mem::align_of::<xLIST_ITEM>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xLIST_ITEM))
	);
	fn test_field_xItemValue() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xLIST_ITEM>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xItemValue) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(xLIST_ITEM), "::", stringify!(xItemValue))
		);
	}
	test_field_xItemValue();
	fn test_field_pxNext() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xLIST_ITEM>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pxNext) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(xLIST_ITEM), "::", stringify!(pxNext))
		);
	}
	test_field_pxNext();
	fn test_field_pxPrevious() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xLIST_ITEM>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pxPrevious) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(xLIST_ITEM), "::", stringify!(pxPrevious))
		);
	}
	test_field_pxPrevious();
	fn test_field_pvOwner() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xLIST_ITEM>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvOwner) as usize - ptr as usize
		           },
		           12usize,
		           concat!("Offset of field: ", stringify!(xLIST_ITEM), "::", stringify!(pvOwner))
		);
	}
	test_field_pvOwner();
	fn test_field_pxContainer() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xLIST_ITEM>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pxContainer) as usize - ptr as usize
		           },
		           16usize,
		           concat!("Offset of field: ", stringify!(xLIST_ITEM), "::", stringify!(pxContainer))
		);
	}
	test_field_pxContainer();
}
pub type ListItem_t = xLIST_ITEM;
#[repr(C)]
pub struct xMINI_LIST_ITEM {
	pub xItemValue: TickType_t,
	pub pxNext: *mut xLIST_ITEM,
	pub pxPrevious: *mut xLIST_ITEM,
}
#[test]
fn bindgen_test_layout_xMINI_LIST_ITEM() {
	assert_eq!(
	           ::core::mem::size_of::<xMINI_LIST_ITEM>(),
	           12usize,
	           concat!("Size of: ", stringify!(xMINI_LIST_ITEM))
	);
	assert_eq!(
	           ::core::mem::align_of::<xMINI_LIST_ITEM>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xMINI_LIST_ITEM))
	);
	fn test_field_xItemValue() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xMINI_LIST_ITEM>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xItemValue) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(xMINI_LIST_ITEM), "::", stringify!(xItemValue))
		);
	}
	test_field_xItemValue();
	fn test_field_pxNext() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xMINI_LIST_ITEM>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pxNext) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(xMINI_LIST_ITEM), "::", stringify!(pxNext))
		);
	}
	test_field_pxNext();
	fn test_field_pxPrevious() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xMINI_LIST_ITEM>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pxPrevious) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(xMINI_LIST_ITEM), "::", stringify!(pxPrevious))
		);
	}
	test_field_pxPrevious();
}
pub type MiniListItem_t = xMINI_LIST_ITEM;
#[repr(C)]
pub struct xLIST {
	pub uxNumberOfItems: UBaseType_t,
	pub pxIndex: *mut ListItem_t,
	pub xListEnd: MiniListItem_t,
}
#[test]
fn bindgen_test_layout_xLIST() {
	assert_eq!(
	           ::core::mem::size_of::<xLIST>(),
	           20usize,
	           concat!("Size of: ", stringify!(xLIST))
	);
	assert_eq!(
	           ::core::mem::align_of::<xLIST>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xLIST))
	);
	fn test_field_uxNumberOfItems() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xLIST>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxNumberOfItems) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(xLIST), "::", stringify!(uxNumberOfItems))
		);
	}
	test_field_uxNumberOfItems();
	fn test_field_pxIndex() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xLIST>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pxIndex) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(xLIST), "::", stringify!(pxIndex))
		);
	}
	test_field_pxIndex();
	fn test_field_xListEnd() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xLIST>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xListEnd) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(xLIST), "::", stringify!(xListEnd))
		);
	}
	test_field_xListEnd();
}
pub type List_t = xLIST;
extern "C" {
	pub fn vListInitialise(pxList: *mut List_t);
}
extern "C" {
	pub fn vListInitialiseItem(pxItem: *mut ListItem_t);
}
extern "C" {
	pub fn vListInsert(pxList: *mut List_t, pxNewListItem: *mut ListItem_t);
}
extern "C" {
	pub fn vListInsertEnd(pxList: *mut List_t, pxNewListItem: *mut ListItem_t);
}
extern "C" {
	pub fn uxListRemove(pxItemToRemove: *mut ListItem_t) -> UBaseType_t;
}
#[doc = " task. h"]
#[doc = ""]
#[doc = " Type by which tasks are referenced.  For example, a call to xTaskCreate"]
#[doc = " returns (via a pointer parameter) an TaskHandle_t variable that can then"]
#[doc = " be used as a parameter to vTaskDelete to delete the task."]
#[doc = ""]
#[doc = " \\defgroup TaskHandle_t TaskHandle_t"]
#[doc = " \\ingroup Tasks"]
#[repr(C)]
pub struct tskTaskControlBlock {
	_unused: [u8; 0],
}
pub type TaskHandle_t = *mut tskTaskControlBlock;
pub type TaskHookFunction_t = ::core::option::Option<unsafe extern "C" fn(arg1: *mut core::ffi::c_void) -> BaseType_t>;
#[repr(u32)]
#[non_exhaustive]
#[derive(Clone, Hash, PartialEq, Eq)]
pub enum eTaskState {
	eRunning = 0,
	eReady = 1,
	eBlocked = 2,
	eSuspended = 3,
	eDeleted = 4,
	eInvalid = 5,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Clone, Hash, PartialEq, Eq)]
pub enum eNotifyAction {
	eNoAction = 0,
	eSetBits = 1,
	eIncrement = 2,
	eSetValueWithOverwrite = 3,
	eSetValueWithoutOverwrite = 4,
}
#[repr(C)]
pub struct xTIME_OUT {
	pub xOverflowCount: BaseType_t,
	pub xTimeOnEntering: TickType_t,
}
#[test]
fn bindgen_test_layout_xTIME_OUT() {
	assert_eq!(
	           ::core::mem::size_of::<xTIME_OUT>(),
	           8usize,
	           concat!("Size of: ", stringify!(xTIME_OUT))
	);
	assert_eq!(
	           ::core::mem::align_of::<xTIME_OUT>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xTIME_OUT))
	);
	fn test_field_xOverflowCount() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTIME_OUT>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xOverflowCount) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(xTIME_OUT), "::", stringify!(xOverflowCount))
		);
	}
	test_field_xOverflowCount();
	fn test_field_xTimeOnEntering() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTIME_OUT>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xTimeOnEntering) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(xTIME_OUT), "::", stringify!(xTimeOnEntering))
		);
	}
	test_field_xTimeOnEntering();
}
pub type TimeOut_t = xTIME_OUT;
#[repr(C)]
pub struct xMEMORY_REGION {
	pub pvBaseAddress: *mut core::ffi::c_void,
	pub ulLengthInBytes: u32,
	pub ulParameters: u32,
}
#[test]
fn bindgen_test_layout_xMEMORY_REGION() {
	assert_eq!(
	           ::core::mem::size_of::<xMEMORY_REGION>(),
	           12usize,
	           concat!("Size of: ", stringify!(xMEMORY_REGION))
	);
	assert_eq!(
	           ::core::mem::align_of::<xMEMORY_REGION>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xMEMORY_REGION))
	);
	fn test_field_pvBaseAddress() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xMEMORY_REGION>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvBaseAddress) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(xMEMORY_REGION),
			"::",
			stringify!(pvBaseAddress)
		)
		);
	}
	test_field_pvBaseAddress();
	fn test_field_ulLengthInBytes() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xMEMORY_REGION>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ulLengthInBytes) as usize - ptr as usize
		           },
		           4usize,
		           concat!(
			"Offset of field: ",
			stringify!(xMEMORY_REGION),
			"::",
			stringify!(ulLengthInBytes)
		)
		);
	}
	test_field_ulLengthInBytes();
	fn test_field_ulParameters() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xMEMORY_REGION>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ulParameters) as usize - ptr as usize
		           },
		           8usize,
		           concat!(
			"Offset of field: ",
			stringify!(xMEMORY_REGION),
			"::",
			stringify!(ulParameters)
		)
		);
	}
	test_field_ulParameters();
}
pub type MemoryRegion_t = xMEMORY_REGION;
#[repr(C)]
pub struct xTASK_PARAMETERS {
	pub pvTaskCode: TaskFunction_t,
	pub pcName: *const core::ffi::c_char,
	pub usStackDepth: u16,
	pub pvParameters: *mut core::ffi::c_void,
	pub uxPriority: UBaseType_t,
	pub puxStackBuffer: *mut StackType_t,
	pub xRegions: [MemoryRegion_t; 1usize],
}
#[test]
fn bindgen_test_layout_xTASK_PARAMETERS() {
	assert_eq!(
	           ::core::mem::size_of::<xTASK_PARAMETERS>(),
	           36usize,
	           concat!("Size of: ", stringify!(xTASK_PARAMETERS))
	);
	assert_eq!(
	           ::core::mem::align_of::<xTASK_PARAMETERS>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xTASK_PARAMETERS))
	);
	fn test_field_pvTaskCode() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_PARAMETERS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvTaskCode) as usize - ptr as usize
		           },
		           0usize,
		           concat!(
			"Offset of field: ",
			stringify!(xTASK_PARAMETERS),
			"::",
			stringify!(pvTaskCode)
		)
		);
	}
	test_field_pvTaskCode();
	fn test_field_pcName() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_PARAMETERS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pcName) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(xTASK_PARAMETERS), "::", stringify!(pcName))
		);
	}
	test_field_pcName();
	fn test_field_usStackDepth() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_PARAMETERS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).usStackDepth) as usize - ptr as usize
		           },
		           8usize,
		           concat!(
			"Offset of field: ",
			stringify!(xTASK_PARAMETERS),
			"::",
			stringify!(usStackDepth)
		)
		);
	}
	test_field_usStackDepth();
	fn test_field_pvParameters() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_PARAMETERS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pvParameters) as usize - ptr as usize
		           },
		           12usize,
		           concat!(
			"Offset of field: ",
			stringify!(xTASK_PARAMETERS),
			"::",
			stringify!(pvParameters)
		)
		);
	}
	test_field_pvParameters();
	fn test_field_uxPriority() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_PARAMETERS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxPriority) as usize - ptr as usize
		           },
		           16usize,
		           concat!(
			"Offset of field: ",
			stringify!(xTASK_PARAMETERS),
			"::",
			stringify!(uxPriority)
		)
		);
	}
	test_field_uxPriority();
	fn test_field_puxStackBuffer() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_PARAMETERS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).puxStackBuffer) as usize - ptr as usize
		           },
		           20usize,
		           concat!(
			"Offset of field: ",
			stringify!(xTASK_PARAMETERS),
			"::",
			stringify!(puxStackBuffer)
		)
		);
	}
	test_field_puxStackBuffer();
	fn test_field_xRegions() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_PARAMETERS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xRegions) as usize - ptr as usize
		           },
		           24usize,
		           concat!("Offset of field: ", stringify!(xTASK_PARAMETERS), "::", stringify!(xRegions))
		);
	}
	test_field_xRegions();
}
pub type TaskParameters_t = xTASK_PARAMETERS;
#[repr(C)]
pub struct xTASK_STATUS {
	pub xHandle: TaskHandle_t,
	pub pcTaskName: *const core::ffi::c_char,
	pub xTaskNumber: UBaseType_t,
	pub eCurrentState: eTaskState,
	pub uxCurrentPriority: UBaseType_t,
	pub uxBasePriority: UBaseType_t,
	pub ulRunTimeCounter: u32,
	pub pxStackBase: *mut StackType_t,
	pub usStackHighWaterMark: u16,
}
#[test]
fn bindgen_test_layout_xTASK_STATUS() {
	assert_eq!(
	           ::core::mem::size_of::<xTASK_STATUS>(),
	           36usize,
	           concat!("Size of: ", stringify!(xTASK_STATUS))
	);
	assert_eq!(
	           ::core::mem::align_of::<xTASK_STATUS>(),
	           4usize,
	           concat!("Alignment of ", stringify!(xTASK_STATUS))
	);
	fn test_field_xHandle() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_STATUS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xHandle) as usize - ptr as usize
		           },
		           0usize,
		           concat!("Offset of field: ", stringify!(xTASK_STATUS), "::", stringify!(xHandle))
		);
	}
	test_field_xHandle();
	fn test_field_pcTaskName() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_STATUS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pcTaskName) as usize - ptr as usize
		           },
		           4usize,
		           concat!("Offset of field: ", stringify!(xTASK_STATUS), "::", stringify!(pcTaskName))
		);
	}
	test_field_pcTaskName();
	fn test_field_xTaskNumber() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_STATUS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).xTaskNumber) as usize - ptr as usize
		           },
		           8usize,
		           concat!("Offset of field: ", stringify!(xTASK_STATUS), "::", stringify!(xTaskNumber))
		);
	}
	test_field_xTaskNumber();
	fn test_field_eCurrentState() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_STATUS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).eCurrentState) as usize - ptr as usize
		           },
		           12usize,
		           concat!("Offset of field: ", stringify!(xTASK_STATUS), "::", stringify!(eCurrentState))
		);
	}
	test_field_eCurrentState();
	fn test_field_uxCurrentPriority() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_STATUS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxCurrentPriority) as usize - ptr as usize
		           },
		           16usize,
		           concat!(
			"Offset of field: ",
			stringify!(xTASK_STATUS),
			"::",
			stringify!(uxCurrentPriority)
		)
		);
	}
	test_field_uxCurrentPriority();
	fn test_field_uxBasePriority() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_STATUS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).uxBasePriority) as usize - ptr as usize
		           },
		           20usize,
		           concat!(
			"Offset of field: ",
			stringify!(xTASK_STATUS),
			"::",
			stringify!(uxBasePriority)
		)
		);
	}
	test_field_uxBasePriority();
	fn test_field_ulRunTimeCounter() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_STATUS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).ulRunTimeCounter) as usize - ptr as usize
		           },
		           24usize,
		           concat!(
			"Offset of field: ",
			stringify!(xTASK_STATUS),
			"::",
			stringify!(ulRunTimeCounter)
		)
		);
	}
	test_field_ulRunTimeCounter();
	fn test_field_pxStackBase() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_STATUS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).pxStackBase) as usize - ptr as usize
		           },
		           28usize,
		           concat!("Offset of field: ", stringify!(xTASK_STATUS), "::", stringify!(pxStackBase))
		);
	}
	test_field_pxStackBase();
	fn test_field_usStackHighWaterMark() {
		assert_eq!(
		           unsafe {
			           let uninit = ::core::mem::MaybeUninit::<xTASK_STATUS>::uninit();
			           let ptr = uninit.as_ptr();
			           ::core::ptr::addr_of!((*ptr).usStackHighWaterMark) as usize - ptr as usize
		           },
		           32usize,
		           concat!(
			"Offset of field: ",
			stringify!(xTASK_STATUS),
			"::",
			stringify!(usStackHighWaterMark)
		)
		);
	}
	test_field_usStackHighWaterMark();
}
pub type TaskStatus_t = xTASK_STATUS;
#[repr(u32)]
#[non_exhaustive]
#[derive(Clone, Hash, PartialEq, Eq)]
pub enum eSleepModeStatus {
	eAbortSleep = 0,
	eStandardSleep = 1,
	eNoTasksWaitingTimeout = 2,
}
extern "C" {
	pub fn xTaskCreate(pxTaskCode: TaskFunction_t,
	                   pcName: *const core::ffi::c_char,
	                   usStackDepth: u16,
	                   pvParameters: *mut core::ffi::c_void,
	                   uxPriority: UBaseType_t,
	                   pxCreatedTask: *mut TaskHandle_t)
	                   -> BaseType_t;
}
extern "C" {
	pub fn xTaskCreateStatic(pxTaskCode: TaskFunction_t,
	                         pcName: *const core::ffi::c_char,
	                         ulStackDepth: u32,
	                         pvParameters: *mut core::ffi::c_void,
	                         uxPriority: UBaseType_t,
	                         puxStackBuffer: *mut StackType_t,
	                         pxTaskBuffer: *mut StaticTask_t)
	                         -> TaskHandle_t;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskAllocateMPURegions( TaskHandle_t xTask, const MemoryRegion_t * const pxRegions );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " Memory regions are assigned to a restricted task when the task is created by"]
	#[doc = " a call to xTaskCreateRestricted().  These regions can be redefined using"]
	#[doc = " vTaskAllocateMPURegions()."]
	#[doc = ""]
	#[doc = " @param xTask The handle of the task being updated."]
	#[doc = ""]
	#[doc = " @param xRegions A pointer to a MemoryRegion_t structure that contains the"]
	#[doc = " new memory region definitions."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = " // Define an array of MemoryRegion_t structures that configures an MPU region"]
	#[doc = " // allowing read/write access for 1024 bytes starting at the beginning of the"]
	#[doc = " // ucOneKByte array.  The other two of the maximum 3 definable regions are"]
	#[doc = " // unused so set to zero."]
	#[doc = " static const MemoryRegion_t xAltRegions[ portNUM_CONFIGURABLE_REGIONS ] ="]
	#[doc = " {"]
	#[doc = "  // Base address     Length      Parameters"]
	#[doc = "  { ucOneKByte,       1024,       portMPU_REGION_READ_WRITE },"]
	#[doc = "  { 0,                0,          0 },"]
	#[doc = "  { 0,                0,          0 }"]
	#[doc = " };"]
	#[doc = ""]
	#[doc = " void vATask( void *pvParameters )"]
	#[doc = " {"]
	#[doc = "  // This task was created such that it has access to certain regions of"]
	#[doc = "  // memory as defined by the MPU configuration.  At some point it is"]
	#[doc = "  // desired that these MPU regions are replaced with that defined in the"]
	#[doc = "  // xAltRegions const struct above.  Use a call to vTaskAllocateMPURegions()"]
	#[doc = "  // for this purpose.  NULL is used as the task handle to indicate that this"]
	#[doc = "  // function should modify the MPU regions of the calling task."]
	#[doc = "  vTaskAllocateMPURegions( NULL, xAltRegions );"]
	#[doc = ""]
	#[doc = "  // Now the task can continue its function, but from this point on can only"]
	#[doc = "  // access its stack and the ucOneKByte array (unless any other statically"]
	#[doc = "  // defined or shared regions have been declared elsewhere)."]
	#[doc = " }"]
	#[doc = " @endcode"]
	#[doc = " \\defgroup xTaskCreateRestricted xTaskCreateRestricted"]
	#[doc = " \\ingroup Tasks"]
	pub fn vTaskAllocateMPURegions(xTask: TaskHandle_t, pxRegions: *const MemoryRegion_t);
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskDelete( TaskHandle_t xTaskToDelete );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " INCLUDE_vTaskDelete must be defined as 1 for this function to be available."]
	#[doc = " See the configuration section for more information."]
	#[doc = ""]
	#[doc = " Remove a task from the RTOS real time kernel's management.  The task being"]
	#[doc = " deleted will be removed from all ready, blocked, suspended and event lists."]
	#[doc = ""]
	#[doc = " NOTE:  The idle task is responsible for freeing the kernel allocated"]
	#[doc = " memory from tasks that have been deleted.  It is therefore important that"]
	#[doc = " the idle task is not starved of microcontroller processing time if your"]
	#[doc = " application makes any calls to vTaskDelete ().  Memory allocated by the"]
	#[doc = " task code is not automatically freed, and should be freed before the task"]
	#[doc = " is deleted."]
	#[doc = ""]
	#[doc = " See the demo application file death.c for sample code that utilises"]
	#[doc = " vTaskDelete ()."]
	#[doc = ""]
	#[doc = " @param xTaskToDelete The handle of the task to be deleted.  Passing NULL will"]
	#[doc = " cause the calling task to be deleted."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = " void vOtherFunction( void )"]
	#[doc = " {"]
	#[doc = " TaskHandle_t xHandle;"]
	#[doc = ""]
	#[doc = "   // Create the task, storing the handle."]
	#[doc = "   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, &xHandle );"]
	#[doc = ""]
	#[doc = "   // Use the handle to delete the task."]
	#[doc = "   vTaskDelete( xHandle );"]
	#[doc = " }"]
	#[doc = " @endcode"]
	#[doc = " \\defgroup vTaskDelete vTaskDelete"]
	#[doc = " \\ingroup Tasks"]
	pub fn vTaskDelete(xTaskToDelete: TaskHandle_t);
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskDelay( const TickType_t xTicksToDelay );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " Delay a task for a given number of ticks.  The actual time that the"]
	#[doc = " task remains blocked depends on the tick rate.  The constant"]
	#[doc = " portTICK_PERIOD_MS can be used to calculate real time from the tick"]
	#[doc = " rate - with the resolution of one tick period."]
	#[doc = ""]
	#[doc = " INCLUDE_vTaskDelay must be defined as 1 for this function to be available."]
	#[doc = " See the configuration section for more information."]
	#[doc = ""]
	#[doc = ""]
	#[doc = " vTaskDelay() specifies a time at which the task wishes to unblock relative to"]
	#[doc = " the time at which vTaskDelay() is called.  For example, specifying a block"]
	#[doc = " period of 100 ticks will cause the task to unblock 100 ticks after"]
	#[doc = " vTaskDelay() is called.  vTaskDelay() does not therefore provide a good method"]
	#[doc = " of controlling the frequency of a periodic task as the path taken through the"]
	#[doc = " code, as well as other task and interrupt activity, will affect the frequency"]
	#[doc = " at which vTaskDelay() gets called and therefore the time at which the task"]
	#[doc = " next executes.  See xTaskDelayUntil() for an alternative API function designed"]
	#[doc = " to facilitate fixed frequency execution.  It does this by specifying an"]
	#[doc = " absolute time (rather than a relative time) at which the calling task should"]
	#[doc = " unblock."]
	#[doc = ""]
	#[doc = " @param xTicksToDelay The amount of time, in tick periods, that"]
	#[doc = " the calling task should block."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = ""]
	#[doc = " void vTaskFunction( void * pvParameters )"]
	#[doc = " {"]
	#[doc = " // Block for 500ms."]
	#[doc = " const TickType_t xDelay = 500 / portTICK_PERIOD_MS;"]
	#[doc = ""]
	#[doc = "   for( ;; )"]
	#[doc = "   {"]
	#[doc = "       // Simply toggle the LED every 500ms, blocking between each toggle."]
	#[doc = "       vToggleLED();"]
	#[doc = "       vTaskDelay( xDelay );"]
	#[doc = "   }"]
	#[doc = " }"]
	#[doc = ""]
	#[doc = " \\defgroup vTaskDelay vTaskDelay"]
	#[doc = " \\ingroup TaskCtrl"]
	pub fn vTaskDelay(xTicksToDelay: TickType_t);
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " BaseType_t xTaskDelayUntil( TickType_t *pxPreviousWakeTime, const TickType_t xTimeIncrement );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " INCLUDE_xTaskDelayUntil must be defined as 1 for this function to be available."]
	#[doc = " See the configuration section for more information."]
	#[doc = ""]
	#[doc = " Delay a task until a specified time.  This function can be used by periodic"]
	#[doc = " tasks to ensure a constant execution frequency."]
	#[doc = ""]
	#[doc = " This function differs from vTaskDelay () in one important aspect:  vTaskDelay () will"]
	#[doc = " cause a task to block for the specified number of ticks from the time vTaskDelay () is"]
	#[doc = " called.  It is therefore difficult to use vTaskDelay () by itself to generate a fixed"]
	#[doc = " execution frequency as the time between a task starting to execute and that task"]
	#[doc = " calling vTaskDelay () may not be fixed [the task may take a different path though the"]
	#[doc = " code between calls, or may get interrupted or preempted a different number of times"]
	#[doc = " each time it executes]."]
	#[doc = ""]
	#[doc = " Whereas vTaskDelay () specifies a wake time relative to the time at which the function"]
	#[doc = " is called, xTaskDelayUntil () specifies the absolute (exact) time at which it wishes to"]
	#[doc = " unblock."]
	#[doc = ""]
	#[doc = " The macro pdMS_TO_TICKS() can be used to calculate the number of ticks from a"]
	#[doc = " time specified in milliseconds with a resolution of one tick period."]
	#[doc = ""]
	#[doc = " @param pxPreviousWakeTime Pointer to a variable that holds the time at which the"]
	#[doc = " task was last unblocked.  The variable must be initialised with the current time"]
	#[doc = " prior to its first use (see the example below).  Following this the variable is"]
	#[doc = " automatically updated within xTaskDelayUntil ()."]
	#[doc = ""]
	#[doc = " @param xTimeIncrement The cycle time period.  The task will be unblocked at"]
	#[doc = " time *pxPreviousWakeTime + xTimeIncrement.  Calling xTaskDelayUntil with the"]
	#[doc = " same xTimeIncrement parameter value will cause the task to execute with"]
	#[doc = " a fixed interface period."]
	#[doc = ""]
	#[doc = " @return Value which can be used to check whether the task was actually delayed."]
	#[doc = " Will be pdTRUE if the task way delayed and pdFALSE otherwise.  A task will not"]
	#[doc = " be delayed if the next expected wake time is in the past."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = " // Perform an action every 10 ticks."]
	#[doc = " void vTaskFunction( void * pvParameters )"]
	#[doc = " {"]
	#[doc = " TickType_t xLastWakeTime;"]
	#[doc = " const TickType_t xFrequency = 10;"]
	#[doc = " BaseType_t xWasDelayed;"]
	#[doc = ""]
	#[doc = "     // Initialise the xLastWakeTime variable with the current time."]
	#[doc = "     xLastWakeTime = xTaskGetTickCount ();"]
	#[doc = "     for( ;; )"]
	#[doc = "     {"]
	#[doc = "         // Wait for the next cycle."]
	#[doc = "         xWasDelayed = xTaskDelayUntil( &xLastWakeTime, xFrequency );"]
	#[doc = ""]
	#[doc = "         // Perform action here. xWasDelayed value can be used to determine"]
	#[doc = "         // whether a deadline was missed if the code here took too long."]
	#[doc = "     }"]
	#[doc = " }"]
	#[doc = " @endcode"]
	#[doc = " \\defgroup xTaskDelayUntil xTaskDelayUntil"]
	#[doc = " \\ingroup TaskCtrl"]
	pub fn xTaskDelayUntil(pxPreviousWakeTime: *mut TickType_t, xTimeIncrement: TickType_t) -> BaseType_t;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " BaseType_t xTaskAbortDelay( TaskHandle_t xTask );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " INCLUDE_xTaskAbortDelay must be defined as 1 in FreeRTOSConfig.h for this"]
	#[doc = " function to be available."]
	#[doc = ""]
	#[doc = " A task will enter the Blocked state when it is waiting for an event.  The"]
	#[doc = " event it is waiting for can be a temporal event (waiting for a time), such"]
	#[doc = " as when vTaskDelay() is called, or an event on an object, such as when"]
	#[doc = " xQueueReceive() or ulTaskNotifyTake() is called.  If the handle of a task"]
	#[doc = " that is in the Blocked state is used in a call to xTaskAbortDelay() then the"]
	#[doc = " task will leave the Blocked state, and return from whichever function call"]
	#[doc = " placed the task into the Blocked state."]
	#[doc = ""]
	#[doc = " There is no 'FromISR' version of this function as an interrupt would need to"]
	#[doc = " know which object a task was blocked on in order to know which actions to"]
	#[doc = " take.  For example, if the task was blocked on a queue the interrupt handler"]
	#[doc = " would then need to know if the queue was locked."]
	#[doc = ""]
	#[doc = " @param xTask The handle of the task to remove from the Blocked state."]
	#[doc = ""]
	#[doc = " @return If the task referenced by xTask was not in the Blocked state then"]
	#[doc = " pdFAIL is returned.  Otherwise pdPASS is returned."]
	#[doc = ""]
	#[doc = " \\defgroup xTaskAbortDelay xTaskAbortDelay"]
	#[doc = " \\ingroup TaskCtrl"]
	pub fn xTaskAbortDelay(xTask: TaskHandle_t) -> BaseType_t;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " UBaseType_t uxTaskPriorityGet( const TaskHandle_t xTask );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " INCLUDE_uxTaskPriorityGet must be defined as 1 for this function to be available."]
	#[doc = " See the configuration section for more information."]
	#[doc = ""]
	#[doc = " Obtain the priority of any task."]
	#[doc = ""]
	#[doc = " @param xTask Handle of the task to be queried.  Passing a NULL"]
	#[doc = " handle results in the priority of the calling task being returned."]
	#[doc = ""]
	#[doc = " @return The priority of xTask."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = " void vAFunction( void )"]
	#[doc = " {"]
	#[doc = " TaskHandle_t xHandle;"]
	#[doc = ""]
	#[doc = "   // Create a task, storing the handle."]
	#[doc = "   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, &xHandle );"]
	#[doc = ""]
	#[doc = "   // ..."]
	#[doc = ""]
	#[doc = "   // Use the handle to obtain the priority of the created task."]
	#[doc = "   // It was created with tskIDLE_PRIORITY, but may have changed"]
	#[doc = "   // it itself."]
	#[doc = "   if( uxTaskPriorityGet( xHandle ) != tskIDLE_PRIORITY )"]
	#[doc = "   {"]
	#[doc = "       // The task has changed it's priority."]
	#[doc = "   }"]
	#[doc = ""]
	#[doc = "   // ..."]
	#[doc = ""]
	#[doc = "   // Is our priority higher than the created task?"]
	#[doc = "   if( uxTaskPriorityGet( xHandle ) < uxTaskPriorityGet( NULL ) )"]
	#[doc = "   {"]
	#[doc = "       // Our priority (obtained using NULL handle) is higher."]
	#[doc = "   }"]
	#[doc = " }"]
	#[doc = " @endcode"]
	#[doc = " \\defgroup uxTaskPriorityGet uxTaskPriorityGet"]
	#[doc = " \\ingroup TaskCtrl"]
	pub fn uxTaskPriorityGet(xTask: TaskHandle_t) -> UBaseType_t;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " UBaseType_t uxTaskPriorityGetFromISR( const TaskHandle_t xTask );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " A version of uxTaskPriorityGet() that can be used from an ISR."]
	pub fn uxTaskPriorityGetFromISR(xTask: TaskHandle_t) -> UBaseType_t;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " eTaskState eTaskGetState( TaskHandle_t xTask );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " INCLUDE_eTaskGetState must be defined as 1 for this function to be available."]
	#[doc = " See the configuration section for more information."]
	#[doc = ""]
	#[doc = " Obtain the state of any task.  States are encoded by the eTaskState"]
	#[doc = " enumerated type."]
	#[doc = ""]
	#[doc = " @param xTask Handle of the task to be queried."]
	#[doc = ""]
	#[doc = " @return The state of xTask at the time the function was called.  Note the"]
	#[doc = " state of the task might change between the function being called, and the"]
	#[doc = " functions return value being tested by the calling task."]
	pub fn eTaskGetState(xTask: TaskHandle_t) -> eTaskState;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskGetInfo( TaskHandle_t xTask, TaskStatus_t *pxTaskStatus, BaseType_t xGetFreeStackSpace, eTaskState eState );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " configUSE_TRACE_FACILITY must be defined as 1 for this function to be"]
	#[doc = " available.  See the configuration section for more information."]
	#[doc = ""]
	#[doc = " Populates a TaskStatus_t structure with information about a task."]
	#[doc = ""]
	#[doc = " @param xTask Handle of the task being queried.  If xTask is NULL then"]
	#[doc = " information will be returned about the calling task."]
	#[doc = ""]
	#[doc = " @param pxTaskStatus A pointer to the TaskStatus_t structure that will be"]
	#[doc = " filled with information about the task referenced by the handle passed using"]
	#[doc = " the xTask parameter."]
	#[doc = ""]
	#[doc = " @xGetFreeStackSpace The TaskStatus_t structure contains a member to report"]
	#[doc = " the stack high water mark of the task being queried.  Calculating the stack"]
	#[doc = " high water mark takes a relatively long time, and can make the system"]
	#[doc = " temporarily unresponsive - so the xGetFreeStackSpace parameter is provided to"]
	#[doc = " allow the high water mark checking to be skipped.  The high watermark value"]
	#[doc = " will only be written to the TaskStatus_t structure if xGetFreeStackSpace is"]
	#[doc = " not set to pdFALSE;"]
	#[doc = ""]
	#[doc = " @param eState The TaskStatus_t structure contains a member to report the"]
	#[doc = " state of the task being queried.  Obtaining the task state is not as fast as"]
	#[doc = " a simple assignment - so the eState parameter is provided to allow the state"]
	#[doc = " information to be omitted from the TaskStatus_t structure.  To obtain state"]
	#[doc = " information then set eState to eInvalid - otherwise the value passed in"]
	#[doc = " eState will be reported as the task state in the TaskStatus_t structure."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = " void vAFunction( void )"]
	#[doc = " {"]
	#[doc = " TaskHandle_t xHandle;"]
	#[doc = " TaskStatus_t xTaskDetails;"]
	#[doc = ""]
	#[doc = "  // Obtain the handle of a task from its name."]
	#[doc = "  xHandle = xTaskGetHandle( \"Task_Name\" );"]
	#[doc = ""]
	#[doc = "  // Check the handle is not NULL."]
	#[doc = "  configASSERT( xHandle );"]
	#[doc = ""]
	#[doc = "  // Use the handle to obtain further information about the task."]
	#[doc = "  vTaskGetInfo( xHandle,"]
	#[doc = "                &xTaskDetails,"]
	#[doc = "                pdTRUE, // Include the high water mark in xTaskDetails."]
	#[doc = "                eInvalid ); // Include the task state in xTaskDetails."]
	#[doc = " }"]
	#[doc = " @endcode"]
	#[doc = " \\defgroup vTaskGetInfo vTaskGetInfo"]
	#[doc = " \\ingroup TaskCtrl"]
	pub fn vTaskGetInfo(xTask: TaskHandle_t, pxTaskStatus: *mut TaskStatus_t, xGetFreeStackSpace: BaseType_t, eState: eTaskState);
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskPrioritySet( TaskHandle_t xTask, UBaseType_t uxNewPriority );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " INCLUDE_vTaskPrioritySet must be defined as 1 for this function to be available."]
	#[doc = " See the configuration section for more information."]
	#[doc = ""]
	#[doc = " Set the priority of any task."]
	#[doc = ""]
	#[doc = " A context switch will occur before the function returns if the priority"]
	#[doc = " being set is higher than the currently executing task."]
	#[doc = ""]
	#[doc = " @param xTask Handle to the task for which the priority is being set."]
	#[doc = " Passing a NULL handle results in the priority of the calling task being set."]
	#[doc = ""]
	#[doc = " @param uxNewPriority The priority to which the task will be set."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = " void vAFunction( void )"]
	#[doc = " {"]
	#[doc = " TaskHandle_t xHandle;"]
	#[doc = ""]
	#[doc = "   // Create a task, storing the handle."]
	#[doc = "   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, &xHandle );"]
	#[doc = ""]
	#[doc = "   // ..."]
	#[doc = ""]
	#[doc = "   // Use the handle to raise the priority of the created task."]
	#[doc = "   vTaskPrioritySet( xHandle, tskIDLE_PRIORITY + 1 );"]
	#[doc = ""]
	#[doc = "   // ..."]
	#[doc = ""]
	#[doc = "   // Use a NULL handle to raise our priority to the same value."]
	#[doc = "   vTaskPrioritySet( NULL, tskIDLE_PRIORITY + 1 );"]
	#[doc = " }"]
	#[doc = " @endcode"]
	#[doc = " \\defgroup vTaskPrioritySet vTaskPrioritySet"]
	#[doc = " \\ingroup TaskCtrl"]
	pub fn vTaskPrioritySet(xTask: TaskHandle_t, uxNewPriority: UBaseType_t);
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskSuspend( TaskHandle_t xTaskToSuspend );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " INCLUDE_vTaskSuspend must be defined as 1 for this function to be available."]
	#[doc = " See the configuration section for more information."]
	#[doc = ""]
	#[doc = " Suspend any task.  When suspended a task will never get any microcontroller"]
	#[doc = " processing time, no matter what its priority."]
	#[doc = ""]
	#[doc = " Calls to vTaskSuspend are not accumulative -"]
	#[doc = " i.e. calling vTaskSuspend () twice on the same task still only requires one"]
	#[doc = " call to vTaskResume () to ready the suspended task."]
	#[doc = ""]
	#[doc = " @param xTaskToSuspend Handle to the task being suspended.  Passing a NULL"]
	#[doc = " handle will cause the calling task to be suspended."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = " void vAFunction( void )"]
	#[doc = " {"]
	#[doc = " TaskHandle_t xHandle;"]
	#[doc = ""]
	#[doc = "   // Create a task, storing the handle."]
	#[doc = "   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, &xHandle );"]
	#[doc = ""]
	#[doc = "   // ..."]
	#[doc = ""]
	#[doc = "   // Use the handle to suspend the created task."]
	#[doc = "   vTaskSuspend( xHandle );"]
	#[doc = ""]
	#[doc = "   // ..."]
	#[doc = ""]
	#[doc = "   // The created task will not run during this period, unless"]
	#[doc = "   // another task calls vTaskResume( xHandle )."]
	#[doc = ""]
	#[doc = "   //..."]
	#[doc = ""]
	#[doc = ""]
	#[doc = "   // Suspend ourselves."]
	#[doc = "   vTaskSuspend( NULL );"]
	#[doc = ""]
	#[doc = "   // We cannot get here unless another task calls vTaskResume"]
	#[doc = "   // with our handle as the parameter."]
	#[doc = " }"]
	#[doc = " @endcode"]
	#[doc = " \\defgroup vTaskSuspend vTaskSuspend"]
	#[doc = " \\ingroup TaskCtrl"]
	pub fn vTaskSuspend(xTaskToSuspend: TaskHandle_t);
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskResume( TaskHandle_t xTaskToResume );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " INCLUDE_vTaskSuspend must be defined as 1 for this function to be available."]
	#[doc = " See the configuration section for more information."]
	#[doc = ""]
	#[doc = " Resumes a suspended task."]
	#[doc = ""]
	#[doc = " A task that has been suspended by one or more calls to vTaskSuspend ()"]
	#[doc = " will be made available for running again by a single call to"]
	#[doc = " vTaskResume ()."]
	#[doc = ""]
	#[doc = " @param xTaskToResume Handle to the task being readied."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = " void vAFunction( void )"]
	#[doc = " {"]
	#[doc = " TaskHandle_t xHandle;"]
	#[doc = ""]
	#[doc = "   // Create a task, storing the handle."]
	#[doc = "   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, &xHandle );"]
	#[doc = ""]
	#[doc = "   // ..."]
	#[doc = ""]
	#[doc = "   // Use the handle to suspend the created task."]
	#[doc = "   vTaskSuspend( xHandle );"]
	#[doc = ""]
	#[doc = "   // ..."]
	#[doc = ""]
	#[doc = "   // The created task will not run during this period, unless"]
	#[doc = "   // another task calls vTaskResume( xHandle )."]
	#[doc = ""]
	#[doc = "   //..."]
	#[doc = ""]
	#[doc = ""]
	#[doc = "   // Resume the suspended task ourselves."]
	#[doc = "   vTaskResume( xHandle );"]
	#[doc = ""]
	#[doc = "   // The created task will once again get microcontroller processing"]
	#[doc = "   // time in accordance with its priority within the system."]
	#[doc = " }"]
	#[doc = " @endcode"]
	#[doc = " \\defgroup vTaskResume vTaskResume"]
	#[doc = " \\ingroup TaskCtrl"]
	pub fn vTaskResume(xTaskToResume: TaskHandle_t);
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void xTaskResumeFromISR( TaskHandle_t xTaskToResume );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " INCLUDE_xTaskResumeFromISR must be defined as 1 for this function to be"]
	#[doc = " available.  See the configuration section for more information."]
	#[doc = ""]
	#[doc = " An implementation of vTaskResume() that can be called from within an ISR."]
	#[doc = ""]
	#[doc = " A task that has been suspended by one or more calls to vTaskSuspend ()"]
	#[doc = " will be made available for running again by a single call to"]
	#[doc = " xTaskResumeFromISR ()."]
	#[doc = ""]
	#[doc = " xTaskResumeFromISR() should not be used to synchronise a task with an"]
	#[doc = " interrupt if there is a chance that the interrupt could arrive prior to the"]
	#[doc = " task being suspended - as this can lead to interrupts being missed. Use of a"]
	#[doc = " semaphore as a synchronisation mechanism would avoid this eventuality."]
	#[doc = ""]
	#[doc = " @param xTaskToResume Handle to the task being readied."]
	#[doc = ""]
	#[doc = " @return pdTRUE if resuming the task should result in a context switch,"]
	#[doc = " otherwise pdFALSE. This is used by the ISR to determine if a context switch"]
	#[doc = " may be required following the ISR."]
	#[doc = ""]
	#[doc = " \\defgroup vTaskResumeFromISR vTaskResumeFromISR"]
	#[doc = " \\ingroup TaskCtrl"]
	pub fn xTaskResumeFromISR(xTaskToResume: TaskHandle_t) -> BaseType_t;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskStartScheduler( void );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " Starts the real time kernel tick processing.  After calling the kernel"]
	#[doc = " has control over which tasks are executed and when."]
	#[doc = ""]
	#[doc = " See the demo application file main.c for an example of creating"]
	#[doc = " tasks and starting the kernel."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = " void vAFunction( void )"]
	#[doc = " {"]
	#[doc = "   // Create at least one task before starting the kernel."]
	#[doc = "   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, NULL );"]
	#[doc = ""]
	#[doc = "   // Start the real time kernel with preemption."]
	#[doc = "   vTaskStartScheduler ();"]
	#[doc = ""]
	#[doc = "   // Will not get here unless a task calls vTaskEndScheduler ()"]
	#[doc = " }"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " \\defgroup vTaskStartScheduler vTaskStartScheduler"]
	#[doc = " \\ingroup SchedulerControl"]
	pub fn vTaskStartScheduler();
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskEndScheduler( void );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " NOTE:  At the time of writing only the x86 real mode port, which runs on a PC"]
	#[doc = " in place of DOS, implements this function."]
	#[doc = ""]
	#[doc = " Stops the real time kernel tick.  All created tasks will be automatically"]
	#[doc = " deleted and multitasking (either preemptive or cooperative) will"]
	#[doc = " stop.  Execution then resumes from the point where vTaskStartScheduler ()"]
	#[doc = " was called, as if vTaskStartScheduler () had just returned."]
	#[doc = ""]
	#[doc = " See the demo application file main. c in the demo/PC directory for an"]
	#[doc = " example that uses vTaskEndScheduler ()."]
	#[doc = ""]
	#[doc = " vTaskEndScheduler () requires an exit function to be defined within the"]
	#[doc = " portable layer (see vPortEndScheduler () in port. c for the PC port).  This"]
	#[doc = " performs hardware specific operations such as stopping the kernel tick."]
	#[doc = ""]
	#[doc = " vTaskEndScheduler () will cause all of the resources allocated by the"]
	#[doc = " kernel to be freed - but will not free resources allocated by application"]
	#[doc = " tasks."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskCode( void * pvParameters )"]
	#[doc = " {"]
	#[doc = "   for( ;; )"]
	#[doc = "   {"]
	#[doc = "       // Task code goes here."]
	#[doc = ""]
	#[doc = "       // At some point we want to end the real time kernel processing"]
	#[doc = "       // so call ..."]
	#[doc = "       vTaskEndScheduler ();"]
	#[doc = "   }"]
	#[doc = " }"]
	#[doc = ""]
	#[doc = " void vAFunction( void )"]
	#[doc = " {"]
	#[doc = "   // Create at least one task before starting the kernel."]
	#[doc = "   xTaskCreate( vTaskCode, \"NAME\", STACK_SIZE, NULL, tskIDLE_PRIORITY, NULL );"]
	#[doc = ""]
	#[doc = "   // Start the real time kernel with preemption."]
	#[doc = "   vTaskStartScheduler ();"]
	#[doc = ""]
	#[doc = "   // Will only get here when the vTaskCode () task has called"]
	#[doc = "   // vTaskEndScheduler ().  When we get here we are back to single task"]
	#[doc = "   // execution."]
	#[doc = " }"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " \\defgroup vTaskEndScheduler vTaskEndScheduler"]
	#[doc = " \\ingroup SchedulerControl"]
	pub fn vTaskEndScheduler();
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskSuspendAll( void );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " Suspends the scheduler without disabling interrupts.  Context switches will"]
	#[doc = " not occur while the scheduler is suspended."]
	#[doc = ""]
	#[doc = " After calling vTaskSuspendAll () the calling task will continue to execute"]
	#[doc = " without risk of being swapped out until a call to xTaskResumeAll () has been"]
	#[doc = " made."]
	#[doc = ""]
	#[doc = " API functions that have the potential to cause a context switch (for example,"]
	#[doc = " xTaskDelayUntil(), xQueueSend(), etc.) must not be called while the scheduler"]
	#[doc = " is suspended."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = " void vTask1( void * pvParameters )"]
	#[doc = " {"]
	#[doc = "   for( ;; )"]
	#[doc = "   {"]
	#[doc = "       // Task code goes here."]
	#[doc = ""]
	#[doc = "       // ..."]
	#[doc = ""]
	#[doc = "       // At some point the task wants to perform a long operation during"]
	#[doc = "       // which it does not want to get swapped out.  It cannot use"]
	#[doc = "       // taskENTER_CRITICAL ()/taskEXIT_CRITICAL () as the length of the"]
	#[doc = "       // operation may cause interrupts to be missed - including the"]
	#[doc = "       // ticks."]
	#[doc = ""]
	#[doc = "       // Prevent the real time kernel swapping out the task."]
	#[doc = "       vTaskSuspendAll ();"]
	#[doc = ""]
	#[doc = "       // Perform the operation here.  There is no need to use critical"]
	#[doc = "       // sections as we have all the microcontroller processing time."]
	#[doc = "       // During this time interrupts will still operate and the kernel"]
	#[doc = "       // tick count will be maintained."]
	#[doc = ""]
	#[doc = "       // ..."]
	#[doc = ""]
	#[doc = "       // The operation is complete.  Restart the kernel."]
	#[doc = "       xTaskResumeAll ();"]
	#[doc = "   }"]
	#[doc = " }"]
	#[doc = " @endcode"]
	#[doc = " \\defgroup vTaskSuspendAll vTaskSuspendAll"]
	#[doc = " \\ingroup SchedulerControl"]
	pub fn vTaskSuspendAll();
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " BaseType_t xTaskResumeAll( void );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " Resumes scheduler activity after it was suspended by a call to"]
	#[doc = " vTaskSuspendAll()."]
	#[doc = ""]
	#[doc = " xTaskResumeAll() only resumes the scheduler.  It does not unsuspend tasks"]
	#[doc = " that were previously suspended by a call to vTaskSuspend()."]
	#[doc = ""]
	#[doc = " @return If resuming the scheduler caused a context switch then pdTRUE is"]
	#[doc = "         returned, otherwise pdFALSE is returned."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = " void vTask1( void * pvParameters )"]
	#[doc = " {"]
	#[doc = "   for( ;; )"]
	#[doc = "   {"]
	#[doc = "       // Task code goes here."]
	#[doc = ""]
	#[doc = "       // ..."]
	#[doc = ""]
	#[doc = "       // At some point the task wants to perform a long operation during"]
	#[doc = "       // which it does not want to get swapped out.  It cannot use"]
	#[doc = "       // taskENTER_CRITICAL ()/taskEXIT_CRITICAL () as the length of the"]
	#[doc = "       // operation may cause interrupts to be missed - including the"]
	#[doc = "       // ticks."]
	#[doc = ""]
	#[doc = "       // Prevent the real time kernel swapping out the task."]
	#[doc = "       vTaskSuspendAll ();"]
	#[doc = ""]
	#[doc = "       // Perform the operation here.  There is no need to use critical"]
	#[doc = "       // sections as we have all the microcontroller processing time."]
	#[doc = "       // During this time interrupts will still operate and the real"]
	#[doc = "       // time kernel tick count will be maintained."]
	#[doc = ""]
	#[doc = "       // ..."]
	#[doc = ""]
	#[doc = "       // The operation is complete.  Restart the kernel.  We want to force"]
	#[doc = "       // a context switch - but there is no point if resuming the scheduler"]
	#[doc = "       // caused a context switch already."]
	#[doc = "       if( !xTaskResumeAll () )"]
	#[doc = "       {"]
	#[doc = "            taskYIELD ();"]
	#[doc = "       }"]
	#[doc = "   }"]
	#[doc = " }"]
	#[doc = " @endcode"]
	#[doc = " \\defgroup xTaskResumeAll xTaskResumeAll"]
	#[doc = " \\ingroup SchedulerControl"]
	pub fn xTaskResumeAll() -> BaseType_t;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " TickType_t xTaskGetTickCount( void );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " @return The count of ticks since vTaskStartScheduler was called."]
	#[doc = ""]
	#[doc = " \\defgroup xTaskGetTickCount xTaskGetTickCount"]
	#[doc = " \\ingroup TaskUtils"]
	pub fn xTaskGetTickCount() -> TickType_t;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " TickType_t xTaskGetTickCountFromISR( void );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " @return The count of ticks since vTaskStartScheduler was called."]
	#[doc = ""]
	#[doc = " This is a version of xTaskGetTickCount() that is safe to be called from an"]
	#[doc = " ISR - provided that TickType_t is the natural word size of the"]
	#[doc = " microcontroller being used or interrupt nesting is either not supported or"]
	#[doc = " not being used."]
	#[doc = ""]
	#[doc = " \\defgroup xTaskGetTickCountFromISR xTaskGetTickCountFromISR"]
	#[doc = " \\ingroup TaskUtils"]
	pub fn xTaskGetTickCountFromISR() -> TickType_t;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " uint16_t uxTaskGetNumberOfTasks( void );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " @return The number of tasks that the real time kernel is currently managing."]
	#[doc = " This includes all ready, blocked and suspended tasks.  A task that"]
	#[doc = " has been deleted but not yet freed by the idle task will also be"]
	#[doc = " included in the count."]
	#[doc = ""]
	#[doc = " \\defgroup uxTaskGetNumberOfTasks uxTaskGetNumberOfTasks"]
	#[doc = " \\ingroup TaskUtils"]
	pub fn uxTaskGetNumberOfTasks() -> UBaseType_t;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " char *pcTaskGetName( TaskHandle_t xTaskToQuery );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " @return The text (human readable) name of the task referenced by the handle"]
	#[doc = " xTaskToQuery.  A task can query its own name by either passing in its own"]
	#[doc = " handle, or by setting xTaskToQuery to NULL."]
	#[doc = ""]
	#[doc = " \\defgroup pcTaskGetName pcTaskGetName"]
	#[doc = " \\ingroup TaskUtils"]
	pub fn pcTaskGetName(xTaskToQuery: TaskHandle_t) -> *mut core::ffi::c_char;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " TaskHandle_t xTaskGetHandle( const char *pcNameToQuery );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " NOTE:  This function takes a relatively long time to complete and should be"]
	#[doc = " used sparingly."]
	#[doc = ""]
	#[doc = " @return The handle of the task that has the human readable name pcNameToQuery."]
	#[doc = " NULL is returned if no matching name is found.  INCLUDE_xTaskGetHandle"]
	#[doc = " must be set to 1 in FreeRTOSConfig.h for pcTaskGetHandle() to be available."]
	#[doc = ""]
	#[doc = " \\defgroup pcTaskGetHandle pcTaskGetHandle"]
	#[doc = " \\ingroup TaskUtils"]
	pub fn xTaskGetHandle(pcNameToQuery: *const core::ffi::c_char) -> TaskHandle_t;
}
extern "C" {
	#[doc = " task.h"]
	#[doc = " @code{c}"]
	#[doc = " UBaseType_t uxTaskGetStackHighWaterMark( TaskHandle_t xTask );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " INCLUDE_uxTaskGetStackHighWaterMark must be set to 1 in FreeRTOSConfig.h for"]
	#[doc = " this function to be available."]
	#[doc = ""]
	#[doc = " Returns the high water mark of the stack associated with xTask.  That is,"]
	#[doc = " the minimum free stack space there has been (in words, so on a 32 bit machine"]
	#[doc = " a value of 1 means 4 bytes) since the task started.  The smaller the returned"]
	#[doc = " number the closer the task has come to overflowing its stack."]
	#[doc = ""]
	#[doc = " uxTaskGetStackHighWaterMark() and uxTaskGetStackHighWaterMark2() are the"]
	#[doc = " same except for their return type.  Using configSTACK_DEPTH_TYPE allows the"]
	#[doc = " user to determine the return type.  It gets around the problem of the value"]
	#[doc = " overflowing on 8-bit types without breaking backward compatibility for"]
	#[doc = " applications that expect an 8-bit return type."]
	#[doc = ""]
	#[doc = " @param xTask Handle of the task associated with the stack to be checked."]
	#[doc = " Set xTask to NULL to check the stack of the calling task."]
	#[doc = ""]
	#[doc = " @return The smallest amount of free stack space there has been (in words, so"]
	#[doc = " actual spaces on the stack rather than bytes) since the task referenced by"]
	#[doc = " xTask was created."]
	pub fn uxTaskGetStackHighWaterMark(xTask: TaskHandle_t) -> UBaseType_t;
}
extern "C" {
	#[doc = " task.h"]
	#[doc = " @code{c}"]
	#[doc = " configSTACK_DEPTH_TYPE uxTaskGetStackHighWaterMark2( TaskHandle_t xTask );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " INCLUDE_uxTaskGetStackHighWaterMark2 must be set to 1 in FreeRTOSConfig.h for"]
	#[doc = " this function to be available."]
	#[doc = ""]
	#[doc = " Returns the high water mark of the stack associated with xTask.  That is,"]
	#[doc = " the minimum free stack space there has been (in words, so on a 32 bit machine"]
	#[doc = " a value of 1 means 4 bytes) since the task started.  The smaller the returned"]
	#[doc = " number the closer the task has come to overflowing its stack."]
	#[doc = ""]
	#[doc = " uxTaskGetStackHighWaterMark() and uxTaskGetStackHighWaterMark2() are the"]
	#[doc = " same except for their return type.  Using configSTACK_DEPTH_TYPE allows the"]
	#[doc = " user to determine the return type.  It gets around the problem of the value"]
	#[doc = " overflowing on 8-bit types without breaking backward compatibility for"]
	#[doc = " applications that expect an 8-bit return type."]
	#[doc = ""]
	#[doc = " @param xTask Handle of the task associated with the stack to be checked."]
	#[doc = " Set xTask to NULL to check the stack of the calling task."]
	#[doc = ""]
	#[doc = " @return The smallest amount of free stack space there has been (in words, so"]
	#[doc = " actual spaces on the stack rather than bytes) since the task referenced by"]
	#[doc = " xTask was created."]
	pub fn uxTaskGetStackHighWaterMark2(xTask: TaskHandle_t) -> u16;
}
extern "C" {
	pub fn vTaskSetThreadLocalStoragePointer(xTaskToSet: TaskHandle_t, xIndex: BaseType_t, pvValue: *mut core::ffi::c_void);
}
extern "C" {
	pub fn pvTaskGetThreadLocalStoragePointer(xTaskToQuery: TaskHandle_t, xIndex: BaseType_t) -> *mut core::ffi::c_void;
}
extern "C" {
	#[doc = " task.h"]
	#[doc = " @code{c}"]
	#[doc = " void vApplicationGetIdleTaskMemory( StaticTask_t ** ppxIdleTaskTCBBuffer, StackType_t ** ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize )"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " This function is used to provide a statically allocated block of memory to FreeRTOS to hold the Idle Task TCB.  This function is required when"]
	#[doc = " configSUPPORT_STATIC_ALLOCATION is set.  For more information see this URI: https://www.FreeRTOS.org/a00110.html#configSUPPORT_STATIC_ALLOCATION"]
	#[doc = ""]
	#[doc = " @param ppxIdleTaskTCBBuffer A handle to a statically allocated TCB buffer"]
	#[doc = " @param ppxIdleTaskStackBuffer A handle to a statically allocated Stack buffer for the idle task"]
	#[doc = " @param pulIdleTaskStackSize A pointer to the number of elements that will fit in the allocated stack buffer"]
	pub fn vApplicationGetIdleTaskMemory(ppxIdleTaskTCBBuffer: *mut *mut StaticTask_t,
	                                     ppxIdleTaskStackBuffer: *mut *mut StackType_t,
	                                     pulIdleTaskStackSize: *mut u32);
}
extern "C" {
	#[doc = " task.h"]
	#[doc = " @code{c}"]
	#[doc = " BaseType_t xTaskCallApplicationTaskHook( TaskHandle_t xTask, void *pvParameter );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " Calls the hook function associated with xTask.  Passing xTask as NULL has"]
	#[doc = " the effect of calling the Running tasks (the calling task) hook function."]
	#[doc = ""]
	#[doc = " pvParameter is passed to the hook function for the task to interpret as it"]
	#[doc = " wants.  The return value is the value returned by the task hook function"]
	#[doc = " registered by the user."]
	pub fn xTaskCallApplicationTaskHook(xTask: TaskHandle_t, pvParameter: *mut core::ffi::c_void) -> BaseType_t;
}
extern "C" {
	#[doc = " xTaskGetIdleTaskHandle() is only available if"]
	#[doc = " INCLUDE_xTaskGetIdleTaskHandle is set to 1 in FreeRTOSConfig.h."]
	#[doc = ""]
	#[doc = " Simply returns the handle of the idle task.  It is not valid to call"]
	#[doc = " xTaskGetIdleTaskHandle() before the scheduler has been started."]
	pub fn xTaskGetIdleTaskHandle() -> TaskHandle_t;
}
extern "C" {
	#[doc = " configUSE_TRACE_FACILITY must be defined as 1 in FreeRTOSConfig.h for"]
	#[doc = " uxTaskGetSystemState() to be available."]
	#[doc = ""]
	#[doc = " uxTaskGetSystemState() populates an TaskStatus_t structure for each task in"]
	#[doc = " the system.  TaskStatus_t structures contain, among other things, members"]
	#[doc = " for the task handle, task name, task priority, task state, and total amount"]
	#[doc = " of run time consumed by the task.  See the TaskStatus_t structure"]
	#[doc = " definition in this file for the full member list."]
	#[doc = ""]
	#[doc = " NOTE:  This function is intended for debugging use only as its use results in"]
	#[doc = " the scheduler remaining suspended for an extended period."]
	#[doc = ""]
	#[doc = " @param pxTaskStatusArray A pointer to an array of TaskStatus_t structures."]
	#[doc = " The array must contain at least one TaskStatus_t structure for each task"]
	#[doc = " that is under the control of the RTOS.  The number of tasks under the control"]
	#[doc = " of the RTOS can be determined using the uxTaskGetNumberOfTasks() API function."]
	#[doc = ""]
	#[doc = " @param uxArraySize The size of the array pointed to by the pxTaskStatusArray"]
	#[doc = " parameter.  The size is specified as the number of indexes in the array, or"]
	#[doc = " the number of TaskStatus_t structures contained in the array, not by the"]
	#[doc = " number of bytes in the array."]
	#[doc = ""]
	#[doc = " @param pulTotalRunTime If configGENERATE_RUN_TIME_STATS is set to 1 in"]
	#[doc = " FreeRTOSConfig.h then *pulTotalRunTime is set by uxTaskGetSystemState() to the"]
	#[doc = " total run time (as defined by the run time stats clock, see"]
	#[doc = " https://www.FreeRTOS.org/rtos-run-time-stats.html) since the target booted."]
	#[doc = " pulTotalRunTime can be set to NULL to omit the total run time information."]
	#[doc = ""]
	#[doc = " @return The number of TaskStatus_t structures that were populated by"]
	#[doc = " uxTaskGetSystemState().  This should equal the number returned by the"]
	#[doc = " uxTaskGetNumberOfTasks() API function, but will be zero if the value passed"]
	#[doc = " in the uxArraySize parameter was too small."]
	#[doc = ""]
	#[doc = " Example usage:"]
	#[doc = " @code{c}"]
	#[doc = "  // This example demonstrates how a human readable table of run time stats"]
	#[doc = "  // information is generated from raw data provided by uxTaskGetSystemState()."]
	#[doc = "  // The human readable table is written to pcWriteBuffer"]
	#[doc = "  void vTaskGetRunTimeStats( char *pcWriteBuffer )"]
	#[doc = "  {"]
	#[doc = "  TaskStatus_t *pxTaskStatusArray;"]
	#[doc = "  volatile UBaseType_t uxArraySize, x;"]
	#[doc = "  configRUN_TIME_COUNTER_TYPE ulTotalRunTime, ulStatsAsPercentage;"]
	#[doc = ""]
	#[doc = "      // Make sure the write buffer does not contain a string."]
	#[doc = " pcWriteBuffer = 0x00;"]
	#[doc = ""]
	#[doc = "      // Take a snapshot of the number of tasks in case it changes while this"]
	#[doc = "      // function is executing."]
	#[doc = "      uxArraySize = uxTaskGetNumberOfTasks();"]
	#[doc = ""]
	#[doc = "      // Allocate a TaskStatus_t structure for each task.  An array could be"]
	#[doc = "      // allocated statically at compile time."]
	#[doc = "      pxTaskStatusArray = pvPortMalloc( uxArraySize * sizeof( TaskStatus_t ) );"]
	#[doc = ""]
	#[doc = "      if( pxTaskStatusArray != NULL )"]
	#[doc = "      {"]
	#[doc = "          // Generate raw status information about each task."]
	#[doc = "          uxArraySize = uxTaskGetSystemState( pxTaskStatusArray, uxArraySize, &ulTotalRunTime );"]
	#[doc = ""]
	#[doc = "          // For percentage calculations."]
	#[doc = "          ulTotalRunTime /= 100UL;"]
	#[doc = ""]
	#[doc = "          // Avoid divide by zero errors."]
	#[doc = "          if( ulTotalRunTime > 0 )"]
	#[doc = "          {"]
	#[doc = "              // For each populated position in the pxTaskStatusArray array,"]
	#[doc = "              // format the raw data as human readable ASCII data"]
	#[doc = "              for( x = 0; x < uxArraySize; x++ )"]
	#[doc = "              {"]
	#[doc = "                  // What percentage of the total run time has the task used?"]
	#[doc = "                  // This will always be rounded down to the nearest integer."]
	#[doc = "                  // ulTotalRunTimeDiv100 has already been divided by 100."]
	#[doc = "                  ulStatsAsPercentage = pxTaskStatusArray[ x ].ulRunTimeCounter / ulTotalRunTime;"]
	#[doc = ""]
	#[doc = "                  if( ulStatsAsPercentage > 0UL )"]
	#[doc = "                  {"]
	#[doc = "                      sprintf( pcWriteBuffer, \"%s\\t\\t%lu\\t\\t%lu%%\\r\\n\", pxTaskStatusArray[ x ].pcTaskName, pxTaskStatusArray[ x ].ulRunTimeCounter, ulStatsAsPercentage );"]
	#[doc = "                  }"]
	#[doc = "                  else"]
	#[doc = "                  {"]
	#[doc = "                      // If the percentage is zero here then the task has"]
	#[doc = "                      // consumed less than 1% of the total run time."]
	#[doc = "                      sprintf( pcWriteBuffer, \"%s\\t\\t%lu\\t\\t<1%%\\r\\n\", pxTaskStatusArray[ x ].pcTaskName, pxTaskStatusArray[ x ].ulRunTimeCounter );"]
	#[doc = "                  }"]
	#[doc = ""]
	#[doc = "                  pcWriteBuffer += strlen( ( char * ) pcWriteBuffer );"]
	#[doc = "              }"]
	#[doc = "          }"]
	#[doc = ""]
	#[doc = "          // The array is no longer needed, free the memory it consumes."]
	#[doc = "          vPortFree( pxTaskStatusArray );"]
	#[doc = "      }"]
	#[doc = "  }"]
	#[doc = "  @endcode"]
	pub fn uxTaskGetSystemState(pxTaskStatusArray: *mut TaskStatus_t,
	                            uxArraySize: UBaseType_t,
	                            pulTotalRunTime: *mut u32)
	                            -> UBaseType_t;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskList( char *pcWriteBuffer );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " configUSE_TRACE_FACILITY and configUSE_STATS_FORMATTING_FUNCTIONS must"]
	#[doc = " both be defined as 1 for this function to be available.  See the"]
	#[doc = " configuration section of the FreeRTOS.org website for more information."]
	#[doc = ""]
	#[doc = " NOTE 1: This function will disable interrupts for its duration.  It is"]
	#[doc = " not intended for normal application runtime use but as a debug aid."]
	#[doc = ""]
	#[doc = " Lists all the current tasks, along with their current state and stack"]
	#[doc = " usage high water mark."]
	#[doc = ""]
	#[doc = " Tasks are reported as blocked ('B'), ready ('R'), deleted ('D') or"]
	#[doc = " suspended ('S')."]
	#[doc = ""]
	#[doc = " PLEASE NOTE:"]
	#[doc = ""]
	#[doc = " This function is provided for convenience only, and is used by many of the"]
	#[doc = " demo applications.  Do not consider it to be part of the scheduler."]
	#[doc = ""]
	#[doc = " vTaskList() calls uxTaskGetSystemState(), then formats part of the"]
	#[doc = " uxTaskGetSystemState() output into a human readable table that displays task:"]
	#[doc = " names, states, priority, stack usage and task number."]
	#[doc = " Stack usage specified as the number of unused StackType_t words stack can hold"]
	#[doc = " on top of stack - not the number of bytes."]
	#[doc = ""]
	#[doc = " vTaskList() has a dependency on the sprintf() C library function that might"]
	#[doc = " bloat the code size, use a lot of stack, and provide different results on"]
	#[doc = " different platforms.  An alternative, tiny, third party, and limited"]
	#[doc = " functionality implementation of sprintf() is provided in many of the"]
	#[doc = " FreeRTOS/Demo sub-directories in a file called printf-stdarg.c (note"]
	#[doc = " printf-stdarg.c does not provide a full snprintf() implementation!)."]
	#[doc = ""]
	#[doc = " It is recommended that production systems call uxTaskGetSystemState()"]
	#[doc = " directly to get access to raw stats data, rather than indirectly through a"]
	#[doc = " call to vTaskList()."]
	#[doc = ""]
	#[doc = " @param pcWriteBuffer A buffer into which the above mentioned details"]
	#[doc = " will be written, in ASCII form.  This buffer is assumed to be large"]
	#[doc = " enough to contain the generated report.  Approximately 40 bytes per"]
	#[doc = " task should be sufficient."]
	#[doc = ""]
	#[doc = " \\defgroup vTaskList vTaskList"]
	#[doc = " \\ingroup TaskUtils"]
	pub fn vTaskList(pcWriteBuffer: *mut core::ffi::c_char);
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " void vTaskGetRunTimeStats( char *pcWriteBuffer );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " configGENERATE_RUN_TIME_STATS and configUSE_STATS_FORMATTING_FUNCTIONS"]
	#[doc = " must both be defined as 1 for this function to be available.  The application"]
	#[doc = " must also then provide definitions for"]
	#[doc = " portCONFIGURE_TIMER_FOR_RUN_TIME_STATS() and portGET_RUN_TIME_COUNTER_VALUE()"]
	#[doc = " to configure a peripheral timer/counter and return the timers current count"]
	#[doc = " value respectively.  The counter should be at least 10 times the frequency of"]
	#[doc = " the tick count."]
	#[doc = ""]
	#[doc = " NOTE 1: This function will disable interrupts for its duration.  It is"]
	#[doc = " not intended for normal application runtime use but as a debug aid."]
	#[doc = ""]
	#[doc = " Setting configGENERATE_RUN_TIME_STATS to 1 will result in a total"]
	#[doc = " accumulated execution time being stored for each task.  The resolution"]
	#[doc = " of the accumulated time value depends on the frequency of the timer"]
	#[doc = " configured by the portCONFIGURE_TIMER_FOR_RUN_TIME_STATS() macro."]
	#[doc = " Calling vTaskGetRunTimeStats() writes the total execution time of each"]
	#[doc = " task into a buffer, both as an absolute count value and as a percentage"]
	#[doc = " of the total system execution time."]
	#[doc = ""]
	#[doc = " NOTE 2:"]
	#[doc = ""]
	#[doc = " This function is provided for convenience only, and is used by many of the"]
	#[doc = " demo applications.  Do not consider it to be part of the scheduler."]
	#[doc = ""]
	#[doc = " vTaskGetRunTimeStats() calls uxTaskGetSystemState(), then formats part of the"]
	#[doc = " uxTaskGetSystemState() output into a human readable table that displays the"]
	#[doc = " amount of time each task has spent in the Running state in both absolute and"]
	#[doc = " percentage terms."]
	#[doc = ""]
	#[doc = " vTaskGetRunTimeStats() has a dependency on the sprintf() C library function"]
	#[doc = " that might bloat the code size, use a lot of stack, and provide different"]
	#[doc = " results on different platforms.  An alternative, tiny, third party, and"]
	#[doc = " limited functionality implementation of sprintf() is provided in many of the"]
	#[doc = " FreeRTOS/Demo sub-directories in a file called printf-stdarg.c (note"]
	#[doc = " printf-stdarg.c does not provide a full snprintf() implementation!)."]
	#[doc = ""]
	#[doc = " It is recommended that production systems call uxTaskGetSystemState() directly"]
	#[doc = " to get access to raw stats data, rather than indirectly through a call to"]
	#[doc = " vTaskGetRunTimeStats()."]
	#[doc = ""]
	#[doc = " @param pcWriteBuffer A buffer into which the execution times will be"]
	#[doc = " written, in ASCII form.  This buffer is assumed to be large enough to"]
	#[doc = " contain the generated report.  Approximately 40 bytes per task should"]
	#[doc = " be sufficient."]
	#[doc = ""]
	#[doc = " \\defgroup vTaskGetRunTimeStats vTaskGetRunTimeStats"]
	#[doc = " \\ingroup TaskUtils"]
	pub fn vTaskGetRunTimeStats(pcWriteBuffer: *mut core::ffi::c_char);
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " configRUN_TIME_COUNTER_TYPE ulTaskGetIdleRunTimeCounter( void );"]
	#[doc = " configRUN_TIME_COUNTER_TYPE ulTaskGetIdleRunTimePercent( void );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " configGENERATE_RUN_TIME_STATS, configUSE_STATS_FORMATTING_FUNCTIONS and"]
	#[doc = " INCLUDE_xTaskGetIdleTaskHandle must all be defined as 1 for these functions"]
	#[doc = " to be available.  The application must also then provide definitions for"]
	#[doc = " portCONFIGURE_TIMER_FOR_RUN_TIME_STATS() and portGET_RUN_TIME_COUNTER_VALUE()"]
	#[doc = " to configure a peripheral timer/counter and return the timers current count"]
	#[doc = " value respectively.  The counter should be at least 10 times the frequency of"]
	#[doc = " the tick count."]
	#[doc = ""]
	#[doc = " Setting configGENERATE_RUN_TIME_STATS to 1 will result in a total"]
	#[doc = " accumulated execution time being stored for each task.  The resolution"]
	#[doc = " of the accumulated time value depends on the frequency of the timer"]
	#[doc = " configured by the portCONFIGURE_TIMER_FOR_RUN_TIME_STATS() macro."]
	#[doc = " While uxTaskGetSystemState() and vTaskGetRunTimeStats() writes the total"]
	#[doc = " execution time of each task into a buffer, ulTaskGetIdleRunTimeCounter()"]
	#[doc = " returns the total execution time of just the idle task and"]
	#[doc = " ulTaskGetIdleRunTimePercent() returns the percentage of the CPU time used by"]
	#[doc = " just the idle task."]
	#[doc = ""]
	#[doc = " Note the amount of idle time is only a good measure of the slack time in a"]
	#[doc = " system if there are no other tasks executing at the idle priority, tickless"]
	#[doc = " idle is not used, and configIDLE_SHOULD_YIELD is set to 0."]
	#[doc = ""]
	#[doc = " @return The total run time of the idle task or the percentage of the total"]
	#[doc = " run time consumed by the idle task.  This is the amount of time the"]
	#[doc = " idle task has actually been executing.  The unit of time is dependent on the"]
	#[doc = " frequency configured using the portCONFIGURE_TIMER_FOR_RUN_TIME_STATS() and"]
	#[doc = " portGET_RUN_TIME_COUNTER_VALUE() macros."]
	#[doc = ""]
	#[doc = " \\defgroup ulTaskGetIdleRunTimeCounter ulTaskGetIdleRunTimeCounter"]
	#[doc = " \\ingroup TaskUtils"]
	pub fn ulTaskGetIdleRunTimeCounter() -> u32;
}
extern "C" {
	pub fn ulTaskGetIdleRunTimePercent() -> u32;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " BaseType_t xTaskNotifyIndexed( TaskHandle_t xTaskToNotify, UBaseType_t uxIndexToNotify, uint32_t ulValue, eNotifyAction eAction );"]
	#[doc = " BaseType_t xTaskNotify( TaskHandle_t xTaskToNotify, uint32_t ulValue, eNotifyAction eAction );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " See https://www.FreeRTOS.org/RTOS-task-notifications.html for details."]
	#[doc = ""]
	#[doc = " configUSE_TASK_NOTIFICATIONS must be undefined or defined as 1 for these"]
	#[doc = " functions to be available."]
	#[doc = ""]
	#[doc = " Sends a direct to task notification to a task, with an optional value and"]
	#[doc = " action."]
	#[doc = ""]
	#[doc = " Each task has a private array of \"notification values\" (or 'notifications'),"]
	#[doc = " each of which is a 32-bit unsigned integer (uint32_t).  The constant"]
	#[doc = " configTASK_NOTIFICATION_ARRAY_ENTRIES sets the number of indexes in the"]
	#[doc = " array, and (for backward compatibility) defaults to 1 if left undefined."]
	#[doc = " Prior to FreeRTOS V10.4.0 there was only one notification value per task."]
	#[doc = ""]
	#[doc = " Events can be sent to a task using an intermediary object.  Examples of such"]
	#[doc = " objects are queues, semaphores, mutexes and event groups.  Task notifications"]
	#[doc = " are a method of sending an event directly to a task without the need for such"]
	#[doc = " an intermediary object."]
	#[doc = ""]
	#[doc = " A notification sent to a task can optionally perform an action, such as"]
	#[doc = " update, overwrite or increment one of the task's notification values.  In"]
	#[doc = " that way task notifications can be used to send data to a task, or be used as"]
	#[doc = " light weight and fast binary or counting semaphores."]
	#[doc = ""]
	#[doc = " A task can use xTaskNotifyWaitIndexed() or ulTaskNotifyTakeIndexed() to"]
	#[doc = " [optionally] block to wait for a notification to be pending.  The task does"]
	#[doc = " not consume any CPU time while it is in the Blocked state."]
	#[doc = ""]
	#[doc = " A notification sent to a task will remain pending until it is cleared by the"]
	#[doc = " task calling xTaskNotifyWaitIndexed() or ulTaskNotifyTakeIndexed() (or their"]
	#[doc = " un-indexed equivalents).  If the task was already in the Blocked state to"]
	#[doc = " wait for a notification when the notification arrives then the task will"]
	#[doc = " automatically be removed from the Blocked state (unblocked) and the"]
	#[doc = " notification cleared."]
	#[doc = ""]
	#[doc = " **NOTE** Each notification within the array operates independently - a task"]
	#[doc = " can only block on one notification within the array at a time and will not be"]
	#[doc = " unblocked by a notification sent to any other array index."]
	#[doc = ""]
	#[doc = " Backward compatibility information:"]
	#[doc = " Prior to FreeRTOS V10.4.0 each task had a single \"notification value\", and"]
	#[doc = " all task notification API functions operated on that value. Replacing the"]
	#[doc = " single notification value with an array of notification values necessitated a"]
	#[doc = " new set of API functions that could address specific notifications within the"]
	#[doc = " array.  xTaskNotify() is the original API function, and remains backward"]
	#[doc = " compatible by always operating on the notification value at index 0 in the"]
	#[doc = " array. Calling xTaskNotify() is equivalent to calling xTaskNotifyIndexed()"]
	#[doc = " with the uxIndexToNotify parameter set to 0."]
	#[doc = ""]
	#[doc = " @param xTaskToNotify The handle of the task being notified.  The handle to a"]
	#[doc = " task can be returned from the xTaskCreate() API function used to create the"]
	#[doc = " task, and the handle of the currently running task can be obtained by calling"]
	#[doc = " xTaskGetCurrentTaskHandle()."]
	#[doc = ""]
	#[doc = " @param uxIndexToNotify The index within the target task's array of"]
	#[doc = " notification values to which the notification is to be sent.  uxIndexToNotify"]
	#[doc = " must be less than configTASK_NOTIFICATION_ARRAY_ENTRIES.  xTaskNotify() does"]
	#[doc = " not have this parameter and always sends notifications to index 0."]
	#[doc = ""]
	#[doc = " @param ulValue Data that can be sent with the notification.  How the data is"]
	#[doc = " used depends on the value of the eAction parameter."]
	#[doc = ""]
	#[doc = " @param eAction Specifies how the notification updates the task's notification"]
	#[doc = " value, if at all.  Valid values for eAction are as follows:"]
	#[doc = ""]
	#[doc = " eSetBits -"]
	#[doc = " The target notification value is bitwise ORed with ulValue."]
	#[doc = " xTaskNotifyIndexed() always returns pdPASS in this case."]
	#[doc = ""]
	#[doc = " eIncrement -"]
	#[doc = " The target notification value is incremented.  ulValue is not used and"]
	#[doc = " xTaskNotifyIndexed() always returns pdPASS in this case."]
	#[doc = ""]
	#[doc = " eSetValueWithOverwrite -"]
	#[doc = " The target notification value is set to the value of ulValue, even if the"]
	#[doc = " task being notified had not yet processed the previous notification at the"]
	#[doc = " same array index (the task already had a notification pending at that index)."]
	#[doc = " xTaskNotifyIndexed() always returns pdPASS in this case."]
	#[doc = ""]
	#[doc = " eSetValueWithoutOverwrite -"]
	#[doc = " If the task being notified did not already have a notification pending at the"]
	#[doc = " same array index then the target notification value is set to ulValue and"]
	#[doc = " xTaskNotifyIndexed() will return pdPASS.  If the task being notified already"]
	#[doc = " had a notification pending at the same array index then no action is"]
	#[doc = " performed and pdFAIL is returned."]
	#[doc = ""]
	#[doc = " eNoAction -"]
	#[doc = " The task receives a notification at the specified array index without the"]
	#[doc = " notification value at that index being updated.  ulValue is not used and"]
	#[doc = " xTaskNotifyIndexed() always returns pdPASS in this case."]
	#[doc = ""]
	#[doc = " pulPreviousNotificationValue -"]
	#[doc = " Can be used to pass out the subject task's notification value before any"]
	#[doc = " bits are modified by the notify function."]
	#[doc = ""]
	#[doc = " @return Dependent on the value of eAction.  See the description of the"]
	#[doc = " eAction parameter."]
	#[doc = ""]
	#[doc = " \\defgroup xTaskNotifyIndexed xTaskNotifyIndexed"]
	#[doc = " \\ingroup TaskNotifications"]
	pub fn xTaskGenericNotify(xTaskToNotify: TaskHandle_t,
	                          uxIndexToNotify: UBaseType_t,
	                          ulValue: u32,
	                          eAction: eNotifyAction,
	                          pulPreviousNotificationValue: *mut u32)
	                          -> BaseType_t;
}
extern "C" {
	#[doc = " task. h"]
	#[doc = " @code{c}"]
	#[doc = " BaseType_t xTaskNotifyIndexedFromISR( TaskHandle_t xTaskToNotify, UBaseType_t uxIndexToNotify, uint32_t ulValue, eNotifyAction eAction, BaseType_t *pxHigherPriorityTaskWoken );"]
	#[doc = " BaseType_t xTaskNotifyFromISR( TaskHandle_t xTaskToNotify, uint32_t ulValue, eNotifyAction eAction, BaseType_t *pxHigherPriorityTaskWoken );"]
	#[doc = " @endcode"]
	#[doc = ""]
	#[doc = " See https://www.FreeRTOS.org/RTOS-task-notifications.html for details."]
	#[doc = ""]
	#[doc = " configUSE_TASK_NOTIFICATIONS must be undefined or defined as 1 for these"]
	#[doc = " functions to be available."]
	#[doc = ""]
	#[doc = " A version of xTaskNotifyIndexed() that can be used from an interrupt service"]
	#[doc = " routine (ISR)."]
	#[doc = ""]
	#[doc = " Each task has a private array of \"notification values\" (or 'notifications'),"]
